[{"_id":123,"stem":"Which of the following can aggravate acne?","opt1":"Steroids","opt2":"Tretinoins","opt3":"Doxycycline","opt4":"Benzoyl Peroxide"},{"_id":82,"stem":"In a patient who is on chemotherapy, and presenting with a history of fever, all of the following should be done EXCEPT","opt1":"Blood culture","opt2":"Urine culture","opt3":"Broad spectrum antibiotics","opt4":"Aspirin for symptomatic relief"},{"_id":6,"stem":"A 15-year-old girl who had menarche at the age of 13 years, complains of menstrual pain. She is not sexually active. Her examination & pelvic US were normal. How are you going to manage her?","opt1":"Laparotomy","opt2":"Danazol","opt3":"Cervical dilatation","opt4":"NSAIDs"},{"_id":135,"stem":"A 25-year-old female patient presented with a history of recurrent headaches. She gets about 2 episodes per week. The pain is mainly in the frontal and occipital regions. Which of the following is the most likely diagnosis?","opt1":"Migraine","opt2":"Tension headache","opt3":"Cluster headache","opt4":"Trigeminal neuralgia"},{"_id":162,"stem":"Which of the following is a characteristic pulmonary function test finding in COPD?","opt1":"Reduced FEV1\/FVC ratio","opt2":"Increased Total lung capacity (TLC)","opt3":"Increased FEV1","opt4":"Increased Diffusion capactiy of lung for Carbon Monoxide (DLCO)"},{"_id":163,"stem":"Which of the following drugs cause bone marrow suppression?","opt1":"Linezolid","opt2":"Chloramphenicol","opt3":"Indomethacin","opt4":"All of the above"},{"_id":7,"stem":"A 45-year-old patient presents with dysphagia for both liquids and solids. There is associated frequent regurgitation and chest pain. \n\nWhich of the following has the highest diagnostic value?","opt1":"Barium swallow","opt2":"Oesophageal manometry","opt3":"Upper GI endoscopy","opt4":"Response to a course of PPIs"},{"_id":83,"stem":"A 3 year old child wakes from sleep with features of croup. The differential diagnosis should include all of the following except","opt1":"Pneumonia","opt2":"Post nasal drip","opt3":"Tonsilitis","opt4":"Inhaled foreign body"},{"_id":134,"stem":"A singer complains of progressive breathy sound and easy fatiguability after performing for 3 months duration. He denies smoking and has no history of prolonged cough or hemoptysis.\n\nThe most likely condition is","opt1":"Laryngeal carcinoma","opt2":"Reinke's edema","opt3":"Vocal cord nodule","opt4":"Lung cancer"},{"_id":95,"stem":"A 24-year-old woman develops wheezing and shortness of breath when she is exposed to cold air or when she is exercising. She has noticed that these symptoms are becoming worse over the past few weeks. Which of the following is the agent of choice for the treatment of symptomatic relief?","opt1":"Inhaled short acting beta-2 agonists","opt2":"Oral theophylline","opt3":"Inhaled anticholinergics","opt4":"Oral antihistamines"}]