[{"_id":33,"stem":"The best detector of the progress of labor is","opt1":"Severity of pain","opt2":"Dilation","opt3":"Descent","opt4":"Dilation and descent"},{"_id":184,"stem":"A child presented with decreased hearing for a 1-year duration. He has been having recurrent upper respiratory tract infections. On examination, there is adenoid hypertrophy and fluid behind the ear drum. In addition to adenoidectomy, which of the following is required?","opt1":"Myringotomy","opt2":"Grommet tube insertion","opt3":"Antibiotics","opt4":"None"},{"_id":44,"stem":"A patient was diagnosed to have a duodenal 2 weeks ago. He was given a course of ranitidine. The breath test for H. pylori is positive. What is your choice of management?","opt1":"Omeprazole, clarithromycin and amoxycillin","opt2":"Bismuth, tetracyclin, and metronidazole","opt3":"Metronidazole, amoxicilin, d-omeprazole and tetracycline","opt4":"Continue ranitidine and add pantoprazole"},{"_id":235,"stem":"During a routine visit of a healthy 45-year-old woman, you note approximately 1 cm erosive ulceration on the lower portion of the ectocervix. Which of the following is the most appropriate next step?","opt1":"Punch biopsy of the lesion","opt2":"Viral cultures of the lesion for HSV","opt3":"Pap smear","opt4":"Cold knife conization of the cervix"},{"_id":13,"stem":"A 45-year-old man is brought to the emergency department following a road traffic accident. He was having a headache and dizziness on admission. During your night shift, he develops polyuria, and his serum creatinine level was 151 meq\/L.\n\nWhich of the following test is not indicated?","opt1":"Overnight dehydratiion test","opt2":"Measurement of response to desmopressin (dOAVP)","opt3":"Measurement of plasma and urine osmolality","opt4":"Measurement of morning cortisol level"},{"_id":262,"stem":"A patients with Alport’s syndrome are likely to","opt1":"Be female","opt2":"Be sterile","opt3":"Be deaf","opt4":"Have normal renal functions"},{"_id":274,"stem":"A 42-year-old man presents with fatigue and joint pain. On physical exam, he is found to have dark skin and a palpable liver. His urine analysis shows glucosuria. Which of the following will be most helpful in making the diagnosis?","opt1":"Ferritin level","opt2":"Ceruloplasmin","opt3":"Alpha trypsine","opt4":"Hb electrophoresis"},{"_id":52,"stem":"A 20-year-old married lady presented with a history of left lower abdominal pain and amenorrhea for 6 weeks. The most appropriate investigation to rule out a serious diagnosis is","opt1":"Complete blood count","opt2":"Pelvic USS","opt3":"Abdominal Xray","opt4":"Vaginal swab for culture and sensitivity"},{"_id":223,"stem":"A mother complains that her 4-year-old daughter's urine smells strange. Her urine dipstick is positive for leukocytes and nitrates but negative for blood. The most likely causative agent is","opt1":"Klebsiella","opt2":"Proteus","opt3":"E. coli","opt4":"Pseudomonas"},{"_id":29,"stem":"Which of the following is the most radiosensitive testicular tumour?","opt1":"Teratoma","opt2":"Yolk sac","opt3":"Choriocarcinoma","opt4":"Seminoma"}]