[{"_id":23,"stem":"An 8-year-old girl presented with fever, numerous bruises over the entire body, and pain in both legs. Physical examination revealed pallor, ecchymoses and petechiae on the face, trunk and extremities. The complete blood count reveals a haemoglobin level of 6.3d\/dL, a WBC count of 2800\/mm3 and a platelet count of 29,000\/mm3. Which of the following would be the most appropriate diagnostic test?","opt1":"Hb electrophoresis","opt2":"Erythrocyte sedimentation rate","opt3":"Liver and spleen scan","opt4":"Bone marrow aspiration"},{"_id":194,"stem":"A 5-year-old child was found to be pale and hemoglobin was 9 g\/dL. A blood picture revealed that he has microcytic hypochromic anemia. However, he did not have any anemic symptoms. What is the best management option?","opt1":"Daily multivitamin with iron","opt2":"Iron therapy and close observation","opt3":"Nutritional advices on high iron intake","opt4":"Serum protein electrophoresis"},{"_id":205,"stem":"A professional soccer player came with a history of trauma on the lateral aspect of the left knee. On examination, there is a reduced range of movements and there is a swelling on the medial aspect of the left knee.\r\n\r\nThe most likely diagnosis is","opt1":"Medial collateral ligament injury","opt2":"Lateral collateral ligament injury","opt3":"Medial meniscus tear","opt4":"Lateral meniscus tear"},{"_id":74,"stem":"On the 6th postoperative day after a closure of a colostomy, a 52-year-old man had a swinging fever followed by diarrhoea. The most likely diagnosis is","opt1":"Gastroenteritis","opt2":"Pelvic abscess","opt3":"Irritable bowel syndrome","opt4":"Cholecystitis"},{"_id":213,"stem":"A couple has come for genetic counseling. The male partner has hemophilia whilst the female partner has been screened and shown to be a carrier. What is the chance of a future child having hemophilia?","opt1":"25% if male child and 0% if female child","opt2":"50%","opt3":"100% if male child and 0% if female child","opt4":"50% if male child and 0% if female child"},{"_id":62,"stem":"A 29-year-old waiter consulted you regarding what he describes as an 'intense fear' before he begins his night shifts. He tells you that it is only a matter of time before he 'makes a real major mistake'. What is the most likely diagnosis?","opt1":"A specific phobia","opt2":"A social phobia","opt3":"A mixed phobia","opt4":"Panic disorder with agorophobia"},{"_id":9,"stem":"Which of the following is FALSE regarding pyelonephritis in pregnancy?","opt1":"Gentamycin is the drug of choice","opt2":"Abruptio placentae should be ruled out","opt3":"E. coli is a commonly recognized pathogen","opt4":"Treating asymptomatic bacteriuria is important in prevention"},{"_id":244,"stem":"A 74-year-old man presents with a severe throbbing headache on the right side. He has had this headache for almost a week, without any apparent trigger. He denies any neurological symptoms or visual disturbances. Neurological examination is unremarkable. However, the right side of his head is tender but there is no history of trauma. Given the likely diagnosis, what is the most important initial step?","opt1":"Give high dose oral prednisolone","opt2":"Urgent temporal artery biopsy","opt3":"Urgent CT brain","opt4":"Occular pilocarpine and intravenous acetazolamide"},{"_id":35,"stem":"Incidence is calculated by the number of","opt1":"Old cases during the study period","opt2":"New cases at a point in time","opt3":"New cases during the study period","opt4":"Old cases at a point in time"},{"_id":182,"stem":"A 35-year-old female has been on phenytoin since 29 years of age for epilepsy. She did not have any attacks since the commencement of the medication and now she wants to stop the medication due to facial hair growth. The appropriate management option is ","opt1":"It is reasonable to stop it now","opt2":"Stop it after 6 months from now","opt3":"Stop it after completing 10 years","opt4":"Don't stop it"}]