[{"_id":230,"stem":"A 54-year-old male with no previous medical problems is found to be in atrial fibrillation during a consultation for his sprained ankle. He denies any history of syncope or palpitations.\r\n\r\nWhat is the most suitable treatment to offer?","opt1":"No treatment or low dose aspirin","opt2":"Aspirin and dipyridamole","opt3":"Warfarin","opt4":"Dabigatran"},{"_id":16,"stem":"A patient is brought to the emergency room following multiple chest trauma. On examination, his blood pressure was 80\/50 and jugular venous pressure is elevated. Bilateral air entry was symmetrical and heart sounds are muffled.\n\nWhich of the following is the most appropriate diagnosis?","opt1":"Hypovolemic shock","opt2":"Bilateral pneumothoraces","opt3":"Cardiac tamponade","opt4":"Massive haemothorax"},{"_id":288,"stem":"A 24-year-old man who has been discharged following admission for a spontaneous pneumothorax asks for advice about flying. During his stay in the hospital, the pneumothorax was aspirated and a check x-ray revealed no residual air. What is the earliest time he should fly?","opt1":"Immediately","opt2":"24 hours","opt3":"3 days","opt4":"2 weeks"},{"_id":267,"stem":"All of the following dementias can benefit from specific treatments, except:","opt1":"Normal pressure hydrocephalus","opt2":"Oligodendroglial tumor","opt3":"Alzheimer’s disease","opt4":"Creutzfeldt Jakob disease"},{"_id":158,"stem":"A 32-year-old multipara patient at 41 weeks and 2 days of gestation is in labor. The cervix is dilated 2cm and the fetus is in the mid anteroposterior position. The station is 2 with effacement of 50%. What is the next step of management?","opt1":"Oxytocin","opt2":"Rupture of membranes","opt3":"Cervical ripening agents","opt4":"Insert a foley catheter"},{"_id":271,"stem":"A 57-year-old man has hypertension and is on oral antihypertensions. However, he finds it difficult to mobilize as he wakes up from the bed or gets up from a chair. What is the most appropriate investigation for him?","opt1":"ECG","opt2":"CXR","opt3":"Ambulatory BP","opt4":"MRI"},{"_id":57,"stem":"The most common site of perforation during dilatation and curettage (D&C) is","opt1":"Cervix","opt2":"Fundus","opt3":"Posterior wall","opt4":"Lateral wall"},{"_id":226,"stem":"A study is designed to look at the efficacy of a mandible advancement device in reducing snoring. The severity of snoring was assessed in 50 people by their partners using a 10-point scale before and after using the device. What is the most appropriate statistical test to apply to this data?","opt1":"Unpaired students T test","opt2":"Wilcoxon signed rank test","opt3":"Chi-Squared test","opt4":"Mann-Whitney test"},{"_id":174,"stem":"What is the most accurate information to give an HIV-positive pregnant woman about the risk of vertical transmission?","opt1":"Transmission is likely through placenta","opt2":"Transmission is likely through cord blood","opt3":"Transmission is likely through physical contact","opt4":"Transmission is likely through breast feeding"},{"_id":94,"stem":"A 17-year-old patient presents to your clinic. She obtained her 1st dose of varicella vaccine 1 year ago. Which of the following are correct regarding her 2nd dose?","opt1":"Give her second dose now","opt2":"Start a new regime","opt3":"2nd dose is not indicated","opt4":"Give both doses now"}]