[{"_id":115,"stem":"A mother brought her 16-month-old baby to the emergency room complaining of episodes of inconsolable crying for the last 24 hours. During the diaper change, she has also noticed a jelly-like stool 30 minutes ago. What is the most likely diagnosis?","opt1":"Malingering","opt2":"Necrotizing enterocolitis","opt3":"Indigestion","opt4":"Intussuception"},{"_id":284,"stem":"You are caring for a 70-year-old male with widespread metastatic prostate cancer. Surgery, radiation, and hormonal therapy have failed to stop cancer, and the goal of his care is now symptom relief. He is being cared for through a local hospital.\r\n\r\nOver the past few days, he has been experiencing respiratory distress. His oxygen saturation is 94% on room air and his lungs are clear to auscultation. His respiratory rate is 16\/min.\r\n\r\nWhich one of the following would be best at this point?","opt1":"Morphine","opt2":"Oxygen","opt3":"Albuterol","opt4":"Haloperidol"},{"_id":142,"stem":"In Parkinson's Disease, which of the following neurotransmitter is affected?","opt1":"GABA (γ-Aminobutyric acid)","opt2":"Dopamine","opt3":"Acetylcholine","opt4":"Noradrenaline"},{"_id":154,"stem":"How long will the troponin levels last following myocardial infarction in a patient with normal renal functions?","opt1":">72 hours","opt2":"48 hours","opt3":"24 hours","opt4":"12 hours"},{"_id":103,"stem":"The following are true about H. pylori infection EXCEPT","opt1":"Can cause gastric ulcers but not duodenal ulcers","opt2":"Can be eradicated by ampicillin and metronidazole","opt3":"There will be histological improvement after eradication therapy","opt4":"It can split urea"},{"_id":251,"stem":"A 3-year-old boy presents to your walk-in clinic with a 4-day history of fever, decreased appetite, and irritability. His mother adds that he has been pulling his right ear for the last four days. He has normal urine output and energy. He is otherwise healthy.\r\n\r\nVital signs are as follows. \r\nTemperature: 38.4°C\r\nBlood pressure: 90\/50 mmHg\r\nHeart rate: 120 BPM\r\nRespiratory rate: 30 breaths\/minute\r\n\r\nOn examination, you see an energetic boy. Otoscopic examination reveals a red, bulging tympanic membrane on the right side. The opposite ear is normal. Examination of the oropharynx is normal and no lymphadenopathy.\r\n\r\nWhat is your next step in the immediate management of this patient?","opt1":"Reassurance and follow-up with primary care provider in 2 weeks","opt2":"Treat with amoxicillin-clavulanate 80 mg\/kg\/d for 7 days","opt3":"Treat with amoxicillin 40 mg\/kg\/d for 7 days","opt4":"Treat with amoxicillin 80 mg\/kg\/d for 7 days"},{"_id":197,"stem":"A 45-year-old patient has hypertension and dyslipidemia. His last blood pressure recording was 130\/90mmHg. He is not taking medications for either of those conditions. He has a BMI of 31 kg\/m2 and regularly consumes fast food. He lives a very sedentary lifestyle as well. Which of the following are the most important aspects to control to increase his survival?","opt1":"Dyslipidemia, hypertension and obesity","opt2":"Dyslipidemia, sedentary lifestyle and diet","opt3":"Triglycerides, obesity and hypertension","opt4":"HDL, sedentary lifestyle and hypertension"},{"_id":178,"stem":"Which of the following is INCORRECT regarding Perthes disease?","opt1":"Can present as painless limp","opt2":"It is always unilateral","opt3":"Males are more at risk","opt4":"Leads to avascular necrosis of the femoral head"},{"_id":20,"stem":"A 20-year-old man sustained a deep laceration on the anterior aspect of the wrist. Median nerve injury would result in","opt1":"A claw hand","opt2":"A wrist drop","opt3":"A sensory deficit only","opt4":"An inability to oppose the thumb to other fingers"},{"_id":206,"stem":"A patient who was on risperidone for schizophrenia for the last year was brought in with lip-smacking, grimaced face, and rapid hand and foot movements. He does not have a history of preceding fever or headache. Which of the following is the most likely cause?","opt1":"Tardive dyskinesia","opt2":"Neuroleptic malignant syndrome","opt3":"Intracranial hemorrhage","opt4":"Meningitis"}]