[{"_id":122,"stem":"Immune deposits in SLE are","opt1":"Epithelial","opt2":"Subepithelial","opt3":"Endothelial","opt4":"Mesangial"},{"_id":175,"stem":"A 60-year-old female patient presented with dysuria, urgency, and frequency with the passage of a small amount of urine. She has received several courses of antibiotics over the last month without a significant improvement. Complete blood count, urinalysis, and urine culture are normal.\r\n\r\nWhich of the following you should consider the most likely diagnosis?","opt1":"Diabetes mellitus","opt2":"Interstitial cystitis","opt3":"Cervical erosions","opt4":"Candida albicans"},{"_id":227,"stem":"A premature newborn develops tachypnea and tachycardia. On examination, the pulse is bounding in character and there is a machinery murmur in the upper left sternal border. Which of the following is the likely cause?","opt1":"Atrial septal defect","opt2":"Mitral regurgitation","opt3":"Patent ductus arteriosus","opt4":"Ventricular septal defect complicated with heart failure"},{"_id":56,"stem":"S3 occurs in all of the following conditions except","opt1":"Tricuspid regurgitation","opt2":"Young athletes","opt3":"Left ventricular failure","opt4":"Mitral stenosis"},{"_id":270,"stem":"The strongest type of epidemiological study is","opt1":"Timeline","opt2":"Prospective cohort studies","opt3":"Retrospective case control studies","opt4":"Cross sectional studies"},{"_id":159,"stem":"A 56-year-old patient complains of sensory neural hearing loss, vertigo, and tinnitus. Vertigo is sometimes associated with vomiting. Most likely diagnosis is","opt1":"Otosclerosis","opt2":"Otitis media","opt3":"Benign positional vertigo","opt4":"Meniere's disease"},{"_id":289,"stem":"A 24-year-old man has developed a chronic cough and wheeze after starting a new job. His peak flow measurements are significantly reduced whilst at work but are seemed to improve during the weekend. \r\n\r\nWhich one of the following substances is most frequently associated with this variety of asthma?","opt1":"Cadmium","opt2":"Cement dust","opt3":"Diesel fumes","opt4":"Isocyanates"},{"_id":266,"stem":"A 73-year-old male visits you with a tremor. Based on the history and examination, you suspect Parkinson’s disease.\r\n\r\nWhich one of the following would be most helpful for confirming the diagnosis?","opt1":"CT of the brain","opt2":"A positive response to levodopa","opt3":"MRI of the brain","opt4":"Confirming that the tremor occurs with movement"},{"_id":17,"stem":"A 5-month-old baby presented to ER with sudden onset of episodes of inconsolable crying. Each episode lasts 2-3 minutes, 15-20 minutes apart and the child draws up his legs towards the abdomen during an episode. They have become more frequent since the onset and there were few episodes of bilious vomiting. No history of fever.\r\n\r\nThe most likely diagnosis is","opt1":"Infantile colic","opt2":"Mesenteric ischemia","opt3":"Volvulus","opt4":"Intussusception"},{"_id":231,"stem":"\"Little league elbow\" refers to a problem of","opt1":"Medial epicondyle","opt2":"Lateral epicondyle","opt3":"Olecranon","opt4":"Capitellum"}]