[{"_id":98,"stem":"A 55-year-old man presented to the emergency room with central abdominal pain radiating to his back. examination showed localized central abdominal tenderness. Chest X-ray and lumbar X-ray didn't reveal any abnormality. What is the most likely diagnosis?","opt1":"Acute cholecystitis","opt2":"Acute appendicitis","opt3":"Diverticulitis","opt4":"Acute pancreatitis"},{"_id":77,"stem":"Which of the following is incorrect regarding subfertility?","opt1":"Male factor accounts for 24%","opt2":"Normal sperm count is >20,000,000","opt3":"Approximately 27% of the cases are idiopathic","opt4":"High prolactin could be a cause"},{"_id":210,"stem":"The definition of \"attributable risk\" is","opt1":"The difference between incidence risk among exposed group and incidence among none xposed group","opt2":"The percentage decrease in the risk of death or disease from a treatment","opt3":"The ratio between incidence risk between an exposed and non exposed individual","opt4":"The percentage increase in the risk of death or disease from a treatment"},{"_id":139,"stem":"Which of the following medications is a risk factor for C. difficile in a patient who does not have a history of prolonged antibiotic intake?","opt1":"Ferrus sulphate","opt2":"Omeprazole","opt3":"Calcium carbonate","opt4":"Metformin"},{"_id":61,"stem":"A 28-year-old male presented with rectal bleeding during defecation which is associated with pain. He describes it as a small amount of bright red blood. The pain is maximal at defecation which is burning and searing lasting for approximately 30 minutes even after defecation. What is the most likely diagnosis?","opt1":"Adenocarcinoma of rectum","opt2":"Internal haemorrhoides","opt3":"Anal fissure","opt4":"Thrombosed external haemorrhoides"},{"_id":247,"stem":"A 30-year-old white primigravida asks you about the benefits and drawbacks of corticosteroid therapy for premature labor at 30 weeks gestation. Which one of the following statements is most accurate?","opt1":"Therapy will decrease the risk of neonatal necrotizing enterocolitis","opt2":"Weekly corticosteroid injections until 34 weeks gestation is the standard regimen to prevent respiratory distress syndrome","opt3":"Therapy is associated with a higher rate of neonatal intraventricular hemorrhage","opt4":"Therapy is associated with a higher rate of persistent patent ductus arteriosus"},{"_id":181,"stem":"During a blood transfusion, the patient developed a fever and pain at the cannula site. What will you do?","opt1":"Reduce the flow rate and start intravenous antibiotics","opt2":"Reduce the flow rate and start acetamenophen","opt3":"Stop infusion and start crystalloids","opt4":"Stop infusion and start manitol and acetamenophen"},{"_id":36,"stem":"A female patient wears eyeglasses since 10 years of age. She was recently diagnosed with type 2 diabetes mellitus. She should have eye examinations\/screens every","opt1":"6 months","opt2":"12 months","opt3":"2 years","opt4":"5 years"},{"_id":119,"stem":"Chronic alcoholism commonly leads to the deficiency of","opt1":"B1","opt2":"B6","opt3":"B12","opt4":"D"},{"_id":41,"stem":"A 35-year-old patient presents with a history of pain in the sacroiliac joint for a month. He complains of morning stiffness and buttock pain.\n\nWhich of the following is least likely to be identified during the rest of the evaluation of this patient?","opt1":"Negative rheumatoid factor","opt2":"Subcutaneous nodules","opt3":"Uveitis","opt4":"Osteopenia"}]