[{"_id":9,"stem":"Which of the following is FALSE regarding pyelonephritis in pregnancy?","opt1":"Gentamycin is the drug of choice","opt2":"Abruptio placentae should be ruled out","opt3":"E. coli is a commonly recognized pathogen","opt4":"Treating asymptomatic bacteriuria is important in prevention"},{"_id":33,"stem":"The best detector of the progress of labor is","opt1":"Severity of pain","opt2":"Dilation","opt3":"Descent","opt4":"Dilation and descent"},{"_id":40,"stem":"The clinical features of severe preeclampsia include all of the following except","opt1":"Ankle edema","opt2":"Polyuria","opt3":"Exaggerated reflexes","opt4":"Right upper quadrant pain"},{"_id":43,"stem":"A 35-year-old primigravida is coming for her first check-up at 16 weeks of gestation. She has no previous medical history. She expresses her excitement about her pregnancy. Her blood pressure after a rest was 160\/100 mmHg. After one week her blood pressure was 154\/96 mmHg. What is the most likely diagnosis?","opt1":"Pre-eclampsia","opt2":"Chronic hypertension","opt3":"Labile hypertension","opt4":"Transient hypertension"},{"_id":46,"stem":"Postpartum haemorrhage is more commonly associated with","opt1":"Multiple pregnancies","opt2":"Anemia","opt3":"Preterm delivery","opt4":"Antithrombin III deficiency"},{"_id":63,"stem":"Which of the follwing is true regarding Pre-Eclampsia?","opt1":"Commoner in multipara than primigravida","opt2":"Rarely seen in patients with pre-existing diabetes","opt3":"Headache and blurred vision are alarming symptoms","opt4":"Usually progresses very fast to eclampsia"},{"_id":100,"stem":"The most common cause of postpartum hemorrhage is","opt1":"Lacerations","opt2":"Retained placental tissue","opt3":"Uterine atony","opt4":"Uterine inversion"},{"_id":158,"stem":"A 32-year-old multipara patient at 41 weeks and 2 days of gestation is in labor. The cervix is dilated 2cm and the fetus is in the mid anteroposterior position. The station is 2 with effacement of 50%. What is the next step of management?","opt1":"Oxytocin","opt2":"Rupture of membranes","opt3":"Cervical ripening agents","opt4":"Insert a foley catheter"},{"_id":174,"stem":"What is the most accurate information to give an HIV-positive pregnant woman about the risk of vertical transmission?","opt1":"Transmission is likely through placenta","opt2":"Transmission is likely through cord blood","opt3":"Transmission is likely through physical contact","opt4":"Transmission is likely through breast feeding"},{"_id":196,"stem":"Which of the following is a risk factor for puerperal infections?","opt1":"Endometriosis","opt2":"Cervical lacerations","opt3":"Anemia","opt4":"Retained placenta"},{"_id":204,"stem":"Which of the following is the recommended treatment of scabies in pregnant women?","opt1":"Topical Permethrin","opt2":"Oral Ivermectin","opt3":"Oral lindane","opt4":"Oral benzyl benzoate"},{"_id":233,"stem":"A 30-year-old G2P1 at 32 weeks of gestation is complaining of severe itching. No history of fever or vomiting. Although she is icteric, the rest of the examination is unremarkable.\r\n\r\nLaboratory studies reveal a normal complete blood count with normal platelets. The glucose level and serum creatinine levels are also within normal ranges. Transaminase levels are normal with a bilirubin level of 68.4 μmol\/L.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Acute viral hepatitis","opt2":"Intrahepatic cholestasis of pregnancy","opt3":"Acute fatty liver of pregnancy","opt4":"Pruritic urticarial papules and plaques of pregnancy (PUPPP)"},{"_id":234,"stem":"A 19-year-old primigravida at approximately 40 weeks gestation comes to the hospital with abdominal pain. She also has had severe headaches for the last 2 days. She has received no prenatal care. \r\n\r\nExamination reveals that her cervix is 4 cm dilated and 85% effaced at -1 station. Her blood pressure is 164\/111 mm Hg and a urine dipstick shows 3+ protein. She has bilateral ankle edema. \r\n\r\nMoments after blood is drawn and intravenous access is obtained, she develops a generalized tonic-clonic seizure and fetal heart tones drop to 60 beats\/min.\r\n\r\nWhich one of the following is the most appropriate immediate course of action?","opt1":"Attachment of a fetal scalp electrode","opt2":"Fetal bradycardia calls for emergency cesarean section","opt3":"Magnesium sulfate, 4g loading dose intravenously over 20mins, followed by a drip at 2 g\/hr","opt4":"Lorazepam, 2 mg intravenous bolus, repeated in 2 minutes if necessary"},{"_id":247,"stem":"A 30-year-old white primigravida asks you about the benefits and drawbacks of corticosteroid therapy for premature labor at 30 weeks gestation. Which one of the following statements is most accurate?","opt1":"Therapy will decrease the risk of neonatal necrotizing enterocolitis","opt2":"Weekly corticosteroid injections until 34 weeks gestation is the standard regimen to prevent respiratory distress syndrome","opt3":"Therapy is associated with a higher rate of neonatal intraventricular hemorrhage","opt4":"Therapy is associated with a higher rate of persistent patent ductus arteriosus"}]