[{"id":1,"stem":"Known cause(s) of primary amenorrhea is\/are","opt1":"Agenesis of Mullerian system","opt2":"Kallmann syndrome","opt3":"Gonadal agenesis","opt4":"All of the above","disc":"Primary amenorrhea is defined as the absence of menses by 15 years of age. \r\n\r\nThe majority is due to chromosomal abnormalities leading to gonadal dysgenesis. Other causes include,\r\n- Gonadal dysgenesis\r\n- Mullerian agenesis\r\n- Physiological delay\r\n- Polycystic ovarian syndrome\r\n- Isolated GnRH deficiency (when associated with anosmia, it is called Kallmann syndrome)\r\n- Transvaginal septum\r\n- Weight loss\/anorexia\r\n- Hypopituitarism","ref":"UpToDate","tags":"Gynecology","_id":1},{"id":2,"stem":"Anterior uveitis is a common finding in the following conditions EXCEPT","opt1":"Rheumatoid arthritis","opt2":"Sarcoidosis","opt3":"Behcet's disease","opt4":"Reiter's disease","disc":"Uveitis (intraocular inflammation) can result from many conditions. Inflammation of the anterior uveal tract (presence of leukocytes in the anterior chamber) is called anterior uveitis (iritis). Although it can occur as an isolated process, other systemic medical illnesses including infections and inflammation are more common etiologies.\r\n\r\nCauses:\r\n1. Infections - Herpes virus, Cytomegalovirus, Toxoplasmosis, syphilis, tuberculosis, cat-scratch disease, West Nile virus, Ebola virus, Zika virus\r\n2. Systemic inflammatory disease - Spondyloarthritis (ankylosing spondylitis, reactive arthritis), Sarcoidosis, Juvenile idiopathic arthritis, Psoriatic arthritis, Inflammatory bowel disease, Multiple sclerosis, Behcet syndrome, Kawasaki disease, Sjogren's syndrome, SLE, Systemic vasculitis\r\n3. Drugs and hypersensitivity reactions - Rifabutin, Cidofovir, Fluoroquinolones, Bisphosphonates, Cancer immunotherapy.\r\n\r\nAlthough scleritis and episcleritis can occur in approximately 5% of patients with rheumatoid arthritis, uveitis is not a common finding.","ref":"UpToDate","tags":"Medicine, Ophthalmology","_id":2},{"id":3,"stem":"Signs of congestive heart failure in children include all of the following EXCEPT","opt1":"Gallop rhythm","opt2":"Periorbital edema","opt3":"Basal crepitations","opt4":"Hepatomegaly","disc":"Symptoms of heart failure vary with age.\r\n- Infants: tachypnea, diaphoresis, easy fatiguability, irritability, poor feeding, and weight gain\r\n- Young children: GI symptoms (pain, vomiting, nausea), failure to thrive, easy fatiguability, chronic cough and wheezing\r\n- Older children: exercise intolerance, anorexia, abdominal pain, wheezing, dyspnea, edema, palpitations, chest pain, or syncope\r\n\r\nPhysical examination may reveal\r\n- Tachycardia\r\n- Poor perfusion (cold peripheries, low systolic blood pressure)\r\n- S3 gallop rhythm\r\n- Tachypnea, crackles, and wheezing\r\n- Hepatomegaly, splenomegaly\r\n- Raised JVP and peripheral edema","ref":"UpToDate","tags":"Pediatrics, Cardiology","_id":3},{"id":4,"stem":"Which of the following is most commonly seen in patients with acanthosis nigricans?","opt1":"Hodgkin lymphoma","opt2":"Familial acanthosis nigricans","opt3":"Paraneoplastic syndrome with gastric adenocarcinoma","opt4":"Insulin resistance","disc":"Acanthosis nigricans is a benign disease characterized by velvety hyperpigmented plaques on the skin. Insulin resistance plays a key role in the majority of the cases.\r\n\r\nOther causes include:\r\n- Genetic syndromes\r\n- Familial (rare, autosomal dominant condition)\r\n- Malignancy (gastric adenocarcinoma, hepatocellular carcinoma, adenocarcinoma of the lung)\r\n- Drug reactions (glucocorticoids, injected insulin, contraceptives)","ref":"UpToDate","tags":"Medicine, Dermatology, Endocrinology","_id":4},{"id":5,"stem":"Which of the following is NOT a diagnostic feature of depression?","opt1":"Depressed mood","opt2":"Diminished interest in selected activities","opt3":"Over-eating","opt4":"Decreased concentration at work","disc":"DSM-5 criteria for depression include the following. At least 5 symptoms should be there for a period of 2 weeks and at least one of the symptoms should include depressed mood or loss of interest\/pleasure.\r\n\r\n- Depressed mood most of the day, nearly every day.\r\n- Markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day.\r\n- Significant weight loss when not dieting or weight gain, or decrease or increase in appetite nearly every day.\r\n- A slowing down of thought and a reduction of physical movement (observable by others, not merely subjective feelings of restlessness or being slowed down).\r\n- Fatigue or loss of energy nearly every day.\r\n- Feelings of worthlessness or excessive or inappropriate guilt nearly every day.\r\n- Diminished ability to think or concentrate, or indecisiveness, nearly every day.\r\n- Recurrent thoughts of death, recurrent suicidal ideation without a specific plan, or a suicide attempt or a specific plan for committing suicide.","ref":"DSM-5","tags":"Psychiatry, Depression","_id":5},{"id":6,"stem":"A 15-year-old girl who had menarche at the age of 13 years, complains of menstrual pain. She is not sexually active. Her examination & pelvic US were normal. How are you going to manage her?","opt1":"Laparotomy","opt2":"Danazol","opt3":"Cervical dilatation","opt4":"NSAIDs","disc":"Primary dysmenorrhea is crampy abdominal pain during menstruation without a pelvic pathology.\n\nSecondary causes for dysmenorrhea should be excluded using history and examination.\n- Endometriosis\n- Adenomyosis\n- Ovarian cysts\n- Intrauterine\/pelvic adhesions\n- Silent PID\n- Congenital abnormalities (imperforated hymen, cervical stenosis)\n- Other (psychogenic, IBD)\n\nA trial of NSAIDs can be considered in the absence of these features. When contraception is also needed, hormonal contraceptive methods are used (e.g. oral contraceptives).","ref":"UpToDate","tags":"Gynecology, Dysmenorrhea","_id":6},{"id":7,"stem":"A 45-year-old patient presents with dysphagia for both liquids and solids. There is associated frequent regurgitation and chest pain. \n\nWhich of the following has the highest diagnostic value?","opt1":"Barium swallow","opt2":"Oesophageal manometry","opt3":"Upper GI endoscopy","opt4":"Response to a course of PPIs","disc":"In achalasia, there is a progressive degeneration of ganglion cells in the myenteric plexus. It results in the inability of the lower esophageal sphincter to relax. \n\nIt is characterized by dysphagia for solids and liquids. In contrast, obstructive lesions cause dysphagia initially for solids (when the lumen is narrower than 13mm) and then for liquids. There is frequent regurgitation and heartburn with associated chest pain which is resistant to a trial of PPIs.\n\nOesophageal manometry is required to establish the diagnosis. A barium swallow will show a dilated upper esophagus with a bird beak appearance. Upper GI endoscopic findings include retained food particles in the upper esophagus and resistance in the lower esophagus.\n\nPatients with achalasia are at higher risk for developing oesophageal carcinoma.","ref":"UpToDate","tags":"Surgery, Dysphagia","_id":7},{"id":8,"stem":"Regarding the criteria for diagnosing Diabetes Mellitus, the following are true EXCEPT","opt1":"FPG >=7.0 mmol\/L plus 2 hour post 75g glucose >=11.1mmol is diagnostic","opt2":"FPG <=5.5 mmol\/L is normal fasting glucose","opt3":"FPG >=7.0 mmol\/L in an asymptomatic patient warrants another confirmatory test","opt4":"2 hour 75g glucose >=7.6 mmol\/L and <11.1 mmol\/L is impaired glucose tolerance","disc":"ADA criteria for diagnosing diabetes mellitus is:\r\n\r\n- A fasting plasma glucose (FPG) level of 126 mg\/dL (7.0 mmol\/L) or higher, or\r\n\r\n- A 2-hour plasma glucose level of 200 mg\/dL (11.1 mmol\/L) or higher during a 75-g oral glucose tolerance test (OGTT), or\r\n\r\n- A random plasma glucose of 200 mg\/dL (11.1 mmol\/L) or higher in a patient with classic symptoms of hyperglycemia or hyperglycemic crisis, or\r\n\r\n- A hemoglobin A1c (HbA1c) level of 6.5% (48 mmol\/mol) or higher","ref":"Medscape, ADA","tags":"Medicine, Endocrinology","_id":8},{"id":9,"stem":"Which of the following is FALSE regarding pyelonephritis in pregnancy?","opt1":"Gentamycin is the drug of choice","opt2":"Abruptio placentae should be ruled out","opt3":"E. coli is a commonly recognized pathogen","opt4":"Treating asymptomatic bacteriuria is important in prevention","disc":"E. coli is the most common organism responsible for asymptomatic bacteriuria and UTIs in pregnant women. Approximately 30-40% with asymptomatic bacteriuria will develop symptomatic UTIs without treatment.\n\nAcute pyelonephritis presents with flank pain, nausea, vomiting, fever with renal angle tenderness. \n\nIntraamniotic infection and placental abruption are important differential diagnoses to exclude.\n\nFluoroquinolones and aminoglycosides are generally avoided during pregnancy. Empiric antibiotics include \n- Ceftriaxone, ampicillin + gentamycin in mild to moderate pyelonephritis\n- Meropenem in severe cases","ref":"UpToDate","tags":"Obstetrics, Pyelonephritis, Asymptomatic Bacteriuria","_id":9},{"id":10,"stem":"Which of the following is used as an initial management option in cold-induced urticaria without systemic features?","opt1":"Cimetidine","opt2":"Diphenhydramine","opt3":"Methylprednisolone","opt4":"Prednisolone","disc":"Cold urticaria results in wheals and\/or angioedema following exposure to cold conditions.\n\nThe diagnosis is confirmed by cold stimulation test.\n\nNonsedating H1 antihistamines are the drug of choice (loratadine, cetirizine, desloratadine).\n\nCimetidine is a histamine H2 receptor antagonist which inhibits gastric acid production. However, combination therapy with H2 antihistamines in some patients who respond poorly to H1 antihistamines has shown improvement.\n\nResponse to systemic glucocorticoids is variable.","ref":"UpToDate","tags":"Medicine, Dermatology, Urticaria","_id":10}]