[{"_id":78,"stem":"A 50-year-old man complains of a long-standing black spot with approximately 5mm diameter on his thigh, which has recently become darker with a bloody discharge. Which of the following is the most appropriate management option?","opt1":"Incisional biopsy","opt2":"Cryotherapy","opt3":"Radiotherapy","opt4":"Wide local excision"},{"_id":120,"stem":"Which of the following is the treatment for alcohol withdrawal?","opt1":"Phenytoin","opt2":"Diazepam","opt3":"Carbamazepine","opt4":"Ethosuximide"},{"_id":97,"stem":"A 50-year-old male is presented with clinical features of anaemia. Complete blood count showed high Mean Corpuscular Volume (MCV). Lab reports showed low iron levels and high aspartate aminotransferase (AST). The blood picture did not reveal any megaloblasts. Which of the following is the most likely diagnosis?","opt1":"B12 deficiency","opt2":"Folate deficiency","opt3":"Alcoholism","opt4":"Iron deficiency"},{"_id":209,"stem":"A 35-year-old male patient complains of hyperpigmented macules on the chest and arms. They become lighter in color under the sunlight. Considering the most likely diagnosis, which of the following is the appropriate treatment?","opt1":"Topical steroids","opt2":"Sodium selenium","opt3":"Topical antibiotics","opt4":"Oral antibiotics"},{"_id":136,"stem":"The routine dosage of varicella vaccine for adults is","opt1":"Two doses 4 weeks apart","opt2":"Two doses 2 months apart","opt3":"Three doses 3 weeks apart","opt4":"Three doses 6 weeks apart"},{"_id":81,"stem":"Which of the following is not a recognized cause of secondary hyperlipidemia?","opt1":"Hypertension","opt2":"Nephrotic syndrome","opt3":"Hypothyroidism","opt4":"Obesity"},{"_id":5,"stem":"Which of the following is NOT a diagnostic feature of depression?","opt1":"Depressed mood","opt2":"Diminished interest in selected activities","opt3":"Over-eating","opt4":"Decreased concentration at work"},{"_id":39,"stem":"Which of the following features best distinguishes Crohn's disease from ulcerative colitis?","opt1":"Presence of ileal disease","opt2":"History of cigarette smoking","opt3":"Non-caseating granulomas","opt4":"Rectal disease"},{"_id":161,"stem":"A 22-year-old patient presented with a sore throat and fatigue. On examination, there is cervical lymphadenopathy and hepatosplenomegaly. Epstein bar antibody is positive. What is your diagnosis?","opt1":"Streptococcal pharyngitis","opt2":"Infectious mononucleosis","opt3":"Viral upper respiratory tract infection","opt4":"Lymphoma"},{"_id":248,"stem":"A 56-year-old female has been on combined continuous hormone therapy for 6 years. This is associated with a reduced risk for which one of the following?","opt1":"Myocardial infarction","opt2":"Bone fractures","opt3":"Strokes","opt4":"Breast cancer"}]