[{"stem":"Which one of the following is not a risk factor for developing osteoporosis?","opt1":"Smoking","opt2":"Obesity","opt3":"Sedentary lifestyle","opt4":"Premature menopause","disc":"Low body mass (in contrast with obesity) is associated with a higher risk of osteoporosis.\r\n\r\nOther risk factors include:\r\n- Family history\r\n- Female sex\r\n- Increasing age\r\n- Deficient diet\r\n- Sedentary lifestyle\r\n- Smoking\r\n- Premature menopause\r\n- Low body weight\r\n- Caucasians and Asians","ref":"","tags":"Orthopedics","_id":290},{"stem":"A 24-year-old man has developed a chronic cough and wheeze after starting a new job. His peak flow measurements are significantly reduced whilst at work but are seemed to improve during the weekend. \r\n\r\nWhich one of the following substances is most frequently associated with this variety of asthma?","opt1":"Cadmium","opt2":"Cement dust","opt3":"Diesel fumes","opt4":"Isocyanates","disc":"","ref":"","tags":"Respiratory","_id":289},{"stem":"A 24-year-old man who has been discharged following admission for a spontaneous pneumothorax asks for advice about flying. During his stay in the hospital, the pneumothorax was aspirated and a check x-ray revealed no residual air. What is the earliest time he should fly?","opt1":"Immediately","opt2":"24 hours","opt3":"3 days","opt4":"2 weeks","disc":"According to the Civil Aviation Authority (CAA), pneumothorax is an absolute contraindication for air travel. Patients may travel after 2 weeks from successful drainage and if there is no residual air.","ref":"CAA","tags":"Emergency","_id":288},{"stem":"A 25-year-old man presents with pain and swelling in his knees and ankles. On examination, he has a painful, erythematous rash on his legs.\r\n\r\nThe following results are obtained:\r\n- Rheumatoid factor: Negative\r\n- ESR: 94 mm\/H\r\n- Chest Xray hilar lymphadenopathy\r\n\r\nWhat is the most likely outcome?","opt1":"Improvement following a course of prednisolone","opt2":"Scarring and ulceration of skin","opt3":"Spontaneous improvement","opt4":"Progressive arthritis","disc":"This patient has an acute form of sarcoidosis that does not require steroids. The symptoms will resolve spontaneously in the majority of the cases.","ref":"","tags":"Medicine, Rheumatology","_id":287},{"stem":"A 43-year-old male patient presenting with hallucinations and delusions was prescribed chlorpromazine. He woke up early in the morning with acute hyperpyrexia, rigidity, and confusion. Three hours later he became unconscious and did not respond to painful stimuli.\r\n\r\nWhat is the most likely diagnosis?","opt1":"Acute dystonia","opt2":"Serotonin syndrome","opt3":"Tadiv dyskinesia","opt4":"Neuroleptic malignant syndrome","disc":"","ref":"","tags":"Emergency","_id":286},{"stem":"Active immunization is important in the control of each of the following childhood communicable diseases, except","opt1":"Diphtheria","opt2":"Polio","opt3":"Measles","opt4":"Scarlet fever","disc":"","ref":"","tags":"Immunization, Pediatrics","_id":285},{"stem":"You are caring for a 70-year-old male with widespread metastatic prostate cancer. Surgery, radiation, and hormonal therapy have failed to stop cancer, and the goal of his care is now symptom relief. He is being cared for through a local hospital.\r\n\r\nOver the past few days, he has been experiencing respiratory distress. His oxygen saturation is 94% on room air and his lungs are clear to auscultation. His respiratory rate is 16\/min.\r\n\r\nWhich one of the following would be best at this point?","opt1":"Morphine","opt2":"Oxygen","opt3":"Albuterol","opt4":"Haloperidol","disc":"","ref":"","tags":"Medicine, Palliative Care","_id":284},{"stem":"The statistical measure of the degree of relationship between two sets of numbers is","opt1":"The average","opt2":"The standard deviation","opt3":"The normal distribution","opt4":"The correlation coefficient","disc":"","ref":"","tags":"Epidemiology, Statistics","_id":283},{"stem":"A 23-year-old male is brought by his elder brother after he heard his brother saying that he was seeing dark angels trying to fly airplanes to come over and kill him. He has been listening to music and doing his work and studying without ever taking a break. He denied fatigue or hunger, despite not having any sleep or food in the last 24 hours.\r\n\r\nHis past medical history is remarkable for bacterial endocarditis he was treated for 18 months ago. \r\n\r\nOn physical examination his temperature is 37.9°C, BP is 145\/95; HR is 110\/min, and RR is 19\/min. You note flushed skin and dilated pupils.\r\n\r\nWhich of the following is the most likely cause of his condition?","opt1":"Brief psychotic disorder","opt2":"Amphetamine drug abuse","opt3":"Phencyclidine drug abuse","opt4":"Heroin drug abuse","disc":"","ref":"","tags":"Medicine, Emergency","_id":282},{"stem":"A healthy 24-year-old male presents with a sore throat for 2 days. He reports mild congestion and a dry cough. On examination, his temperature is 37.2°C (99.0°F).\r\n\r\nHis pharynx is red without exudates, and there are no anterior cervical nodes. His tympanic membranes are normal, and his chest is clear.\r\n\r\nWhich of the following is your next step?","opt1":"Treat with analgesics and supportive care","opt2":"Treat with azithromycin","opt3":"Perform a throat culture and begin treatment with penicillin","opt4":"Perform a rapid strep test","disc":"","ref":"","tags":"Medicine","_id":281},{"stem":"A 60-year-old female presents to the emergency department complaining of shortness of breath. She arrived from Australia yesterday after a long visit to her daughter’s. She developed swelling of her left leg yesterday evening followed by shortness of breath that began today. Her past medical history is unremarkable. Vital signs are significant for the pulse of 120\/min and a RR of 24\/min.\r\n\r\nPhysical examination is unremarkable except for the swollen and tender left leg. Chest X-ray is normal.\r\n\r\nWhich of the following arterial blood gas test findings would suggest pulmonary embolism?","opt1":"Decreased A-a gradient","opt2":"Decreased PaCO2","opt3":"Increased PaCO2","opt4":"Normal PaO2","disc":"","ref":"","tags":"Emergency","_id":280},{"stem":"Which of the following is contraindicated in an adult patient with Wolff-Parkinson-White Syndrome (WPW)?","opt1":"Cardioversion","opt2":"Procainamide","opt3":"Amiodarone","opt4":"Digoxin","disc":"","ref":"","tags":"Cardiology","_id":279},{"stem":"A 41-year-old woman presents with a six months history of recurrent episodes of abdominal pain, bloating, and abdominal distention. She says her pain is worse after eating and is most often felt on the left side. It improves with the passage of stool although she feels that the bowel evacuation is not complete. She reports alternation between loose and hard stools. She denies fever and weight loss.\r\n\r\nShe notes that in the past she had one episode of traveler’s diarrhea when she visited India at the age of 30. Other than that she did not have gastrointestinal symptoms in the past. \r\n\r\nYour presumptive diagnosis is irritable bowel syndrome (IBS). Diagnosis of IBS can be made based on symptoms alone, in the absence of which one of the following alarm features?","opt1":"Age of onset of symptoms","opt2":"Changing site of abdominal pain","opt3":"Feeling of incomplete bowel evacuation","opt4":"Presence of both diarrhea and constipation","disc":"","ref":"","tags":"Gastroenterology, Medicine","_id":278},{"stem":"Which of the following is the most appropriate initial management of deep vein thrombosis?","opt1":"Give heparin","opt2":"Give warfarin","opt3":"Inferior vena cava filter","opt4":"Pneumatic\/compression stockings","disc":"","ref":"","tags":"Medicine, Emergency","_id":277},{"stem":"A tension pneumothorax is best diagnosed with","opt1":"CT scan","opt2":"Chest Xray","opt3":"Clinical exam","opt4":"None of the above","disc":"","ref":"","tags":"Emergency, Medicine","_id":276},{"stem":"A 40-year-old white male presents to your department with concerns about the darkening of his skin recently. He denies body aches but has been unusually thirsty and urinating more often, including waking up a couple of times at night. His father died of cirrhosis at the age of 50 and his mother died of lung cancer. \r\n\r\nOn physical examination, you note skin hyperpigmentation and an enlarged liver.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Wilson's disease","opt2":"Cushing's syndrome","opt3":"Primary biliary cirrhosis","opt4":"Hemochromatosis","disc":"","ref":"","tags":"Medicine","_id":275},{"stem":"A 42-year-old man presents with fatigue and joint pain. On physical exam, he is found to have dark skin and a palpable liver. His urine analysis shows glucosuria. Which of the following will be most helpful in making the diagnosis?","opt1":"Ferritin level","opt2":"Ceruloplasmin","opt3":"Alpha trypsine","opt4":"Hb electrophoresis","disc":"","ref":"","tags":"Medicine","_id":274},{"stem":"Which of the following conditions that affect humans have an intermediate host?","opt1":"B fragilis","opt2":"S epidermidis","opt3":"Spirochetes","opt4":"Tapeworm","disc":"","ref":"","tags":"Infectious diseases","_id":273},{"stem":"A 42-year-old woman is complaining of recent onset fatigue, sleepiness, dry skin, and constipation. She has gained 4.5 kg during the same period. On examination, her thyroid is firm and twice the normal size.\r\n\r\nWhich one of the following is the most sensitive laboratory test to diagnose this patient's condition?","opt1":"Serum thyroxine (T4)","opt2":"Serum triiodothyroinine (T3)","opt3":"T3 resin uptake","opt4":"Serum TSH","disc":"","ref":"","tags":"Endocrinology","_id":272},{"stem":"A 57-year-old man has hypertension and is on oral antihypertensions. However, he finds it difficult to mobilize as he wakes up from the bed or gets up from a chair. What is the most appropriate investigation for him?","opt1":"ECG","opt2":"CXR","opt3":"Ambulatory BP","opt4":"MRI","disc":"","ref":"","tags":"Medicine","_id":271},{"stem":"The strongest type of epidemiological study is","opt1":"Timeline","opt2":"Prospective cohort studies","opt3":"Retrospective case control studies","opt4":"Cross sectional studies","disc":"A prospective cohort study is a cohort study that follows over time a group of similar individuals (cohorts) who differ with respect to certain factors under study, to determine how these factors affect the rates of a certain outcome. For example, one might follow a cohort of middle-aged truck drivers who vary in terms of smoking habits, to test the hypothesis that the 20-year incidence rate of lung cancer will be highest among heavy smokers, followed by moderate smokers, and then nonsmokers. The prospective study is important for research on the etiology of diseases and disorders. The distinguishing feature of a prospective cohort study is that at the time that the investigators begin enrolling subjects and collecting baseline exposure information, none of the subjects have developed any of the outcomes of interest. \r\n\r\nAfter baseline information is collected, subjects in a prospective cohort study are then followed \"longitudinally,\" i.e. over a period of time, usually for years, to determine if and when they become diseased and whether their exposure status changes outcomes. In this way, investigators can eventually use the data to answer any questions about the associations between \"risk factors\" and disease outcomes. For example, one could identify smokers and non-smokers at baseline and compare their subsequent incidence of developing heart disease. Alternatively, one could group subjects based on their body mass index (BMI) and compare their risk of developing heart disease or cancer. Prospective cohort studies are typically ranked higher in the hierarchy of evidence than retrospective cohort studies and can be more expensive than a case-control study. \r\n\r\nOne of the advantages of prospective cohort studies is they can help determine risk factors for being infected with a new disease because they are a longitudinal observation over time, and the collection of results is at regular time intervals, so recall error is minimized.","ref":"","tags":"Epidemiology, Statistics","_id":270},{"stem":"A 62-year-old man was diagnosed with type 2 Diabetes Mellitus with a BMI of 33 kg\/m2. Lifestyle modifications have failed to control blood.\r\n\r\nHis investigation findings are as follows. \r\nUrea: 3.6mmol\/l\r\nCreatinine: 89mmol\/l\r\n\r\nWhat is the next appropriate management?","opt1":"Sulfonylurea receptor binder","opt2":"Glitazone","opt3":"Biguanide","opt4":"Sulfonylurea","disc":"In an obese patient who has failed to obtain good glycemic control with dietary and lifestyle modifications, the initial treatment of choice is biguanides.","ref":"","tags":"Endocrinology","_id":269},{"stem":"During a basketball match, one of the players suddenly collapsed to the ground with coughing and shortness of breath. Which of the following is the most appropriate next investigation?","opt1":"Ventilation perfussion studies","opt2":"CT Pulmonary Angiogram","opt3":"MRI scan of the chest and abdomen","opt4":"Chest Xray","disc":"","ref":"","tags":"Emergency","_id":268},{"stem":"All of the following dementias can benefit from specific treatments, except:","opt1":"Normal pressure hydrocephalus","opt2":"Oligodendroglial tumor","opt3":"Alzheimer’s disease","opt4":"Creutzfeldt Jakob disease","disc":"","ref":"","tags":"Neurology","_id":267},{"stem":"A 73-year-old male visits you with a tremor. Based on the history and examination, you suspect Parkinson’s disease.\r\n\r\nWhich one of the following would be most helpful for confirming the diagnosis?","opt1":"CT of the brain","opt2":"A positive response to levodopa","opt3":"MRI of the brain","opt4":"Confirming that the tremor occurs with movement","disc":"","ref":"","tags":"Neurology","_id":266},{"stem":"A 7-year-old girl remains hospitalized following surgical removal of a craniopharyngioma. On postoperative day one, she begins to have an increased volume of urine output.\r\n\r\nWhich of the following would you also anticipate if no action is taken?","opt1":"Low urine specific gravity","opt2":"Low urine osmolality","opt3":"Rise in serum sodium","opt4":"All of the above","disc":"","ref":"","tags":"Neurology, Pediatrics, Endocrinology","_id":265},{"stem":"Which of the following is NOT true of Erb’s palsy?","opt1":"The grasp reflex is intact","opt2":"It affects the fourth and fifth cervical spinal nerves","opt3":"The moro, biceps, and radial reflexes are absent on the affected side","opt4":"The affected arm is adducted and internally rotated with the elbow extended, the forearm is in pronation, and the wrist is flexed","disc":"","ref":"","tags":"Pediastrics, Neurology","_id":264},{"stem":"A 6-year-old male is brought to your office with abdominal pain of 6 months duration. He has a history of constipation, with the passage of hard, large-caliber stools approximately once a week. Encopresis also is a problem, with the accidental passage of loose stool.\r\n\r\nHis general examination is negative, but he and his mother refuse to allow a digital rectal examination. He does have a normal anal wink and cremasteric reflex.\r\n\r\nWhich one of the following tests would be most appropriate at this time?","opt1":"CT scan of the abdomen","opt2":"Rectal biopsy","opt3":"A barium enema","opt4":"An plain abdominal film","disc":"","ref":"","tags":"Pediatrics","_id":263},{"stem":"A patients with Alport’s syndrome are likely to","opt1":"Be female","opt2":"Be sterile","opt3":"Be deaf","opt4":"Have normal renal functions","disc":"","ref":"","tags":"Pediatrics, Medicine","_id":262},{"stem":"A 2-year-old boy arrives in a comatose state at the emergency department. The child is unresponsive and has dried vomitus on his shirt and pants. \r\n\r\nThe father indicates that he picked up the child from the grandmother’s house approximately 30 minutes ago. The grandmother said that she had dropped her medications on the floor and it was possible that the child ate some pills. However, the family members are not aware of the medications.\r\n\r\nThe most appropriate first step in the management of this child is","opt1":"Administer syrup of Ipecac","opt2":"Send the father back to the grandmother’s house to find out the names of the medicines","opt3":"Establish a secure airway","opt4":"Pass a large bore gastric tube and lavage the child’s stomach","disc":"The first priority in a comatose, unresponsive, patient with a history of vomiting is the management of Airway, Breathing, and Circulation (ABCs). Therefore, the establishment of a secure airway is the first and most important step for this patient.\r\n\r\nSyrup of ipecac should not be used in comatose patients. Although, gastric lavage is likely to be beneficial since the presentation is within 60 minutes of the possible ingestion, without securing the airway it should not be attempted in order to prevent pulmonary aspiration.","ref":"","tags":"Pediatrics, Emergency Medicine","_id":261},{"stem":"What is the immediate goal in the treatment of a patient with new-onset Insulin-Dependent Diabetes Mellitus (IDDM) and Diabetic Keto-Acidosis (DKA)?","opt1":"Start administration of dextrose intravenously","opt2":"Treat the acidosis with sodium bicarbonate","opt3":"Restore fluid and electrolyte losses and reverse the catabolic state","opt4":"Treat underlying infection which may have precipitated the DKA","disc":"The immediate goal in treating DKA is to restore intravascular volume, paying attention to electrolyte losses associated with DKA, especially potassium and phosphate.","ref":"","tags":"Endocrinology, Emergency Medicine","_id":260},{"stem":"Which of the following is the most common presentation of osteoporosis in a 60-year-old female?","opt1":"Colle's fracture","opt2":"Fracture neck of the femur","opt3":"Femoral shaft fracture","opt4":"Hip fracture","disc":"","ref":"","tags":"Orthopedics","_id":259},{"stem":"Which of the following medications is known to increase the incidence of reflux esophagitis?","opt1":"Thiophylline","opt2":"Amoxicillin","opt3":"Metoclopramide","opt4":"Ranitidine","disc":"","ref":"","tags":"Medicine, Pharmacology","_id":258},{"stem":"A 6 year-old-child child has presented with a urinalysis report with 15 red cells per high power field. He is otherwise well and his physical examination was also normal. Which of the following is the most appropriate next step?","opt1":"Urine cytology","opt2":"Renal biopsy","opt3":"Cystoscopy","opt4":"Repeat urine for RBC and protein","disc":"","ref":"","tags":"Pediatrics","_id":257},{"stem":"A 37-year-old woman has severe pain during menstruation which radiates into the anal region. On bimanual examination, she has a small, retroverted uterus. Few tender nodules can be felt while palpating the uterosacral ligaments.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Adenomyosis","opt2":"Chronic PID","opt3":"Fibroids","opt4":"Endometriosis","disc":"","ref":"","tags":"Gynecology","_id":256},{"stem":"A 6-year-old boy comes to you for a routine checkup. His mother's only concern at the moment is his bedwetting. He wets his bed every night, about 2-3 hours after going to sleep and there have been hardly any days with nighttime dryness. His father has had bedwetting until the age of 9 years which was resolved without any treatment. Restricting fluids after dinner has not helped much.  He has a normal urinalysis report.\r\n\r\nWhich of the following is your next step?","opt1":"Order a urine culture and a cystourethrogram with a voiding phase","opt2":"Counsel the mother that enuresis is a self-limited problem","opt3":"Start desmopressin or practice negative reinforcement techniques","opt4":"Train to use a buzzer alarm conditioning device after counseling","disc":"Primary monosymptomatic enuresis is defined as episodes of urinary incontinence during sleep in children >5 years of age. They should have not had any nighttime dryness and no lower urinary tract symptoms\/voiding symptoms.\r\n\r\nWhile it has a high rate of spontaneous resolution, active intervention might be needed depending on the wishes of the family. It is important to educate and advise about the condition and emphasize that it is not the child's fault.\r\n\r\nIn children who are 5 - 6 years of age, motivational therapy (e.g. start chart) is the first intervention.\r\n\r\nEnuresis alarms (a sensor device connected to undergarments that buzzes or vibrates to moisture) or desmopressin are considered when active intervention is needed. The former is the most effective long-term therapy and has fewer side effects. The latter is more expensive and has a high relapse rate. Desmopressin is considered when patients are poorly compliant to\/failed with the buzzer alarm technique or requesting quick symptomatic relief.","ref":"UpToDate","tags":"Pediatrics, Urology","_id":255},{"stem":"A 62-year-old man is called for a review following a positive faecal occult blood. During counseling for colonoscopy, he inquires about the percentage of patients who will be diagnosed with colon cancer following a positive fecal occult blood test. Which of the following is your answer?","opt1":"0.5 - 2%","opt2":"5 - 15%","opt3":"20 - 30%","opt4":"55 - 75%","disc":"Americans have a lifetime risk of 6-8% for colon cancer. There are approximately 50,000 deaths per year and 95% of these deaths can be prevented by screening for colorectal cancer.\r\n\r\nAlthough colonoscopy is the best method to detect cancer, a fecal occult blood test can detect colon cancer with a positive predictive value of 5-15%. However, there is a 30 - 45% chance of having an adenoma with a positive fecal occult blood test.\r\n\r\nTherefore the best answer is 5 - 15%.","ref":"UpToDate, MTB Step 2 CK","tags":"Medicine, Gastroenterology, Oncology","_id":254},{"stem":"Which one of the following is LEAST associated with Behcet's syndrome?","opt1":"Mouth ulcers","opt2":"Genital ulcers","opt3":"Conjunctivitis","opt4":"Deep vein thrombosis","disc":"","ref":"","tags":"Medicine","_id":253},{"stem":"A 71-year-old man who has recently been diagnosed with macular degeneration asks for advice regarding antioxidant dietary supplements. Which one of the following may contraindicate the prescription of such supplements?","opt1":"Current smoker","opt2":"Hypertension","opt3":"Depression","opt4":"Pernicious anemia","disc":"","ref":"","tags":"Ophthalmology","_id":252},{"stem":"A 3-year-old boy presents to your walk-in clinic with a 4-day history of fever, decreased appetite, and irritability. His mother adds that he has been pulling his right ear for the last four days. He has normal urine output and energy. He is otherwise healthy.\r\n\r\nVital signs are as follows. \r\nTemperature: 38.4°C\r\nBlood pressure: 90\/50 mmHg\r\nHeart rate: 120 BPM\r\nRespiratory rate: 30 breaths\/minute\r\n\r\nOn examination, you see an energetic boy. Otoscopic examination reveals a red, bulging tympanic membrane on the right side. The opposite ear is normal. Examination of the oropharynx is normal and no lymphadenopathy.\r\n\r\nWhat is your next step in the immediate management of this patient?","opt1":"Reassurance and follow-up with primary care provider in 2 weeks","opt2":"Treat with amoxicillin-clavulanate 80 mg\/kg\/d for 7 days","opt3":"Treat with amoxicillin 40 mg\/kg\/d for 7 days","opt4":"Treat with amoxicillin 80 mg\/kg\/d for 7 days","disc":"","ref":"","tags":"Pediatrics","_id":251},{"stem":"Which one of the following is a manifestation of pauciarticular juvenile rheumatoid arthritis?","opt1":"Thrombocytopenia","opt2":"Uveitis","opt3":"Glomerulonephritis","opt4":"Erythema nodosum","disc":"","ref":"","tags":"Pediatrics, Rheumatology","_id":250},{"stem":"A 54-year-old female comes to the rheumatology clinic due to dry eyes and arthralgia. A diagnosis of primary Sjogren's syndrome is suspected. Which one of the following features are LEAST associated with this condition?","opt1":"Renal tubular acidosis","opt2":"Xerostomia","opt3":"Sensory polyneuropathy","opt4":"Dilated cardiomyopathy","disc":"","ref":"","tags":"Rheumatology, Medicine","_id":249},{"stem":"A 56-year-old female has been on combined continuous hormone therapy for 6 years. This is associated with a reduced risk for which one of the following?","opt1":"Myocardial infarction","opt2":"Bone fractures","opt3":"Strokes","opt4":"Breast cancer","disc":"","ref":"","tags":"Gynecology","_id":248},{"stem":"A 30-year-old white primigravida asks you about the benefits and drawbacks of corticosteroid therapy for premature labor at 30 weeks gestation. Which one of the following statements is most accurate?","opt1":"Therapy will decrease the risk of neonatal necrotizing enterocolitis","opt2":"Weekly corticosteroid injections until 34 weeks gestation is the standard regimen to prevent respiratory distress syndrome","opt3":"Therapy is associated with a higher rate of neonatal intraventricular hemorrhage","opt4":"Therapy is associated with a higher rate of persistent patent ductus arteriosus","disc":"","ref":"","tags":"Obstetrics","_id":247},{"stem":"A patient complains of a vaginal discharge with a fishy odor. There are >20% of clue cells on microscopy. Which of the following is FALSE regarding her condition?","opt1":"Due to Gardnerella vaginalis overgrowth","opt2":"Can be treated with metronidazole and clindamycin","opt3":"May see hyphae or spores with KOH","opt4":"Vaginal pH should be higher than 4.5","disc":"","ref":"","tags":"Gynecology","_id":246},{"stem":"A 47-year-old female with rheumatoid arthritis complains of unilateral painful red eye. Visual acuity and fundoscopic examination is normal. What is the most likely diagnosis?","opt1":"Episcleritis","opt2":"Scleritis","opt3":"Glaucoma","opt4":"Anterior uveitis","disc":"","ref":"","tags":"Rheumatology","_id":245},{"stem":"A 74-year-old man presents with a severe throbbing headache on the right side. He has had this headache for almost a week, without any apparent trigger. He denies any neurological symptoms or visual disturbances. Neurological examination is unremarkable. However, the right side of his head is tender but there is no history of trauma. Given the likely diagnosis, what is the most important initial step?","opt1":"Give high dose oral prednisolone","opt2":"Urgent temporal artery biopsy","opt3":"Urgent CT brain","opt4":"Occular pilocarpine and intravenous acetazolamide","disc":"","ref":"","tags":"Medicine","_id":244},{"stem":"A 45-year-old man presents with bitemporal hemianopia and spade-like hands. What is the definitive test to confirm the diagnosis?","opt1":"Early morning growth hormone","opt2":"Insulin tolerance test","opt3":"Oral glucose tolerance test with growth hormone measurements","opt4":"Short ACTH test","disc":"Acromegaly should be suspected in all patients with typical clinical features.\r\n- Enlarged jaw\r\n- Enlarged hands and feet\r\n- Coarse facial features with enlarged nose and frontal bone\r\n- Increasing glove size and rings\r\n\r\nThey can also present with MRI findings of a pituitary macroadenoma as up to 80% of somatotroph adenomas are macroadenomas.\r\n\r\nThe initial step in diagnosis is, measuring serum insulin-like growth factor 1 (IGF-1). A normal IGF-1 level strongly suggests a diagnosis other than acromegaly. Serum GH following oral glucose administration is considered in high or equivocal IGF-1. Inadequate suppression of GH following a glucose load confirms the diagnosis of acromegaly.","ref":"UpToDate","tags":"Medicine, Endocrinology","_id":243},{"stem":"A 55-year-old woman is investigated following an osteoporotic hip fracture. Some of her investigation reports are as follows:\r\n\r\n- TSH: < 0.05 mu\/l\r\n- Free T4: 29 pmol\/l\r\n\r\nWhich one of the following autoantibodies is most likely to be present?","opt1":"Anti-TSH receptor stimulating autoantibodies","opt2":"Anti-thyroglobulin autoantibodies","opt3":"Anti-nuclear antibodies","opt4":"Anti-thyroid peroxidase autoantibodies","disc":"Graves disease is the most common cause of hyperthyroidism. It is an autoimmune disease due to the formation of autoantibodies against TSH receptors (aka thyroid-stimulating immunoglobulins) which stimulate these receptors. It results in enlargement of the gland and increased production, and release of thyroid hormones.\r\n\r\nIn this patient, the chronic hyperthyroidism has probably caused osteoporosis. In hyperthyroidism, there is increased bone resporption and reduced volume of trabeculated bones. Due to increased calcium levels, PTH secretion is also reduced. Resulting decrease in conversion of calcidiol to calcitriol, reduced absorption of calcium and increased urinary excretion of calcium results in osteoporosis and risk of fractures.","ref":"UpToDate","tags":"Endocrinology, Medicine, Orthopedics","_id":242},{"stem":"A 62-year-old man is being treated for suspected infective endocarditis. His blood cultures have revealed Streptococcus bovis. What is the most appropriate investigation considering the results?","opt1":"Bronchoscopy","opt2":"Cystoscopy","opt3":"Gastroscopy","opt4":"Colonoscopy","disc":"Group D streptococci (Streptococcus bovis\/Streptococcus equinus complex) are gram-positive cocci that can cause bacteremia and infective endocarditis in adults. \r\n\r\nInfections with these organisms and their association with colonic neoplasms are well described. They may be isolated in up to 50% of patients with colorectal cancer.\r\n\r\nTherefore, a colonoscopy is essential in excluding a colorectal neoplasm in this patient.","ref":"UpToDate","tags":"Gastroenterology, Medicine, Infectious Diseases","_id":241},{"stem":"A 4-year-old girl presents with a history of limping and restriction of movements in multiple joints for 2 months duration. Her ANA is negative and otherwise normal. What should be her screening schedule for uveitis?","opt1":"Every 3 months","opt2":"Every 6 months","opt3":"Every 9 months","opt4":"No is required as ANA is negative","disc":"","ref":"","tags":"Pediatrics, Rheumatology","_id":240},{"stem":"A 45-year-old female has hypertension which is poorly controlled with 4 antihypertensives. A USS shows a 4cm suprarenal mass. Which of the following is the most suitable antihypertensive until the proper diagnosis is established and treated?","opt1":"Alpha blocker","opt2":"Beta blocker","opt3":"ACE inhibitors","opt4":"Calcium channel blockers","disc":"Pheochromocytoma is symptomatic in approximately 50% of the patients but it may also present as an incidental finding during an ultrasound scan. As seen in this patient, resistant hypertension can be seen in up to half of the patients. The classic triad of symptoms are sweating, tachycardia, and episodic headaches.\r\n\r\nAll patients should undergo resection after the proper diagnosis is established and localized. However, before the surgery, they should be medically prepared. Controlling the blood pressure is crucial to prevent intraoperative complications and agents which may provoke a catecholamine paroxysm should be avoided. (e.g. beta-adrenergic agents without alpha blockage, metoclopramide, glucagon)\r\n\r\nAlpha-adrenergic antagonists (e.g. Phenoxybenzamine) are given 10-14 days prior to surgery to normalize the blood pressure. Longer durations may be required in patients who had resistant hypertension. After establishing alpha blockage, a beta-adrenergic antagonist is started 3-4 days prior to surgery.","ref":"UpToDate","tags":"Medicine, Endocrinology","_id":239},{"stem":"A known patient with diabetes presented with a history of progressive abdominal distention. He lives in a dorm room with a group of immigrants. It is associated with low-grade fever, weight loss, abdominal discomfort, and fatigue.\r\n\r\nOn examination, there is gross ascites and a diagnostic peritoneal lavage showed a low Serum and Ascitic Albumin (SAAG) gradient.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Portal hypertension","opt2":"Congestive Heart Failure","opt3":"Hepatic vein thrombosis","opt4":"TB peritonitis","disc":"In a patient with clinically significant ascites, paracentesis is important to establish an etiology and to exclude spontaneous bacterial peritonitis. The initial tests which should be performed on the ascitic fluid include:\r\n1. Macroscopic appearance\r\n2. SAAG\r\n3. Cell count and differential\r\n4. Protein\r\n\r\nSAAG is Serum-to-ascites albumin gradient determination which is important to identify the etiology.\r\n- SAAG ≥1.1 g\/dL: Cirrhosis, Alcoholic hepatitis, Heart failure, Massive hepatic metastases, Heart failure\/constrictive pericarditis, Budd-Chiari syndrome, Portal vein thrombosis, Idiopathic portal fibrosis\r\n- SAAG <1.1g\/dL: Peritoneal carcinomatosis, Peritoneal tuberculosis, Pancreatitis, Serositis, Nephrotic syndrome\r\n\r\nIn this patient, with the given history of high risk for Tuberculosis, TB peritonitis is the most likely diagnosis. ","ref":"UpToDate","tags":"Medicine, Infectious Disease","_id":238},{"stem":"A 66-year-old female presents with pain at the base of her right thumb. She has no significant past medical history. On examination, there is diffuse tenderness and swelling of her first right carpometacarpal joint.\r\n\r\nWhat is the most likely diagnosis?","opt1":"De Quervain's tenosynovitis","opt2":"Osteoarthritis","opt3":"Gout","opt4":"Rheumatoid arthritis","disc":"The distal interphalangeal joints and the base of the thumb are the most common sites for hand osteoarthritis.","ref":"","tags":"Medicine, Rheumatology","_id":237},{"stem":"Which of the following statements is TRUE regarding psoriatic arthropathy?","opt1":"Skin disease always precedes joint disease","opt2":"Nearly one third of the patients with psoriasis eventually develop arthropathy","opt3":"Arthritis mutilans is the most common subtype","opt4":"The mainstay of management is analgesia, physiotherapy and joint replacement","disc":"Psoriatic arthritis is inflammatory arthritis that occurs in up to 30% of patients with psoriasis. It can be axial or peripheral or both. In most patients, arthritis appears after the onset of the skin disease. However, up to 17% of the patients can have joint disease before the skin disease.\r\n\r\nMales and females are equally affected and nail lesions are seen in up to 90% of the patients.\r\n\r\nArthritis mutilans and distal arthritis are more specific for psoriatic arthritis but they are not commonly seen.","ref":"UpToDate","tags":"Rheumatology, Medicine","_id":236},{"stem":"During a routine visit of a healthy 45-year-old woman, you note approximately 1 cm erosive ulceration on the lower portion of the ectocervix. Which of the following is the most appropriate next step?","opt1":"Punch biopsy of the lesion","opt2":"Viral cultures of the lesion for HSV","opt3":"Pap smear","opt4":"Cold knife conization of the cervix","disc":"In a visible lesion like this, the next most appropriate step is to do a biopsy, even though it can be a herpetic lesion. A pap smear is a screening test and will not be conclusive for a macroscopic lesion in a significant number of cases. Therefore biopsy should be performed regardless of the cytology findings in any abnormal lesion.\r\n\r\nCold knife conization is performed for lesions which are found to be microinvasive during the initial biopsy.","ref":"Medscape","tags":"Gynecology","_id":235},{"stem":"A 19-year-old primigravida at approximately 40 weeks gestation comes to the hospital with abdominal pain. She also has had severe headaches for the last 2 days. She has received no prenatal care. \r\n\r\nExamination reveals that her cervix is 4 cm dilated and 85% effaced at -1 station. Her blood pressure is 164\/111 mm Hg and a urine dipstick shows 3+ protein. She has bilateral ankle edema. \r\n\r\nMoments after blood is drawn and intravenous access is obtained, she develops a generalized tonic-clonic seizure and fetal heart tones drop to 60 beats\/min.\r\n\r\nWhich one of the following is the most appropriate immediate course of action?","opt1":"Attachment of a fetal scalp electrode","opt2":"Fetal bradycardia calls for emergency cesarean section","opt3":"Magnesium sulfate, 4g loading dose intravenously over 20mins, followed by a drip at 2 g\/hr","opt4":"Lorazepam, 2 mg intravenous bolus, repeated in 2 minutes if necessary","disc":"The patient has eclampsia which is an obstetric emergency. When seizures occur, the initial step in the management is to assess the patient according to ABC, to control the convulsion and prevent the recurrence of another seizure. Although the definitive treatment for eclampsia is delivery, the patient should be stabilized in order to proceed.\r\n\r\nMagnesium sulfate is the treatment of choice to control and prevent eclamptic seizures. Lorazepam is usually used in nonpregnant patients to control seizures.\r\n\r\nFetal bradycardia can be observed during a maternal seizure which does not require any emergency intervention unless it resolves within a few minutes. A fetal scalp electrode is helpful to control fetal heart tones, but in this scenario, the priority should be controlling the mothers' seizures.\r\n\r\nIn addition, tocolytic agents such as terbutaline are not useful in acute management.","ref":"UpToDate and Medscape","tags":"Obstetrics","_id":234},{"stem":"A 30-year-old G2P1 at 32 weeks of gestation is complaining of severe itching. No history of fever or vomiting. Although she is icteric, the rest of the examination is unremarkable.\r\n\r\nLaboratory studies reveal a normal complete blood count with normal platelets. The glucose level and serum creatinine levels are also within normal ranges. Transaminase levels are normal with a bilirubin level of 68.4 μmol\/L.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Acute viral hepatitis","opt2":"Intrahepatic cholestasis of pregnancy","opt3":"Acute fatty liver of pregnancy","opt4":"Pruritic urticarial papules and plaques of pregnancy (PUPPP)","disc":"Intrahepatic cholestasis of pregnancy is rare and usually presents in the 3rd trimester. The majority of the patients have pruritus only but they may also present with icterus. There can be a minimal elevation in transaminases and bilirubin can be elevated. (<85umol\/L). Occasionally, triglyceride and cholesterol levels can be elevated. It is important to identify it early as it can be associated with prematurity, fetal respiratory distress (bile acids entering the lungs), and increased perinatal mortality. Bile acid levels >40 umol\/L are associated with adverse fetal outcomes.\r\n\r\nPUPPP also presents with pruritis (more severe) in pregnancy. However, jaundice and liver function abnormalities are absent in PUPPP.","ref":"UpToDate","tags":"Obstetrics","_id":233},{"stem":"Which of the following is NOT true regarding chickenpox?","opt1":"Varicella is highly contagious and the patient should be carefully isolated","opt2":"Varicella has a comparatively shorter incubation period of 5 days","opt3":"Varicella is no longer contagious when all lesions are crusted over","opt4":"Varicella may be lethal in immunocompromised hosts","disc":"The average incubation period of varicella is 14-16 days (ranges from 10-21 days). The infective period is generally from 48 hours before the onset of the rash until the lesions have fully crusted.\r\n\r\nIn immunocompromised patients, it can be fatal and should be treated aggressively.","ref":"UpToDate","tags":"Pediatrics, Medicine, Infectious Diseases","_id":232},{"stem":"\"Little league elbow\" refers to a problem of","opt1":"Medial epicondyle","opt2":"Lateral epicondyle","opt3":"Olecranon","opt4":"Capitellum","disc":"Little leagues elbow is the inflammation\/stress injury (apophysitis) or avulsive fractures of the growth plate of the medial epicondyle of the elbow. It is most commonly seen in baseball pitchers from 9-14 years of age as the growth plate closes beyond this age.","ref":"UpToDate","tags":"Pediatrics","_id":231},{"stem":"A 54-year-old male with no previous medical problems is found to be in atrial fibrillation during a consultation for his sprained ankle. He denies any history of syncope or palpitations.\r\n\r\nWhat is the most suitable treatment to offer?","opt1":"No treatment or low dose aspirin","opt2":"Aspirin and dipyridamole","opt3":"Warfarin","opt4":"Dabigatran","disc":"CHA2DS2-VASc is able to accurately identify all patients who are truly low risk for stroke or thromboembolism from atrial fibrillation. This low-risk patient who gets a score of 0 can be managed without any anticoagulation (preferred) or low-dose aspirin (acceptable).\r\n\r\nC - Congestive heart failure (1)\r\nH - Hypertension (or treated hypertension) (1)\r\nA2 - Age >=75 years (2)\r\nD - Diabetes (2)\r\nS2 - Prior stroke or TIA (1)\r\nV - Vascular diseases (ischemic heart diseases or peripheral arterial disease) (1)\r\nA - Age 75-74 years (1)\r\nS - Female gender (1)","ref":"https:\/\/www.ahajournals.org\/doi\/10.1161\/circulationaha.111.060061","tags":"Cardiology","_id":230},{"stem":"A 25-year-old known substance abuser is brought to the emergency department with a suspected overdose. Which of the following is not considered an antidote?","opt1":"Glucagon","opt2":"Magnesium gluconate","opt3":"N-acetylcysteine","opt4":"Naloxone","disc":"Magnesium gluconate is used to treat low serum magnesium levels which is not an antidote. However, in magnesium sulfate toxicity, calcium gluconate can be used as the antidote.\r\n\r\nGlucagon is used in calcium channel blocker\/beta-blocker overdose whereas N-acetylcysteine is lifesaving in acetaminophen poisoning. Naloxone is used in opioid overdose.","ref":"","tags":"Toxicology, Emergency Medicine","_id":229},{"stem":"A patient presented to the emergency department with palpitations, headache, profuse sweating, and high blood pressure. After a thorough workup, the diagnosis of pheochromocytoma is established, the tumor site is located, and surgical removal of the tumor is planned.\r\n\r\nWhich of the drugs should be avoided in control of blood pressure in this patient?","opt1":"Alpha adrenergic blockers","opt2":"Beta adrenergic blockers","opt3":"ACE inhibitors","opt4":"Diuretrics","disc":"","ref":"","tags":"Endocrinology, Medicine","_id":228},{"stem":"A premature newborn develops tachypnea and tachycardia. On examination, the pulse is bounding in character and there is a machinery murmur in the upper left sternal border. Which of the following is the likely cause?","opt1":"Atrial septal defect","opt2":"Mitral regurgitation","opt3":"Patent ductus arteriosus","opt4":"Ventricular septal defect complicated with heart failure","disc":"","ref":"","tags":"Pediatrics","_id":227},{"stem":"A study is designed to look at the efficacy of a mandible advancement device in reducing snoring. The severity of snoring was assessed in 50 people by their partners using a 10-point scale before and after using the device. What is the most appropriate statistical test to apply to this data?","opt1":"Unpaired students T test","opt2":"Wilcoxon signed rank test","opt3":"Chi-Squared test","opt4":"Mann-Whitney test","disc":"The Wilcoxon-signed rank test is the most appropriate statistical test here as the study is non-parametric, paired, and from the same sample.","ref":"","tags":"Epidemiology, Statistics","_id":226},{"stem":"A 19-year-old man presented with a two-day history of severe headaches. He has a fever of 39.9C and denies fundoscopy examination due to photophobia. A lumbar puncture reveals the following findings.\r\n\r\nAppearance: Cloudy\r\nGlucose: 2.1 mmol\/L\r\nProtein: 70mg\/dL\r\nWhite cells: Polymorphs 30\/microL and no lymphocytes\r\n\r\nThe random blood glucose value is 5.9mmol\/L\r\n\r\nThe most likely diagnosis is","opt1":"Guillain Barre syndrome","opt2":"Viral meningitis","opt3":"Bacterial meningitis","opt4":"Tuberculosis","disc":"Normal CSF values are as follows.\r\n- < 50 mg\/dL of protein\r\n- CSF-to-serum glucose ratio > than 0.6\r\n- < 5 white blood cells\/microL\r\n- Lactate concentration < 3.5 mEq\/L\r\n\r\nIn the setting of unexplained fever and headache, some findings in CSF analysis may strongly suggest bacterial meningitis. A white blood cell count of 1000 to 5000\/microL (range of <100 to >10,000) with a percentage of neutrophils usually greater than 80 percent, protein of >200 mg\/dL, and glucose <40 mg\/dL (with a CSF to serum glucose ratio of ≤0.4) are usual findings in bacterial meningitis. In addition, gram stain and CSF culture will also help to differentiate and identify the organisms.\r\n\r\nIn GBS, the acute phase is characterized by the presence of elevated CSF proteins and normal WBC. This is also referred to as albuminocytologic dissociation. The increase in CSF proteins is thought to be due to inflammation of nerve roots.\r\n\r\nIn typical tuberculous meningitis, there is elevated WBC with predominantly lymphocytes and high proteins. The glucose level is also low. However, after the first 2-3 weeks, the typical CSF picture might change.","ref":"UpToDate and Medscape","tags":"Infectious Diseases, Medicine","_id":225},{"stem":"Which of the following is not a major criterion in Jones's criteria for diagnosis of rheumatic fever?","opt1":"Fever","opt2":"Chorea","opt3":"Carditis","opt4":"Erythema marginatum","disc":"Jones Criteria, 2015 revision: Low-risk populations (United States, Europe, other high-income areas)\r\n\r\nThe major criteria are as follows:\r\n- Carditis (clinical or echocardiographic diagnosis)\r\n- Polyarthritis (not monoarthritis)\r\n- Chorea (rare in adults)\r\n- Erythema marginatum (uncommon; rare in adults)\r\n- Subcutaneous nodules (uncommon; rare in adults)\r\n\r\nThe minor criteria are as follows:\r\n- Polyarthralgia (cannot count arthritis as a major criterion and arthralgia as a minor criterion)\r\n- Fever exceeding 38.5°C\r\n- Elevated ESR (>60 mm\/hr) or CRP level (>3 mg\/L)\r\n- Prolonged PR interval","ref":"Medscape","tags":"Pediatrics, Medicine","_id":224},{"stem":"A mother complains that her 4-year-old daughter's urine smells strange. Her urine dipstick is positive for leukocytes and nitrates but negative for blood. The most likely causative agent is","opt1":"Klebsiella","opt2":"Proteus","opt3":"E. coli","opt4":"Pseudomonas","disc":"This question aims to assess the knowledge of the epidemiology of pediatric urinary tract infections.\r\n\r\nE. coli is the most common organism found in children with urinary tract infections accounting for up to 80% of the cases. In addition, Klebsiella, Proteus, Enterobacter, and Citrobacter can also cause UTIs. Infection with E. coli has a higher risk of renal scarring as well.\r\n\r\nViruses and fungi are uncommon causes of UTIs in children.","ref":"UpToDate","tags":"Pediatrics, Infectious Diseases","_id":223},{"stem":"An 84-year-old female with advanced dementia presented with fever for 3 days. She is confused and disoriented. She has no other symptoms and examination fails to elicit any abnormality. Her preliminary investigations show a WBC count of 21,000\/mL and CRP of 250mg\/L.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Pneumonia","opt2":"Urinary tract infection","opt3":"Meningitis","opt4":"Diverticulitis","disc":"","ref":"","tags":"Medicine, Infectious Diseases","_id":222},{"stem":"A 25-year-old male presented with palpitations for 1 hour. His past medical history is not significant for any major illness. He denies smoking but admits taking excess amounts of coffee during the day.\r\n\r\nHis vitals are within normal limits except for tachycardia of 160\/min. Initial EKG showed an SVT which was subsequently controlled with a carotid massage. A second EKG showed a short PR interval with a wide QRS complex and a delta wave.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Brugada syndrome","opt2":"Mahaim preexcitation syndrome","opt3":"Right bundle branch block","opt4":"Wolff Parkinson White syndrome","disc":"","ref":"","tags":"Cardiology, Medicine","_id":221},{"stem":"A 28-year-old male has come to the emergency department with intermittent cramps in his lower abdomen. He also has had rectal urgency with diarrhea and occasional blood in the stools for the last 3 weeks. His condition has worsened during the last 3 days with vomiting and feeling chilly. He denies any medications during the past year.\r\n\r\nOn examination, pulse rate is 102\/min, blood pressure is 125\/71mmHg, the temperature is 39C, and respiratory rate is 15\/min. The abdomen is distended and tender without any evidence of peritonitis. However, bowel sounds are absent and rectal examination shows blood mixed with mucus.\r\n\r\nAn erect x-ray film of the abdomen shows a very distended transverse colon with gas.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Clostridium difficile colitis","opt2":"Typhoid enteritis","opt3":"Crohn's disease","opt4":"Ulcerative colitis","disc":"","ref":"","tags":"Gastroenterology, Medicine","_id":220},{"stem":"A 65-year-old male presented with a history of painful swelling of the right knee joint. Resting for a week did not seem to improve the symptoms. He denies any history of trauma or other systemic symptoms including fever.\r\n\r\nOn examination, there is a moderate effusion. She has also brought a plain radiograph with her which shows a loss of joint space and a linear calcification in the articular cartilage.\r\n\r\nWhich of the following is the most likely diagnosis?","opt1":"Septic arthritis","opt2":"Pseudogout","opt3":"Rheumatoid arthritis","opt4":"Osteoarthritis","disc":"","ref":"","tags":"Rheumatology, Medicine","_id":219},{"stem":"In a patient who is taking methotrexate for rheumatoid arthritis, which of the following medications should be avoided?","opt1":"Erythromycin","opt2":"Trimethoprim-sulfamethoxazole","opt3":"Lanzoprazole","opt4":"Sumatriptan","disc":"Both Methotrexate and Trimethoprim-sulfamethoxazole (TMP-SMX) are inhibitors of folate metabolism and can result in bone marrow suppression. TMP-SMX can also reduce the renal excretion of methotrexate causing substantial toxic effects.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3994806\/","tags":"Medicine, Rheumatology","_id":218},{"stem":"A 50-year-old male is referred to the gastroenterology clinic with a 3-month history of epigastric pain and diarrhea. Her GP has started her on lansoprazole 30mg once daily which did not alleviate her symptoms. She has been diagnosed with hyperparathyroidism a few years back. Upper GI endoscopy revealed multiple duodenal ulcers.\r\n\r\nWhat is the most likely diagnosis?","opt1":"Coeliac disease","opt2":"Multiple Endocrine Neoplasia Type 1","opt3":"Crohn's disease","opt4":"Autoimmune polyendocrinopathy disease","disc":"Zollinger Ellison syndrome is characterized by high gastrin secreted by neuroendocrine tumors in the duodenum or pancreas. Patients are commonly diagnosed between the ages of 20 to 50 years and there is a male preponderance.\r\n\r\nGastrinomas can occur sporadically although up to 30% of the cases can be associated with Multiple Endocrine Neoplasia (MEN) Type I.\r\n\r\nAbdominal pain and diarrhea are the most common symptoms. Nearly half of the patients also have heartburn. Weight loss and GI bleeding are other symptoms.\r\n\r\nUp to 90% of the patients with ZES have duodenal ulcers and they are usually <1cm at the presentation. Patients who are resistant to PPI therapy should raise the suspicion of ZES.","ref":"UpToDate","tags":"Gastroenterology","_id":217},{"stem":"A 1-month-old baby was brought by her mother due to excessive crying. The mother further reveals that the baby is on formula milk and after most of the bottle feeds, the child seems to be uncomfortable. On examination child is restless and the abdomen is distended. The rest of the examination is normal. What is the most likely diagnosis?","opt1":"Intussusception","opt2":"Mesenteric ischemia","opt3":"Infantile colic","opt4":"Cows milk intolerance","disc":"","ref":"","tags":"Pediatrics","_id":216},{"stem":"The average weight loss of a patient following a new diet plan is 18 kg. The standard deviation of weight loss is 3kg. Assuming the weight loss is normally distributed, what percentage of patients will lose between 9 and 27 kg?","opt1":"68.3%","opt2":"95%","opt3":"97.4%","opt4":"99.7%","disc":"99.7% of values lie within 3 Standard Deviations (SDs) of the mean in a Gaussian\/normal distribution.\r\n\r\nIn addition,\r\n1SD - 68.3%\r\n2SD - 95.4%","ref":"","tags":"Statistics","_id":215},{"stem":"A 27-year-old woman presents with a symmetrical arthropathy affecting her hands. On examination, she has synovitis of the 2nd and 3rd metacarpophalangeal joints. Which type of HLA allele is most commonly associated with this condition?","opt1":"HLA DR3","opt2":"HLA A3","opt3":"HLA DR4","opt4":"HLA DR2","disc":"","ref":"","tags":"Rheumatology","_id":214},{"stem":"A couple has come for genetic counseling. The male partner has hemophilia whilst the female partner has been screened and shown to be a carrier. What is the chance of a future child having hemophilia?","opt1":"25% if male child and 0% if female child","opt2":"50%","opt3":"100% if male child and 0% if female child","opt4":"50% if male child and 0% if female child","disc":"Both Hemophilia A and B are inherited in an X-linked recessive pattern.\r\n\r\nIn an X-linked recessive pattern, only males are affected. Affected males can have unaffected males and carrier daughters. Therefore, only females can transmit the condition.\r\n\r\nEach male child of a heterozygous female (carrier) has a 50% chance of being affected and each female child has a 50% chance of being a carrier.","ref":"UpToDate","tags":"Genetics","_id":213},{"stem":"A 34-year-old woman is admitted to the Emergency Department following a collapse. The EKG shows a polymorphic ventricular tachycardia. Which one of the following is not associated with an increased risk of developing torsades de pointes?","opt1":"Tricyclic antidepressants","opt2":"Subarachnoid hemorrhage","opt3":"Hypercalcemia","opt4":"Romano-Ward syndrome","disc":"Long QT syndromes are disorders of myocardial repolarization characterized by prolonged QT intervals (normal - 400ms). They predispose to polymorphic ventricular tachycardia and torsades de pointes (a life-threatening arrhythmia: atypical, rapid, and bizarre form of ventricular tachycardia characterized by a continuously changing axis of polymorphic QRS morphologies).\r\n\r\nThe clinical presentation is usually with syncope, palpitations, seizures, and cardiac arrest\/death.\r\n\r\nThey can be either congenital or acquired. Congenital causes may predispose one to have acquired abnormalities in repolarization.\r\n\r\nCongenital causes:\r\n- Jervell and Lange-Nielsen syndrome\r\n- Romano-Ward syndrome\r\n\r\nAcquired causes:\r\n- Metabolic - Hypocalcemia, Hypokalemia, Hypomagnesemia, Starvation\r\n- Bradyarrhythmias - Sinus Nord dysfunction, AV block\r\n- Antiinfective medications - Antimalarials, Azole antifungals, Fluoroquinolones, Antiretrovirals, Macrolides, Metronidazole\r\n- Psychotropic medications - Antipsychotics, Tricyclics, Some SSRIS\r\n- Others - Myocardial ischemia, Intracranial disease, Hypothermia, Toxins (organophosphates)","ref":"UpToDate","tags":"Cardiology","_id":212},{"stem":"Which of the following is NOT a cause for unconjugated hyperbilirubinemia in a neonate?","opt1":"Biliary atresia","opt2":"ABO incompatibility","opt3":"G6PD deficiency","opt4":"Hereditory spherocytosis","disc":"The most common cause of pathological indirect hyperbilirubinemia is due to hemolytic processes. It can result from\r\n- ABO incompatibility\r\n- Inherited cell membrane defects (hereditary spherocytosis and elliptocytosis)\r\n- Erythrocyte enzyme defects (G6PD deficiency)\r\n- Sepsis\r\n\r\nIn contrast, in biliary atresia, there is a congenital narrowing or absence of the bile duct. It also presents shortly after birth with conjugated hyperbilirubinemia.","ref":"UpToDate","tags":"Pediatrics","_id":211},{"stem":"The definition of \"attributable risk\" is","opt1":"The difference between incidence risk among exposed group and incidence among none xposed group","opt2":"The percentage decrease in the risk of death or disease from a treatment","opt3":"The ratio between incidence risk between an exposed and non exposed individual","opt4":"The percentage increase in the risk of death or disease from a treatment","disc":"The attributable risk is the incidence of risk among the exposed group and the incidence among the nonexposed group. The ratio between the two groups is called the relative risk.","ref":"","tags":"Statistics, Epidemiology","_id":210},{"stem":"A 35-year-old male patient complains of hyperpigmented macules on the chest and arms. They become lighter in color under the sunlight. Considering the most likely diagnosis, which of the following is the appropriate treatment?","opt1":"Topical steroids","opt2":"Sodium selenium","opt3":"Topical antibiotics","opt4":"Oral antibiotics","disc":"Tinea Versicolor is a common fungal infection, especially in tropical countries. Adolescents and young adults are the more commonly affected. It is noncontagious.\r\n\r\nClinical findings include hypo\/hyperpigmented and erythematous macules commonly found in the upper trunk and arms.\r\n\r\nA KOH preparation can be used to diagnose TV quickly. An alternative is Wood's lamp examination.\r\n\r\nTreatment includes topical azole antifungals, selenium sulfide, and zinc pyrithione. They are effective and well-tolerated in mild to moderate diseases. In adults with extensive disease, an oral azole antifungal (e.g. fluconazole 300mg once weekly for two weeks) is recommended than a topical agent.","ref":"UpToDate","tags":"Tinea Versicolor, Pityriasis Versicolor, Dermatology","_id":209},{"stem":"Which of the following is correct about hormonal contraception?","opt1":"Decreased breast cancer risk","opt2":"Decreased ovarian cancer risk","opt3":"Contraindicated in diabetic women","opt4":"Increases the risk of ectopic pregnancy","disc":"Oral contraceptive pills (OCP) reduce the risk of ovarian, endometrial cancer, and ectopic pregnancy. They have a slightly higher risk of thromboembolism and can slightly increase the risk of breast cancer.\r\n\r\nIn patients with migraine with aura, hypertension, and smokers who are more than 35 years, the use of OCP is contraindicated.","ref":"MTB Step 2 CK","tags":"Hormonal Contraception, Gynecology","_id":208},{"stem":"In a patient with idiopathic autonomic insufficiency, which of the following is likely to be observed?","opt1":"Orthostatic hypotension","opt2":"Horners syndrome","opt3":"Anhydrosis","opt4":"Diaphoresis","disc":"Idiopathic autonomic dysfunction can have an acute or subacute onset and can progress over a course of several years. Often it is preceded by an infection.\r\n\r\nClinical features can range from cholinergic\/adrenergic dysfunction to pandysautonomia.\r\n\r\nSympathetic dysfunction: poor pupillary response to light in the darkness, orthostatic hypotension leading to syncope, hypotension without compensatory tachycardia, ejaculation disturbances, and vasomotor instability\r\n\r\nParasympathetic dysfunction: salivation and lacrimation disturbances, absent pupillary constriction to light and near gaze, gastrointestinal tract immobility and impairment of gastrointestinal function, atonic bladder with large residual volume, erectile impotence","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/11732267\/","tags":"Medicine, Neurology","_id":207},{"stem":"A patient who was on risperidone for schizophrenia for the last year was brought in with lip-smacking, grimaced face, and rapid hand and foot movements. He does not have a history of preceding fever or headache. Which of the following is the most likely cause?","opt1":"Tardive dyskinesia","opt2":"Neuroleptic malignant syndrome","opt3":"Intracranial hemorrhage","opt4":"Meningitis","disc":"Tardive Dyskinesia (TD) is a hyperkinetic movement disorder associated with the long-term use of dopamine antagonists. Common agents include first-generation antipsychotics and metoclopramide.\r\n\r\nGenerally, medications ending with -done (risperidone, etc.) have an increased risk of movement disorders and cardiac conduction problems. Among them, risperidone has a greater incidence.\r\n\r\nThe onset of symptoms is usually rare before 6 months of use.\r\n\r\nThe most common symptom is perioral movements and abnormal involuntary movements of the head, limb, and trunk are also seen.\r\n\r\nAvoiding using metoclopramide for more than 12 weeks is important in the prevention and early detection and switching to an atypical antipsychotic such as clozapine is the solution.","ref":"UpToDate and MTB Step 2 CK","tags":"Neurology, Psychiatry, Medicine","_id":206},{"stem":"A professional soccer player came with a history of trauma on the lateral aspect of the left knee. On examination, there is a reduced range of movements and there is a swelling on the medial aspect of the left knee.\r\n\r\nThe most likely diagnosis is","opt1":"Medial collateral ligament injury","opt2":"Lateral collateral ligament injury","opt3":"Medial meniscus tear","opt4":"Lateral meniscus tear","disc":"Medial Collateral Ligament (MCL) injury is the most common athletic knee injury. It usually results in a lateral blow to the knee. It may occur in isolation or together with a meniscal or anterior cruciate ligament injury.\r\n\r\nGrade I - minor and stable\r\nGrade II - partial tear with some degree of instability\r\nGrade III - complete tear with gross instability\r\n\r\nOn examination, there may be swelling, bruising, or deformity. Special tests include anterior and posterior drawer, Lachman, and valgus\/varus stress.\r\n\r\nDiagnosis can be confirmed with MRI.\r\n\r\nFor isolated MCL injury, the management is often conservative. Gross instability and failure of conservative measures warrant reconstructive surgery.","ref":"UpToDate and MTB Step 2 CK","tags":"Orthopedics, Sports","_id":205},{"stem":"Which of the following is the recommended treatment of scabies in pregnant women?","opt1":"Topical Permethrin","opt2":"Oral Ivermectin","opt3":"Oral lindane","opt4":"Oral benzyl benzoate","disc":"Scabies is a very itchy cutaneous infestation by Sarcoptes scabiei (mite). It results in eruptions, excoriations, and erythematous papules in wrists, fingers, axillae, waist, genitalia, etc.\r\n\r\nManagement includes eradication of the mite, symptomatic relief, and contact tracing.\r\n\r\nFor classical scabies, oral ivermectin or topical permethrin is used. Crusted scabies is treated with a combination of both.\r\n\r\nIn children, permethrin is the preferred therapy. Ivermectin can be used in children >15 kg.\r\n\r\nPermethrin is also safe in pregnant women and during breastfeeding as there is only minimal systemic absorption with a quick metabolism. Second-line treatments are topical sulfur and benzyl benzoate.","ref":"UpToDate","tags":"Scabies, Obstetrics, Infestations","_id":204},{"stem":"A 32-year-old female patient developed lower abdominal pain and watery brown vaginal discharge, 1 day following the placement of an Intra-Uterine Device (IUD). The most likely cause for this is","opt1":"Uterine rupture","opt2":"Bacterial vaginosis","opt3":"Pelvic inflammatory disease","opt4":"Trauma during insertion","disc":"Cramping abdominal pain and vaginal bleeding are the most common side effects during the first week of inserting an IUD.\r\n\r\nMost patients have some degree of bleeding or spotting after inserting an IUD and they should be counseled that the bleeding is not usually more than the menstrual bleeding and it may last longer. However, in patients who have significantly more bleeding, care should be taken to exclude partial expulsion, perforation, or lacerations.\r\n\r\nCramping abdominal pains are common in most patients and they may be mild to moderate in intensity.","ref":"UpToDate","tags":"Gynecology","_id":203},{"stem":"A patient was found to be having a Na+ level of 123 mEq\/L and K+ of 3 mEq\/L. Which of the following is the most appropriate correction regime?","opt1":"Normal saline with 20 mEq KCL at 80cc\/hour rate","opt2":"Normal saline with 5 mEq KCL at 20cc\/hour rate","opt3":"Half normal saline with 20 mEq KCL at 80cc\/hour rate","opt4":"Half normal saline with 5mEq KCL at 20cc\/hour rate","disc":"","ref":"","tags":"Intensive Care, Hyponatremia, Hypokalemia","_id":202},{"stem":"Which of the following drug can not be used in acute cholecystitis?","opt1":"Naproxen","opt2":"Morphine","opt3":"Meperidine","opt4":"Acetaminophen","disc":"Morphine may increase the tone of the sphincter of Oddi.","ref":"Medscape","tags":"Surgery, Gastroenterology","_id":201},{"stem":"A child presented with a history of fever for 2 days. On examination, his throat is congested and you notice while and yellowish papules on an erythematous base inside the mouth and on his lips. The rest of the examination is normal.\r\n\r\nThe most likely diagnosis is","opt1":"Coxsackievirus","opt2":"Herpes Simplex Virus","opt3":"Varicella","opt4":"Kawasaki disease","disc":"Hand foot and mouth disease is a common viral infection in children with oral enanthem and a macular, maculopapular, or vesicular rash in hands\/feet. It is more common in children <5-7 years but can occur in all age groups. Coxsackievirus A16 and Enterovirus A71 are common causative organisms.\r\n\r\nThe oral enanthem (rash in mucosal membranes), starts as erythematous macules mostly in the tongue and buccal mucosa. Vesicles appear and they quickly rupture to form an ulcer with a yellowish base and surrounding erythema.\r\n\r\nPrimary HSV 1 oral infection in children usually presents as gingivostomatitis. Fever, pharyngitis, and vesicular lesions develop abruptly. On examination, there is cervical lymphadenopathy.","ref":"UpToDate","tags":"Pediatrics, Infectious Disease","_id":200},{"stem":"In a patient with appendicitis, which of the following is the most helpful finding to make a diagnosis?","opt1":"Age","opt2":"Fever","opt3":"High WBC","opt4":"High Erythrocyte Sedimentation Rate","disc":"In approximately 80% of patients with appendicitis, there is leukocytosis and left shift. The sensitivity and specificity of an elevated white blood cell (WBC) count in acute appendicitis are 80 percent and 55 percent respectively. Therefore, acute appendicitis is less likely when the WBC is normal except for early in the disease.","ref":"UpToDate","tags":"Acute Appendicitis, Surgery","_id":199},{"stem":"Which of the following statements is correct regarding the lower motor type of facial nerve palsy?","opt1":"Almost all cases start to improve in two weeks","opt2":"Treatment includes antibiotics and antiinflammatory medications","opt3":"Steroids are contraindicated","opt4":"Up to 25% of the patients will have permanent disfigurement","disc":"","ref":"","tags":"Neurology, Facial Nerve Palsy, Bells Palsy","_id":198},{"stem":"A 45-year-old patient has hypertension and dyslipidemia. His last blood pressure recording was 130\/90mmHg. He is not taking medications for either of those conditions. He has a BMI of 31 kg\/m2 and regularly consumes fast food. He lives a very sedentary lifestyle as well. Which of the following are the most important aspects to control to increase his survival?","opt1":"Dyslipidemia, hypertension and obesity","opt2":"Dyslipidemia, sedentary lifestyle and diet","opt3":"Triglycerides, obesity and hypertension","opt4":"HDL, sedentary lifestyle and hypertension","disc":"","ref":"","tags":"Medicine, Dyslipidemia, Cardiology, Preventive Medicine","_id":197},{"stem":"Which of the following is a risk factor for puerperal infections?","opt1":"Endometriosis","opt2":"Cervical lacerations","opt3":"Anemia","opt4":"Retained placenta","disc":"","ref":"","tags":"Obstetrics, Puerperal Infections","_id":196},{"stem":"A 29-year-old sexually active female presented with fever and suprapubic pain for 3 days duration. On examination, she has a purulent vaginal discharge and tenderness in bilateral fornices. Urine beta HCG is negative. Which of the following is the most likely diagnosis?","opt1":"Ectopic pregnancy","opt2":"Acute appendicitis","opt3":"Acute salpingitis","opt4":"Chronic salpingitis","disc":"","ref":"","tags":"Gynecology, Pelvic Inflammatory Disease, Salpingitis","_id":195},{"stem":"A 5-year-old child was found to be pale and hemoglobin was 9 g\/dL. A blood picture revealed that he has microcytic hypochromic anemia. However, he did not have any anemic symptoms. What is the best management option?","opt1":"Daily multivitamin with iron","opt2":"Iron therapy and close observation","opt3":"Nutritional advices on high iron intake","opt4":"Serum protein electrophoresis","disc":"","ref":"","tags":"Pediatrics, Hematology","_id":194},{"stem":"Which of the following antiviral medication is a known cause of fever and muscle pains?","opt1":"Acyclovir","opt2":"Oseltamivir","opt3":"Interferon","opt4":"Gancyclovir","disc":"","ref":"","tags":"Infectious Diseases, Pharmacology","_id":193},{"stem":"A 19-year-old athlete has gained 45 pounds in the last 4 months. On examination, he is muscular and his blood pressure is 138\/89mmHg. The most likely cause for his changes is","opt1":"Alcohol consumption","opt2":"Cocaine abuse","opt3":"Anabolic steroids","opt4":"Bulemia nervosa","disc":"","ref":"","tags":"Sports Medicine","_id":192},{"stem":"In a patient with rheumatoid arthritis, which of the following statements is correct?","opt1":"Disease modifying agents are sufficient to preserve joint functions and movements","opt2":"Fish oil gives subjective improvement of joint movements","opt3":"Cold compression and resting will improve the movements","opt4":"Biological agents are essential to prevent erosive disease","disc":"","ref":"","tags":"Rheumatoid Arthritis, Medicine, Rheumatology","_id":191},{"stem":"A 63-year-old man who was previously healthy was brought in after collapsing on the road. He has complained of epigastric discomfort and back pain just before the incident. On examination, pulse rate is 114 BPM and systolic blood pressure was 140\/70mmHg. Which of the following is the most likely diagnosis?","opt1":"Perforated peptic ulcer","opt2":"Leaking aortic aneurysm","opt3":"Acute severe pancreatitis","opt4":"Spontaneous pneuomothorax","disc":"","ref":"","tags":"Surgery, Aortic Aneurysm, Emergency Medicine","_id":190},{"stem":"An 80-year-old male presented with dull aching loin pain and voiding urinary symptoms. BUN and creatinine are elevated. An ultrasound scan revealed bilateral hydronephrosis. What is the most probable diagnosis?","opt1":"Urethral stricture","opt2":"Transitional cell cancer of bladder","opt3":"Prostatomegaly","opt4":"Renal stones","disc":"Prostatic hyperplasia is the most common tumor in men older than 50 years of age. At age 80, the prevalence is approximately 95%.\r\n\r\nClinical manifestations include voiding and storage type lower urinary tract symptoms. In addition, acute or chronic obstructive renal failure can develop. This can be either due to bilateral hydronephrosis as a result of vesicoureteric reflux or detrusor muscle hypertrophy\/scarring leading to vesicoureteric junction obstruction.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3930078\/","tags":"Urology, Prostatomegaly","_id":189},{"stem":"Which of the following is considered a positive PPD test?","opt1":"Erythema more than 5mm in a HIV patient","opt2":"Induration more than 10mm in a diabetic patient","opt3":"Induration more than 5mm in a IV drug abuser","opt4":"Induration more than 10mm in a asian man","disc":"Detecting latent TB can be done with PPD or IGRA (Interferon-gamma release assay). Patients should not be symptomatic or have abnormal chest x-rays when conducting these tests.\r\n\r\nOnly induration is considered in PPD (not erythema).\r\n- >5mm in HIV positive, on glucocorticoids or anti-TNF users, close contacts of active TB, abnormal x-ray findings, and transplant recipients\r\n- >10mm in recent immigrants, prisoners, healthcare workers, close contact with TB, alcoholics, diabetics, and hematological malignancies\r\n- >15mm in those who have no risk factors.\r\n\r\nWhen either the PPD or IGRA is positive, they should undergo a chest x-ray to exclude active disease.","ref":"MTB Step 2 CK","tags":"Tuberculosis, Respiratory Medicine","_id":188},{"stem":"A 60-year-old patient who is on treatment for glaucoma for one week presented with shortness of breath and cough. Which of the following medication can cause these symptoms?","opt1":"Timolol","opt2":"Betaxolol","opt3":"Pilocarpine","opt4":"Acetazolamide","disc":"Timolol, which is a nonselective beta antagonist can cause cough and shortness of breath.\r\n\r\nChronic use of timolol can also cause an interstitial type of lung disease according to the following article.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4501462\/","tags":"Ophthalmology, Glaucoma","_id":187},{"stem":"In a patient who has had rheumatic heart disease with mitral stenosis, the diameter of the valve was found to be less than 1cm. In order to maintain cardiac output, which of the following will be an expected finding?","opt1":"Left atrial hypertrophy and deceased pulmonary pressure","opt2":"Left atrial hypertrophy and dilatation","opt3":"Right ventricular hypertrophy and deceased pulmonary pressure","opt4":"Right ventricular hypertrophy and dilatation","disc":"Many patients with severe mitral stenosis do not notice symptoms due to the slow progression of the disease and reduced physical activity. They can present with exertional dyspnea and reduced exercise tolerance.\r\n\r\nInitially, there will be remodeling of the left ventricle including myocardial hypertrophy and interstitial disease. Pulmonary hypertension will develop over time due to chronic pressure effet.\r\n\r\nThe resulting chronic pulmonary hypertension leads to right atrial hypertrophy and enlargement. It will eventually lead to right-sided heart failure.","ref":"UpToDate","tags":"Rheumatic Heart Disease, Mitral Stenosis","_id":186},{"stem":"A bedbound patient has a bedsore which is extending up to fascia and muscles. It is classified as","opt1":"Grade 1 bedsore","opt2":"Grade 2 bedsore","opt3":"Grade 3 bedsore","opt4":"Grade 4 bedsore","disc":"The Yarkony-Kirk scale classifies pressure sores as follows.\r\n\r\nGrade 1 - A red area as a grade\r\nGrade 2 - Involvement of the epidermis and dermis with no subcutaneous fat observed\r\nGrade 3 - Exposed subcutaneous fat with no muscle observed\r\nGrade 4 - Exposed muscle without bone involvement\r\nGrade 5 - Exposed bone with no joint space involvement\r\nGrade 6 - Joint space involvement","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/2101585\/","tags":"Surgery","_id":185},{"stem":"A child presented with decreased hearing for a 1-year duration. He has been having recurrent upper respiratory tract infections. On examination, there is adenoid hypertrophy and fluid behind the ear drum. In addition to adenoidectomy, which of the following is required?","opt1":"Myringotomy","opt2":"Grommet tube insertion","opt3":"Antibiotics","opt4":"None","disc":"Otitis media with effusion is when there is middle ear fluid without features of inflammation. Up to 40% of the children may have recurrent episodes.\r\n\r\nTreatment aims to prevent recurrence (in this case by doing adenoidectomy) and prevent complications. In this child due to the hearing loss, he is at high risk of developmental problems such as speech, learning, and language. Therefore it warrants a tympanostomy tube insertion (grommet) which will drain the middle ear fluid and effectively resolve the conducting type of hearing loss.","ref":"UpToDate","tags":"ENT, Otitis Media with Effusion","_id":184},{"stem":"A patient complains of seasonal watery nasal discharge, sneezing, and nasal block. What would you prescribe him?","opt1":"Topical steroids","opt2":"Decongestants","opt3":"Antihistamines","opt4":"Systemic steroids","disc":"Allergic rhinitis is a persistent disease in most patients which requires long-term maintenance therapy. One of the most effective maintenance treatments is topical steroids which are particularly effective at releasing nasal congestion (e.g. beclomethasone, flunisolide, budesonide, fluticasone propionate, mometasone furoate, fluticasone furoate, and ciclesonide). They have fever side effects at the recommended dosage. It can be effectively used in both mild\/moderate and severe forms of allergic rhinitis.","ref":"UpToDate","tags":"Allergic Rhinits, ENT, Medicine","_id":183},{"stem":"A 35-year-old female has been on phenytoin since 29 years of age for epilepsy. She did not have any attacks since the commencement of the medication and now she wants to stop the medication due to facial hair growth. The appropriate management option is ","opt1":"It is reasonable to stop it now","opt2":"Stop it after 6 months from now","opt3":"Stop it after completing 10 years","opt4":"Don't stop it","disc":"","ref":"","tags":"Neurology, Epilepsy","_id":182},{"stem":"During a blood transfusion, the patient developed a fever and pain at the cannula site. What will you do?","opt1":"Reduce the flow rate and start intravenous antibiotics","opt2":"Reduce the flow rate and start acetamenophen","opt3":"Stop infusion and start crystalloids","opt4":"Stop infusion and start manitol and acetamenophen","disc":"","ref":"","tags":"Hematology, Blood Transfusion","_id":181},{"stem":"A patient who has undergone a PDD has become positive. However, there are no symptoms and the chest X-ray is normal. What is the appropriate management?","opt1":"Reassure","opt2":"Rifampicin and Isoniazid for 6 months","opt3":"Streptomycin for 7 months","opt4":"Rifampicin for 6 months","disc":"","ref":"","tags":"Respiratory Medicine, Tuberculosis","_id":180},{"stem":"A 5-year-old child complains of a sore throat. The examination didn't reveal any abnormality. What is the best management option?","opt1":"Paracetamol and cefuroxime","opt2":"Paracetamol and co-amoxyclav","opt3":"Paracetamol and azithromycin","opt4":"Paracetamol and pharyngeal swab","disc":"","ref":"","tags":"Infectious Disease, Pharyngitis","_id":179},{"stem":"Which of the following is INCORRECT regarding Perthes disease?","opt1":"Can present as painless limp","opt2":"It is always unilateral","opt3":"Males are more at risk","opt4":"Leads to avascular necrosis of the femoral head","disc":"Legg-Calvé-Perthes (LCP) is characterized by idiopathic avascular necrosis of the hip. Commonly affected children are between 3 and 12 years of age (peak between 5 and 7 years). It may affect both hip joints in 1\/5 of patients. Males are more commonly affected than females.\r\n\r\nAffected children often present with a limp and Trendelenburg gate. Pain can be mild and movements are restricted for internal rotation and abduction. There may be disuse atrophy in the thighs and buttocks.\r\n\r\nDiagnosis requires a high index of suspicion and initial radiographs may be normal.\r\n\r\nManagement includes non-weight-bearing and referral to an experienced orthopedic surgeon. Surgical or splinting is required to maintain the femoral head within the acetabulum.","ref":"UpToDate","tags":"Orthopedics","_id":178},{"stem":"Which of the following is an HMG CoA reductase inhibitor?","opt1":"Statins","opt2":"Fenofibrate","opt3":"Niacin","opt4":"Ezetimibe","disc":"","ref":"","tags":"Medicine, Dyslipidemia","_id":177},{"stem":"Which of the following medication prolong QT interval?","opt1":"Resperidone","opt2":"Clozapine","opt3":"Amisulpride","opt4":"Aripiprazole","disc":"","ref":"","tags":"Cardiology, Psychiatry","_id":176},{"stem":"A 60-year-old female patient presented with dysuria, urgency, and frequency with the passage of a small amount of urine. She has received several courses of antibiotics over the last month without a significant improvement. Complete blood count, urinalysis, and urine culture are normal.\r\n\r\nWhich of the following you should consider the most likely diagnosis?","opt1":"Diabetes mellitus","opt2":"Interstitial cystitis","opt3":"Cervical erosions","opt4":"Candida albicans","disc":"","ref":"","tags":"Urology, Interstitial Cystitis","_id":175},{"stem":"What is the most accurate information to give an HIV-positive pregnant woman about the risk of vertical transmission?","opt1":"Transmission is likely through placenta","opt2":"Transmission is likely through cord blood","opt3":"Transmission is likely through physical contact","opt4":"Transmission is likely through breast feeding","disc":"","ref":"","tags":"Infectious Diseases, Obstetrics","_id":174},{"stem":"In aspirin overdose","opt1":"Liver enzymes will peak within 3 to 4 hours","opt2":"First signs include peripheral neuropathy and loss of reflexes","opt3":"150mg\/kg of aspirin will not result in clinically significant toxicity","opt4":"Gastric lavage is contraindicated","disc":"","ref":"","tags":"Emergency Medicine, Poisoning","_id":173},{"stem":"Characteristic features of miliary TB include","opt1":"Sparing of lung apices","opt2":"Multiple lung nodules","opt3":"Arthritis","opt4":"Respiratory symptoms","disc":"","ref":"","tags":"Respiratory Medicine, Tuberculosis","_id":172},{"stem":"A 46-year-old patient presented with premature ejaculation. He has also complained about decreased libido and erectile dysfunction in recent months. He has been married to his wife for 26 years. He is frail and appears depressed. Due to this issue, he has had numerous arguments with his wife.\r\n\r\nWhich of the following is the most appropriate treatment for him?","opt1":"Testosterone injection every week","opt2":"Sublingual nitroglycerine 6h before intercourse","opt3":"SSRI","opt4":"Explain that it there is no effective treatment for his condition","disc":"","ref":"","tags":"Urology, Erectile Dysfunction","_id":171},{"stem":"A 40-year-old man who is a manual worker presents with a swelling in the groin for 6 months duration. On examination, you find a reducible mass just above the pubic tubercle. After applying pressure on the internal ring, there is no cough impulse.\r\n\r\nWhat is your diagnosis?","opt1":"Direct inguinal hernia","opt2":"Indirect inguinal hernia","opt3":"Femoral hernia","opt4":"Strangulated inguinal hernia","disc":"Indirect inguinal hernia is the most common type in both males and females. Contents herniate through the internal inguinal ring, lateral to the inferior epigastric vessels.\r\n\r\nDirect inguinal hernia protrudes medially to the inferior epigastric vessels.\r\n\r\nFemoral hernia is inferior to the inguinal ligament.","ref":"MTB Step 2 CK","tags":"Surgery, Inguinal Hernia","_id":170},{"stem":"A victim of a road traffic accident came with multiple injuries to the chest, abdomen, and limbs. His blood pressure is 80\/50mmHg. The upper limb has a near-total amputation which bleeds profusely. What is your first step in management?","opt1":"Tourniquet the limb to stop the bleeding","opt2":"Check the airway and breathing rapidly before attending the limb","opt3":"Fast IV boluses","opt4":"Call orthopedics","disc":"","ref":"","tags":"Emergency Medicine, Trauma","_id":169},{"stem":"A 26-year-old political refugee has sought asylum in your country. He complains of poor concentration. He further reveals that his family was murdered in a political coup. He is unable to sleep and feels hopeless about his survival. But he is afraid to go out. What is the most likely diagnosis?","opt1":"Post Traumatic Stress Disorder","opt2":"Acute stress disorder","opt3":"Obscessive compulsive disorder","opt4":"Social phobia","disc":"","ref":"","tags":"Psychiatry, PTSD","_id":168},{"stem":"A 65-year-old man presents with significant weight loss and complains of cough, shortness of breath, and chest pain. He has been taking analgesics for shoulder pain for several months. On examination, he has a constricted pupil and a drooping eyelid on the left side. What is the most likely diagnosis?","opt1":"Thoracic outlet syndrome","opt2":"Cervical rib","opt3":"Pancoast tumour","opt4":"Bronchogenic carcinoma","disc":"Pancoast tumors or superior sulcus tumors initially present as upper limb pain. Pain is mainly due to the involvement of the brachial plexus, pleura, and first and second ribs.\r\n\r\nHorners syndrome refers to ipsilateral ptosis, miosis, enophthalmos, and anhydrosis. It may be present in up to 50% of the patients with Pancoast tumors.\r\n\r\nNeurological deficits in the ipsilateral upper limb may develop gradually in addition to these findings. Supraclavicular lymphadenopathy and significant weight loss are also seen in up to 35% of the patients.\r\n\r\nDue to the anatomical favorability diagnosis can be obtained with a percutaneous needle biopsy. Histology is predominantly nonsmall cell lung cancers.","ref":"UpToDate","tags":"Respiratory Medicine, Neurology","_id":167},{"stem":"A 28-year-old male presented with a 2-hour history of rapid palpitations. He feels light-headed but otherwise okay. On examination, pulse rate is 170 BPM and blood pressure is 100\/68mmHg. He has had 2 similar episodes in the past which have resolved spontaneously.\r\n\r\nWhat is the most likely diagnosis?","opt1":"Supraventricular tachycardia","opt2":"Ventricular tachycardia","opt3":"Atrial fibrillation","opt4":"Ventricular fibrillation","disc":"Supraventricular tachycardia is a dysrhythmia originating at or above the AV node. It is a narrow complex tachycardia. Paroxysmal SVT is characterized by intermittent SVT without any provoking factors which usually results in heart rates ~160 BPM.\r\n\r\nFemales are at a higher risk of developing SVT and it is the most common dysrhythmia in infants and children.\r\n\r\nPatients can present with palpitations, lightheadedness, dyspnea, and chest discomfort. Some may be asymptomatic (detected during screening).\r\n\r\nIt is important to establish whether the patient is hemodynamically stable before deciding on the treatment.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK441972\/","tags":"Cardiology, Arrhythmia","_id":166},{"stem":"Osteomyelitis in children begins in","opt1":"Metaphysis","opt2":"Epiphysis","opt3":"Diaphysis","opt4":"Periosteum","disc":"In children, infection usually starts in metaphyseal sinusoidal veins.","ref":"UpToDate","tags":"Orthopedics, Pediatrics","_id":165},{"stem":"Opioid poisoning is treated with","opt1":"Benzodiazepine","opt2":"Naloxone","opt3":"Beta blockers","opt4":"Diuretics","disc":"An opioid overdose happens when the opioid pathway is excessively stimulated. Death can result in respiratory depression. \r\n\r\nAfter the ABCDE approach, naloxone is used to antagonize opioid receptors. Naloxone has no agnostic activity. The onset of action is within minutes. It can be administered IV, IM, subcutaneous, or through an endotracheal tube.\r\n\r\nTwo newly introduced agents are naltrexone and nalmefene.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK470415\/#:~:text=Opioid%20overdose%20occurs%20when%20a,opioid%20overdose%20is%20rapidly%20increasing.","tags":"Emergency Medicine, Opioid Poisoning","_id":164},{"stem":"Which of the following drugs cause bone marrow suppression?","opt1":"Linezolid","opt2":"Chloramphenicol","opt3":"Indomethacin","opt4":"All of the above","disc":"","ref":"","tags":"Hematology","_id":163},{"stem":"Which of the following is a characteristic pulmonary function test finding in COPD?","opt1":"Reduced FEV1\/FVC ratio","opt2":"Increased Total lung capacity (TLC)","opt3":"Increased FEV1","opt4":"Increased Diffusion capactiy of lung for Carbon Monoxide (DLCO)","disc":"","ref":"","tags":"Respiratory Medicine, COPD","_id":162},{"stem":"A 22-year-old patient presented with a sore throat and fatigue. On examination, there is cervical lymphadenopathy and hepatosplenomegaly. Epstein bar antibody is positive. What is your diagnosis?","opt1":"Streptococcal pharyngitis","opt2":"Infectious mononucleosis","opt3":"Viral upper respiratory tract infection","opt4":"Lymphoma","disc":"Clinical manifestations of infectious mononucleosis include sore throat, fever, fatigue, and cervical lymphadenopathy. \r\n\r\nAn important causative agent is Epstein Bar Virus. It's common around the world and 90% of adults become positive for EBV antibodies by the age of 30 years. The most common way of transmission is by kissing. Additional modes include solid organ transplantation and blood transfusions.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4670567\/","tags":"Infectious Diseases, Infectious Mononucleosis, EBV","_id":161},{"stem":"A patient is complaining of red-eye, photophobia, and ciliary injection. The anterior chamber is cloudy. Diagnosis is","opt1":"Corneal ulcer","opt2":"Uveitis","opt3":"Viral conjunctivitis","opt4":"Glaucoma","disc":"","ref":"","tags":"Ophthalmology, Uveitis, Red Eye","_id":160},{"stem":"A 56-year-old patient complains of sensory neural hearing loss, vertigo, and tinnitus. Vertigo is sometimes associated with vomiting. Most likely diagnosis is","opt1":"Otosclerosis","opt2":"Otitis media","opt3":"Benign positional vertigo","opt4":"Meniere's disease","disc":"","ref":"","tags":"ENT, Meniere's Disease","_id":159},{"stem":"A 32-year-old multipara patient at 41 weeks and 2 days of gestation is in labor. The cervix is dilated 2cm and the fetus is in the mid anteroposterior position. The station is 2 with effacement of 50%. What is the next step of management?","opt1":"Oxytocin","opt2":"Rupture of membranes","opt3":"Cervical ripening agents","opt4":"Insert a foley catheter","disc":"","ref":"","tags":"Obstetrics, Delivery, Labor","_id":158},{"stem":"The influenza vaccine is recommended yearly because","opt1":"Development of resistance","opt2":"Due to antigenic drift","opt3":"Due to poor compliance","opt4":"To maintain health care standards","disc":"","ref":"","tags":"Infectious Diseases, Vaccination","_id":157},{"stem":"The most common organism responsible for the common cold in adults is","opt1":"Rhinovirus","opt2":"Coronavirus","opt3":"Respiratory syncytial virus","opt4":"Adenovirus","disc":"Rhinoviruses are responsible for up to 50% of the common cold in adults.","ref":"UpToDate","tags":"Medicine, Respiratory","_id":156},{"stem":"The initial treatment of noninfectious anterior uveitis is","opt1":"Oral steroids","opt2":"Chloramphenicol drops","opt3":"Tetracycline drops","opt4":"Topical prednisolone acetate","disc":"Noninfectious anterior uveitis is initially treated with topical glucocorticoids (e.g. prednisolone acetate). The pain due to ciliary muscle spasms can be treated with dilators such as scopolamine (0.25%) or cyclopentolate (1%).","ref":"UpToDate","tags":"Ophthalmology, Uveitis","_id":155},{"stem":"How long will the troponin levels last following myocardial infarction in a patient with normal renal functions?","opt1":">72 hours","opt2":"48 hours","opt3":"24 hours","opt4":"12 hours","disc":"There is a basal level of troponin level due to normal turnover of cardiac muscle.\r\n\r\nFollowing 2-3 hours after myocardial infarction, there is a rise of troponin above the 99th percentile. It reaches a peak around 12-48 hours. Then it will begin to fall to the normal level during the next 4-10 days.\r\n\r\nThis pattern is important to distinguish from other causes of high troponin.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK507805\/","tags":"Cardiology, Myocardial Infarction","_id":154},{"stem":"A 49-year-old male presented with pain over the left iliac fossa. On examination, there is abdominal rigidity and significant tenderness over the region. The most likely diagnosis is","opt1":"Acute appendicitis","opt2":"Acute diverticulitis","opt3":"Ulcerative colitis","opt4":"Colon cancer","disc":"Acute diverticulitis is inflammation\/infection of a diverticulum. Patients are mostly above 45 years.\r\n\r\nThe most common presentation is abdominal pain. In addition, they may have a low-grade fever, nausea, vomiting, and diarrhea\/constipation.\r\n\r\nIn diverticulitis, usually, the pain is in the lower-left quadrant of the abdomen (involvement of the sigmoid colon). Occasionally, the pain may be on the right side or in the suprapubic region due to the involvement of the caecum.\r\n\r\nApproximately 25% of the patients have complications at presentation. They include\r\n- Bowel obstruction\r\n- Abscess\/fistula\r\n- Colonic perforation and peritonitis\r\n\r\nColonoscopy is not performed during the acute phase due to the risk of perforation. However, it should be performed at least after 6 weeks following the resolution to exclude underlying colorectal cancer.","ref":"UpToDate","tags":"Gastroenterology, Surgery, Diverticulitis","_id":153},{"stem":"A 45-year-old patient is complaining of abdominal pain related to meals that poorly respond to antacids. He has a significant weight loss and early satiety for 6 months. On examination, there is a mass over the epigastrium which is approximately 3cm. The breath test for H. pylori is negative. What is your diagnosis?","opt1":"Complicated gastric ulcer","opt2":"Gastric cancer","opt3":"Lymphoma","opt4":"Missed pyloric stenosis during childhood","disc":"Most patients with gastric cancer present with an incurable disease.\r\n\r\nThe most common symptoms are weight loss and abdominal pain. Dysphagia is a common symptom in patients with more proximal tumors. They may have early satiety due to tumor mass or pyloric obstruction due to a distant mass. Occult GI bleeding can give rise to anemia.\r\n\r\nThe most common physical finding is a palpable epigastric mass which indicates advanced disease.","ref":"UpToDate","tags":"Medicine, Gastric Carcinoma","_id":152},{"stem":"Treatment choice of anxiety disorder is","opt1":"Alprazolam","opt2":"Flufenazine","opt3":"Haloperidol","opt4":"Diazepam","disc":"Benzodiazepines are used for the rapid relief of anxiety (such as alprazolam, clonazepam, or lorazepam).\r\n\r\nUsually, they are started along with SSRI for anxiety and panic disorders and slowly tapered off to prevent abuse.","ref":"MTB Step 2 CK","tags":"Psychiatry, Anxiety","_id":151},{"id":150,"stem":"A child presented complaining of urine odor like burning sugar. What is the most likely diagnosis?","opt1":"Phenylketonuria","opt2":"Maple syrup urine disease","opt3":"Dehydration","opt4":"Excessive sugar intake previous day","disc":"Maple syrup urine disease is also known as branched-chain ketoaciduria. It is caused by BCKDC and is inherited in an autosomal recessive pattern.\r\n\r\nThe severe form presents as ketonuria, irritability, and poor feeding during the first 48 hours of life. \r\n\r\nIntermediate forms manifest as psychomotor delay, poor feeding, and a maple syrup odor in urine, especially during episodes of catabolic stress.","ref":"UpToDate","tags":"Pediatrics, Metabolic Disorders","_id":150},{"id":149,"stem":"Which of the following is an X-linked condition?","opt1":"Tay-Sach's disease","opt2":"Fabry disease","opt3":"Gaucher disease","opt4":"Polycystic kidney disease","disc":"Tay-Sachs disease is an autosomal recessive disease caused by a deficiency of the hexosaminidase enzyme. It results in the accumulation of type 2 gangliosides getting accumulated in the brain. Affected children start missing milestones after 6 months of age and gradual deterioration of motor and intellectual will eventually result in death by the age of 5. A cherry red macular spot is a common finding.\n\nGaucher's disease is the most common lysosomal storage disease which can be treated by enzyme replacement. It is an autosomal recessive disease. Presentation varies with age and usually involves the visceral organs, bones, and bone marrow.\n\nFabry disease (aka Anderson Fabry disease) is a common lysosomal storage disease. It is an X-linked condition. In its severe form, affected males have severe neuropathic pains, telangiectasia, abdominal pain, corneal opacities, proteinuria, polyuria, and heat and cold intolerance.\n\nPolycystic kidney disease has two forms: autosomal dominant and autosomal recessive. ","ref":"MSD Manuals, Medscape and UpToDate","tags":"Genetics, Polycystic Kidney Disease, Lysosomal Storage Disease","_id":149},{"id":148,"stem":"Peripheral neuropathy can occur in all EXCEPT","opt1":"Lead poisoning","opt2":"Diabetes mellitus","opt3":"Gentamycin","opt4":"Isoniazid","disc":"Common causes of polyneuropathy include diabetes, alcohol abuse, and HIV infection. They are also susceptible to a range of toxins, infectious and inflammatory processes, and hereditary conditions.\n\nToxic substances include chemotherapy, alcohol, and heavy metals.\n\nMedications include amiodarone, dapsone, disulfiram, isoniazid, metronidazole, phenytoin, thalidomide and vincristine.\n\n(For a large list of medications, toxins, and systemic conditions, please see UpToDate)","ref":"UpToDate","tags":"Neurology, Medicine, Peripheral Neuropathy","_id":148},{"id":147,"stem":"The drug of choice for treating atrial fibrillation in a patient with congestive heart failure is","opt1":"Sotalol","opt2":"Nifedipine","opt3":"Felcainide","opt4":"Dronedarone","disc":"The initial treatment approach for patients with concomitant AF and HF is rate control. Rhythm control is reserved for patients who have symptomatic AF or worsening HF symptoms despite rate control. Beta-blockers and digoxin are the only rate control agents recommended in patients with heart failure. Nonhydropiridine calcium channel blockers can increase deaths, reinfarctions, and HF.\n\nBoth nifedipine and flecainide are contraindicated in patients with concomitant AF and HF. Studies have also shown that dronedarone can increase mortality in patients with HF who have persistent AF.","ref":"https:\/\/academic.oup.com\/eurheartj\/article\/36\/46\/3250\/2398380","tags":"Medicine, Cardiology, Congestive Cardiac Failure, Heart Failure","_id":147},{"id":146,"stem":"A recognized cause of dystrophic calcification is","opt1":"Renal failure","opt2":"Sarcoidosis","opt3":"Dermatomyositis","opt4":"Hyperthyroidism","disc":"Dystrophic calcification is a soft-tissue calcification that occurs in damaged or necrosed tissue.  Serum calcium and phosphorus levels are normal.\n\nMnemonic: VINDICATE\n- Vascular: venous insufficiency\n- Infection: granulomatous infection, parasitic infection, cysticercosis\n- Neoplasms: osteosarcoma, synovial sarcoma, osteoma, tumor necrosis, sarcoidosis\n- Drugs: vitamin D, milk-alkali syndrome\n- Autoimmune: dermatomyositis, scleroderma, CREST syndrome, SLE\n- Trauma: injection granuloma\n\nIn addition, patients with CKD who are undergoing long-term maintenance dialysis, often have extraskeletal metastatic calcifications.","ref":"Radiopedia and https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3056381\/","tags":"Medicine, Dystrophic Calcification","_id":146},{"id":145,"stem":"Which of the following is NOT a recognized adverse effect of phenytoin?","opt1":"Hirsutism","opt2":"Macrocytic anemia","opt3":"Ataxia","opt4":"Osteoporosis","disc":"Mnemonic: PHENYTOIN\nP - P-450 interactions\nH - Hirsutism\nE - Enlarged gums\nN - Nystagmus\nY - Yellow browning of the skin\nT - Teratogenicity\nO - Osteomalacia\nI - Interference with B12 metabolism\nN - Neuropathy\n\nIn addition, ataxia is also seen up to 40% of patients with epilepsy and chronic exposure to phenytoin.","ref":"https:\/\/doi.org\/10.1016\/j.seizure.2018.01.019","tags":"Neurology, Phenytoin, Epilepsy","_id":145},{"id":144,"stem":"Guttate psoriasis is associated with preceding infection of","opt1":"Staphylococcal","opt2":"Streptococcal","opt3":"Cytomegalo virus","opt4":"HIV","disc":"Guttate psoriasis is more common in young adults. It is a variant of psoriasis, characterized by small erythematous papules and plaques. Trunk and extremities are commonly involved in 2-15mm plaques covered by fine scales.\n\nIn addition to genetic factors, preceding Streptococcal infections have been identified as a contributing factor.\n\nDiagnosis is mainly clinical and a biopsy can be helpful in doubtful cases.\n\nIt may remit spontaneously over a few weeks\/months or progress to chronic plaque psoriasis.\n\nWidespread lesions are treated with narrow-band ultraviolet B phototherapy. Alternatives include topical steroids, vitamin D analogs, and other phototherapy methods.","ref":"UpToDate","tags":"Guttate Psoriasis, Dermatology","_id":144},{"id":143,"stem":"In the presence of an intracranial hemorrhage with high INR, the antidote of warfarin is","opt1":"Protamine","opt2":"Fresh frozen plasma","opt3":"Vitamin K","opt4":"Cryoprecipitate","disc":"Warfarin inhibits the reductase enzyme which makes vitamin K its active form. It results in reduced production of vitamin K-dependent clotting factors (II, VII, IX, X).\n\nIn any bleeding manifestation with high INR, warfarin should be stopped. Prothrombin complex concentrate 50 units\/kg (if not available, FFP 15mL\/kg) and 5-10mg vitamin K should be given. However, vitamin K will require several hours to work.","ref":"Oxford Handbook of Clinical Medicine","tags":"Warfarin","_id":143},{"id":142,"stem":"In Parkinson's Disease, which of the following neurotransmitter is affected?","opt1":"GABA (γ-Aminobutyric acid)","opt2":"Dopamine","opt3":"Acetylcholine","opt4":"Noradrenaline","disc":"There is a depletion of dopamine in the substantia nigra and the nigrostriatal pathway to the caudate and putamen in Parkinson's disease. It results in bradykinesia and other features of the condition.","ref":"UpToDate","tags":"Neurology, Parkinsons Disease","_id":142},{"id":141,"stem":"Which area of the brain is involved in converting words into language?","opt1":"Broca's area","opt2":"Temporal area","opt3":"Wenick's area","opt4":"Frontal area","disc":"Broca's area is responsible for using spoken and written words in spoken and written language.\n\nWernick's area is responsible for assigning meanings to words that we hear.\n\nThe angular gyrus is important in understanding written languages.","ref":"UpToDate","tags":"Neurology, Aphasia","_id":141},{"id":140,"stem":"Which of the following is an expected finding in a patient with prolonged metabolic alkalosis?","opt1":"Acidic urine","opt2":"Alkaline urine","opt3":"Low K+ in urine","opt4":"High Na+ in urine","disc":"Metabolic alkalosis can result in diuretic therapy or rapid gastric emptying due to vomiting. In addition, severe hypokalemia, alkali ingestion, and hyperaldosteronism can also give rise to this condition.\n\nAt the initial stage, urine will contain more bicarbonate ions, and as a result, urine will be alkaline. Later, the bicarbonate excretion seizes and the urine becomes acidic (paradoxical aciduria).","ref":"https:\/\/jasn.asnjournals.org\/content\/11\/2\/369","tags":"Medicine, Metabolic Acidosis","_id":140},{"id":139,"stem":"Which of the following medications is a risk factor for C. difficile in a patient who does not have a history of prolonged antibiotic intake?","opt1":"Ferrus sulphate","opt2":"Omeprazole","opt3":"Calcium carbonate","opt4":"Metformin","disc":"C. difficile has a fecal-oral transmission and is able to release exotoxins which cause diarrhea. It is well known for antibiotic-associated diarrhea and antibiotic use remains a widely recognized and modifiable risk factor.\n\nGastric acid suppression (either with PPIs or H2 antagonists) has been found to be associated with C. difficile infection. \n\nAdditional risk factors include enteral feeding, gastrointestinal surgery, obesity, cancer chemotherapy, hematopoietic stem cell transplantation, and inflammatory bowel disease.","ref":"UpToDate","tags":"Infectious Disease","_id":139},{"id":138,"stem":"The most common complication of diabetes mellitus is","opt1":"Retinopathy","opt2":"Neuropathy","opt3":"Nephropathy","opt4":"Arthropathy","disc":"Microvascular complications are relatively higher than macrovascular complications according to this study.\r\n\r\nAmong the microvascular complications, nephropathy is more prevalent.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3870323","tags":"Medicine, Endocrinology, Diabetes Mellitus","_id":138},{"id":137,"stem":"Which of the following is the most commonly seen infection in a female patient with poorly controlled diabetes mellitus?","opt1":"Candidiasis","opt2":"Bacterial vaginosis","opt3":"Aspergilosis","opt4":"Clamydia trachomatis","disc":"Patients with diabetes are susceptible to fungal infections, commonly caused by Candida.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3354930\/","tags":"Infectious Diseases","_id":137},{"id":136,"stem":"The routine dosage of varicella vaccine for adults is","opt1":"Two doses 4 weeks apart","opt2":"Two doses 2 months apart","opt3":"Three doses 3 weeks apart","opt4":"Three doses 6 weeks apart","disc":"People who are 13 years or older should receive 2 doses (0.5ml each) of single-antigen vaccine, 4 to 8 weeks apart.","ref":"CDC","tags":"Vaccination, Infectious Diseases","_id":136},{"id":135,"stem":"A 25-year-old female patient presented with a history of recurrent headaches. She gets about 2 episodes per week. The pain is mainly in the frontal and occipital regions. Which of the following is the most likely diagnosis?","opt1":"Migraine","opt2":"Tension headache","opt3":"Cluster headache","opt4":"Trigeminal neuralgia","disc":"Tension headache is usually a bilateral \"bandlike\" headache lasting 4-6 hours.\n\nMigraine is usually associated with aura, photophobia\/phonophobia, or related to emotions, food, or menstruation.\n\nCluster headaches are more common in males. Episodic unilateral periorbital pain with associated lacrimation, red-eye, and nasal congestion is also seen.","ref":"MTB Step 2 CK","tags":"Neurology, Headache","_id":135},{"id":134,"stem":"A singer complains of progressive breathy sound and easy fatiguability after performing for 3 months duration. He denies smoking and has no history of prolonged cough or hemoptysis.\n\nThe most likely condition is","opt1":"Laryngeal carcinoma","opt2":"Reinke's edema","opt3":"Vocal cord nodule","opt4":"Lung cancer","disc":"Both Reinke's edema and vocal cord polyp are benign conditions in vocal folds.\n\nIn Reinke's edema, viscous material gets accumulated in vocal folds due to chronic irritation or inflammation caused by smoking. It causes a low-pitched husky voice mostly in middle-aged females. A similar picture is also seen in patients with hypothyroidism.\n\nPolyps and nodules are a result of chronic vocal fold inflammation. Common etiological factors are smoking and reflux. Some polyps can arise due to trauma from repeated coughing and screaming. Nodules are sometimes called \"screamers\" or \"singers\" nodules. They are commonly seen in vocal cord abuse.\n\nLaryngeal cancer is commonly seen in smoking and alcohol abuse. Early stages may be asymptomatic or present with hoarseness of voice.","ref":"UpToDate","tags":"ENT, Vocal Cord Nodule","_id":134},{"id":133,"stem":"In a patient with lower back pain, which of the following is TRUE?","opt1":"Pain of short duration is pathological","opt2":"Pain of long duration is always pathological","opt3":"Duration and location of the pain determines the outcome","opt4":"Duration and location of the pain determines the biological origin","disc":"Your contribution is welcome to develop a proper explanation for this question.","ref":"","tags":"Neurology, Medicine, Back Pain","_id":133},{"id":132,"stem":"A patient complained of itchy, red eyes. No history of mucopurulent discharge. No history of trauma. He works on a construction site. He also complained of an on and off runny nose.\n\nWhich of the following will you choose to relieve eye symptoms?","opt1":"Tobramycin eye drops","opt2":"Acyclovir eye drops","opt3":"Trifluridine eye drops","opt4":"Olopatadine eye drops","disc":"Signs and symptoms of allergic conjunctivitis include itching, redness, watery discharge, and a burning sensation. Many patients have concomitant allergic rhinitis.\n\nTopical therapies include vasoconstrictor-antihistamine combinations (e.g. naphazoline and pheniramine), anti-histamines with mast cell stabilization properties (olopatadine and alcaftadine), NSAIDs (limited evidence), and short courses of steroids.","ref":"UpToDate","tags":"Ophthalmology, Allergic Conjunctivitis","_id":132},{"id":131,"stem":"Which of the following is the antibiotic of choice for uncomplicated cystitis?","opt1":"Ciprofloxacin","opt2":"Nitrofurantoin","opt3":"Augmentin","opt4":"Metronidazole","disc":"Cystitis presents with dysuria and suprapubic pain. They may or may not have a fever.\n\nTreatment begins with nitrofurantoin or fosfomycin. Quinolones are not used routinely to avoid resistance. Cefixime is an alternative. Pentosan relieves bladder pain.","ref":"MTB Step 2 CK","tags":"Medicine, Infectious Disease, Cystitis","_id":131},{"id":130,"stem":"Which of the following is a cause of occult, asymptomatic urinary tract infection?","opt1":"Mycobacterium tuberculosis","opt2":"Mycobacterium hominis","opt3":"Ureaplasma urealyticum","opt4":"Escherichia coli","disc":"","ref":"","tags":"Urology, Medicine, Infectious Disease","_id":130},{"id":129,"stem":"Which of the following is a well-known cause of Waterhouse-Friderichsen syndrome?","opt1":"Pneumococcus","opt2":"Gonorrhea","opt3":"Menigococcus","opt4":"Haemophilus influenzae","disc":"Waterhouse-Friderichsen refers to adrenal hemorrhage associated most commonly with meningococcal septicemia. It is also associated with the rest of the organisms mentioned here. It results in acute adrenal insufficiency.","ref":"UpToDate","tags":"Medicine, Infectious Disease, Meningoccal Infection, Adrenal Insufficiency","_id":129},{"id":128,"stem":"Which of the following feature is seen in tuberculosis arthritis?","opt1":"Progressive monoarthritis","opt2":"Only small joints are involved","opt3":"Mycobacteria are not found in synovial fluid","opt4":"Systemic symptoms occur in a majority of patients","disc":"Tuberculous arthritis commonly involves hip and knee joints. Usually, it's monoarticular. Clinical features include swelling and pain, but other features of acute inflammation are usually absent. Presentation is often late and joint destruction has already started. Systemic symptoms are seen only in 30% of the patients.\n\nDiagnosis is by synovial biopsy. The synovial fluid analysis is usually nonspecific.","ref":"UpToDate","tags":"Infectious Diseases, Extrapulmonary Tuberculosis","_id":128},{"id":127,"stem":"The drug of choice for patients with hypertension and co-existing proteinuria is","opt1":"Beta blockers","opt2":"Calcium channel blockers","opt3":"ACE inhibitors","opt4":"Hydrochlorothiazide","disc":"Proteinuria is an important risk factor for deterioration of renal functions. ACE inhibitors have been shown to reduce proteinuria more effectively compared to other antihypertensive. Its action is independent of the cause of proteinuria due to an unknown mechanism.","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/9010883\/#:~:text=ACE%20inhibitors%20have%20been%20shown,not%20yet%20fully%20elucidated%20mechanism.","tags":"Medicine, Hypertension, ACE Inhibitors","_id":127},{"id":126,"stem":"Wickham striae are found in","opt1":"Pityriasis rosea","opt2":"Lichen planus","opt3":"Psoriasis","opt4":"Acne","disc":"Wickham striae are a characteristic feature of lichen planus. They are white or gray lines or dots seen on top of the rash and oral mucosal lesions.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3179016\/","tags":"Dermatology, Lichen Planus","_id":126},{"id":125,"stem":"Which of the following areas is most commonly affected by acne vulgaris?","opt1":"Upper back","opt2":"Face","opt3":"Chest","opt4":"Abdomen","disc":"","ref":"","tags":"Dermatology, Acne","_id":125},{"id":124,"stem":"Which of the following anti-acne medication can cause hypertriglyceridemia?","opt1":"Doxycycline","opt2":"Minocycline","opt3":"Tretinoin","opt4":"Benzoyl Peroxide","disc":"Important adverse effects of tretinoin include teratogenicity and lipid abnormalities. Common side effects include cheilitis, skin dryness, photosensitivity, and photophobia.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC5958563\/","tags":"Dermatology, Acne Vulgaris","_id":124},{"id":123,"stem":"Which of the following can aggravate acne?","opt1":"Steroids","opt2":"Tretinoins","opt3":"Doxycycline","opt4":"Benzoyl Peroxide","disc":"","ref":"","tags":"Dermatology, Acne","_id":123},{"id":122,"stem":"Immune deposits in SLE are","opt1":"Epithelial","opt2":"Subepithelial","opt3":"Endothelial","opt4":"Mesangial","disc":"","ref":"","tags":"SLE, Medicine, Rheumatology","_id":122},{"id":121,"stem":"Which type of seizures are caused by alcohol withdrawal syndrome?","opt1":"Myoclonus","opt2":"Simple partial","opt3":"Complex partial","opt4":"Generalized","disc":"Withdrawal seizures are generalized tonic-clonic seizures. They occur within 12-48 hours from the last drink.","ref":"UpToDate","tags":"Medicine, Gastroenterology, Alcohol Withdrawal","_id":121},{"id":120,"stem":"Which of the following is the treatment for alcohol withdrawal?","opt1":"Phenytoin","opt2":"Diazepam","opt3":"Carbamazepine","opt4":"Ethosuximide","disc":"Once other comorbid conditions are treated, benzodiazepines are used to control psychomotor agitation and progression to severe disease. Diazepam (Valium), lorazepam (Ativan), and chlordiazepoxide (Librium) are used frequently.","ref":"UpToDate","tags":"Medicine, Gastroenterology, Alcohol Withdrawal","_id":120},{"id":119,"stem":"Chronic alcoholism commonly leads to the deficiency of","opt1":"B1","opt2":"B6","opt3":"B12","opt4":"D","disc":"Even alcohol intake in moderate predisposes a person to B12 and folate deficiency.\r\n\r\nLow plasma levels of active B6 are found in chronic alcohol dependence, obese states, and protein-energy malnutrition. Pregnancy, preeclampsia and eclampsia, and malabsorptive states such as celiac, inflammatory bowel disease, and bariatric surgery.\r\n\r\nB1(thiamin) deficiency can result in poor intake, decreased absorption, increased loss (diarrhea, diuretics, dialysis) or increased consumption (pregnancy, lactation and hyperthyroidism).","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/15138463\/","tags":"Medicine, Gastroenterology","_id":119},{"id":118,"stem":"The 'string' sign is seen in","opt1":"Ulcerative colitis","opt2":"Crohns disease","opt3":"Rectal cancer","opt4":"Intestinal obstruction","disc":"The 'gastrointestinal string sign' or string sign of Kantor is classically seen in reversible severe narrowing of the intestine due to Crohn's disease (spasms).\n\nIt is now used to describe any severe narrowing in conditions such as hypertrophic pyloric stenosis, gastrointestinal tuberculosis, carcinoid tumor, and colon cancer.","ref":"UpToDate","tags":"Gastroenterology, Crohns Disease, Radiology","_id":118},{"id":117,"stem":"In type I diabetes, which of the following cells are seen in the pancreas?","opt1":"White blood cellsq","opt2":"Lymphocytes","opt3":"Eosinophils","opt4":"Macrophages","disc":"","ref":"","tags":"Medicine, Endocrinology, Diabetes Mellitus","_id":117},{"id":116,"stem":"At what percentage of beta cell loss, do the symptoms of type I diabetes mellitus appear?","opt1":"10%","opt2":"30%","opt3":"50%","opt4":"80%","disc":"","ref":"","tags":"Medicine, Endocrinology, Diabetes Mellitus","_id":116},{"id":115,"stem":"A mother brought her 16-month-old baby to the emergency room complaining of episodes of inconsolable crying for the last 24 hours. During the diaper change, she has also noticed a jelly-like stool 30 minutes ago. What is the most likely diagnosis?","opt1":"Malingering","opt2":"Necrotizing enterocolitis","opt3":"Indigestion","opt4":"Intussuception","disc":"Intussusception is classically described as a triad of abdominal pain, palpable sausage-like mass, and passage of currant jelly. But these features are seen in only <15% of the patients. The only presenting symptom may be abdominal pain.","ref":"UpToDate","tags":"Pediatrics, Intussusception","_id":115},{"id":114,"stem":"An 18-month-old child is found to have dental decay in central and lateral incisors in the upper jaw. The most likely cause is","opt1":"Excessive fluoride in drinking water","opt2":"Mild bottle caries","opt3":"Tetracycline exposure","opt4":"Insufficient fluoride intake","disc":"","ref":"","tags":"Dental Caries","_id":114},{"id":113,"stem":"Which of the following is the most accurate test of H. pylori infection?","opt1":"Urea C13 or C14 breath test","opt2":"Stool antigen","opt3":"Serology","opt4":"Endoscopic biopsy","disc":"","ref":"","tags":"Peptic Ulcer Disease, Helicobacter Pylori","_id":113},{"id":112,"stem":"All of the following organisms cause invasive diarrhea EXCEPT","opt1":"Shigella","opt2":"Yersinia","opt3":"Campylobacter","opt4":"Cholera","disc":"Diarrhea is classified into 3 categories.\r\n1. Non-inflammatory\r\n2. Inflammatory\r\n3. Invasive\r\n\r\nFor instance, Vibrio cholera causes non-inflammatory diarrhea by releasing enterotoxins.\r\n\r\nShigella, yersinia, and campylobacter are invasive organisms.","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/18813221\/","tags":"Infective Diarrhea, Blood and Mucus Diarrhea","_id":112},{"id":111,"stem":"A patient presented with progressive jaundice following laparoscopic cholecystectomy. The most appropriate next step is","opt1":"Open bile duct exploration","opt2":"Laparoscopic bile duct exploration","opt3":"ERCP","opt4":"Intravenous cholangiogram","disc":"","ref":"","tags":"Surgery, Cholecystectomy","_id":111},{"id":110,"stem":"Which of the following is NOT a recognized complication of laparoscopic cholecystectomy?","opt1":"Incisional hearnia","opt2":"Persistent pneumoperitonitis","opt3":"Bile leakage","opt4":"Ascites","disc":"","ref":"","tags":"Surgery, Cholecystectomy","_id":110},{"id":109,"stem":"A child presented with a history of restless sleep at night, sleepiness during the daytime, and headache. The most likely diagnosis is","opt1":"Sinopulmonary syndrome","opt2":"Sleep apnea","opt3":"Laryngomalacia","opt4":"Adenoid enlargement","disc":"","ref":"","tags":"Pediatrics, Sleep Apnea","_id":109},{"id":108,"stem":"The following are features of rheumatic fever EXCEPT","opt1":"Involuntary, abnormal movements","opt2":"Subcutaneous nodules","opt3":"Short PR interval on ECG","opt4":"Migratory arthritis","disc":"","ref":"","tags":"Rheumatic Fever, Pediatrics","_id":108},{"id":107,"stem":"Which of the following is TRUE regarding epididymitis?","opt1":"The peak age is between 12 and 18 years","opt2":"US is diagnostic","opt3":"The scortal contents are within normal size","opt4":"Causes pain in the iliac fossa","disc":"","ref":"","tags":"Urology, Epididymitis","_id":107},{"id":106,"stem":"Which of the following is INCORRECT regarding typhoid fever?","opt1":"Fever and red spots appear at the same time","opt2":"Can be completely eradicated even in the presence of gall stones","opt3":"Transmitted by food, milk and water","opt4":"Can be treated with quinolones","disc":"Enteric fever is a febrile illness caused by Salmonella eneterica serotypes. Contaminated food and water are the main sources.\n\nDuring the first week of the illness, a stepwise fever with bacteremia develops. Relative bradycardia and pulse-temperature dissociation can be seen.\n\n'Rose spots' (salmon-colored macules over the trunk and abdomen) develop during the second week with abdominal pain.\n\nThe third week is characterized by complications such as intestinal perforations and peritonitis. Hepatosplenomegaly can be present. Complications can give rise to an altered level of consciousness and death can result from severe sepsis.\n\nIt can be treated with quinolones although resistance is emerging especially in Asian countries.  Most organisms are still sensitive to azithromycin and 3rd generation cephalosporins.","ref":"UpToDate","tags":"Typhoid, Infectious Disease, Gastroenterology","_id":106},{"id":105,"stem":"A 65-year-old female complains of dripping urine from the vagina. She underwent a vaginal hysterectomy 6 weeks ago.\n\nWhich of the following is the most likely diagnosis?","opt1":"Vesicovaginal fistula","opt2":"Urethrovaginal fistula","opt3":"Ureterovaginal fistula","opt4":"Urge incontinence","disc":"Vesicovaginal fistula is reported by 0.1-0.2% of women following vaginal hysterectomy and their main symptom is urine leak from the vagina.","ref":"UpToDate","tags":"Gynecology, Hysterectomy, Fistula","_id":105},{"id":104,"stem":"A 60-year-old patient who is on hormonal replacement therapy (HRT) for post-menopausal symptoms, developed recurrent episodes of vaginal bleeding. Which of the following is the best management option?","opt1":"Papsmear of cervix","opt2":"Stop HRT and proceed with endometrial biopsy","opt3":"Reassure and continue HRT","opt4":"Abdominal USS and diagnostic laparoscopy","disc":"Potential risks of hormone replacement following the menopause include endometrial cancer. Therefore any abnormal bleeding before or after initiating HR, warrants USS to assess endometrial thickness (<4mm) and endometrial sampling.","ref":"Medscape","tags":"Gynecology, Hormonal Replacement Therapy, Endometrial Cancer","_id":104},{"id":103,"stem":"The following are true about H. pylori infection EXCEPT","opt1":"Can cause gastric ulcers but not duodenal ulcers","opt2":"Can be eradicated by ampicillin and metronidazole","opt3":"There will be histological improvement after eradication therapy","opt4":"It can split urea","disc":"The most common cause of peptic ulcer disease (gastric and duodenal) is H. pylori. Duodenal ulcers are more associated with H. pylori compared to gastric ulcers.\n\nTreatment of H. pylori includes a PPI and two antibiotics. Amoxicillin and clarithromycin are preferred. If no response, metronidazole, levofloxacin, or tetracycline can be considered. Bismuth can be added after changing an antibiotic (quadruple therapy).\n\nBreath test or stool antigen should be repeated to confirm eradication.","ref":"MTB Step 2 CK","tags":"Helicobacter Pylori, Peptic Ulcer Disease,","_id":103},{"id":102,"stem":"A patient who is on intravenous antibiotics developed erythema and warmth in the skin over the cannula site. Which of the following is the most likely source of this infection?","opt1":"Contaminated IV fluids","opt2":"During the insertion of the line through the skin","opt3":"Bacteremia from a distant site","opt4":"During changing of IV fluids","disc":"","ref":"","tags":"Cellulitis","_id":102},{"id":101,"stem":"A child has fallen on an outstretched hand and flexed elbow. On examination, there is a swelling around the elbow with an absent radial pulse. Which of the following is the best management option?","opt1":"Closed reduction","opt2":"Closed reduction while monitoring the radial pulse","opt3":"Open reduction with vascular intervention","opt4":"Cuff and collar for 3 weeks","disc":"A child with supracondylar fracture presents with pain, swelling, and restriction of motion around the elbow after falling on an outstretched hand.\n\nIn children with distal vascular compromise, immediate open reduction and vascular repair should be performed.","ref":"UpToDate","tags":"Pediatrics, Orthopedics, Supracondylar Fracture","_id":101},{"id":100,"stem":"The most common cause of postpartum hemorrhage is","opt1":"Lacerations","opt2":"Retained placental tissue","opt3":"Uterine atony","opt4":"Uterine inversion","disc":"The most common reason for postpartum hemorrhage is uterine atony (80% of cases).\n\nOther common reasons for PPH include genital tract injuries, placenta accreta, and coagulopathies.","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/32039467\/","tags":"Obstetrics, Postpartum Hemorrhage","_id":100},{"id":99,"stem":"A 26-year-old patient came to your office with recurrent episodes of binge eating for the last 2 years. After each instance, she vomits to prevent weight gain. She says that she has no control over these episodes and she is depressed because of her inability to control herself. She also admits to taking laxatives and diuretics to lose weight.\n\nOn examination, her blood pressure is 110\/80 mmHg and her pulse is 78\/min. She is not in apparent distress and the rest of her physical examination is normal. \n\nWhat is the most likely diagnosis?","opt1":"Anorexia nervosa","opt2":"Bulimia nervosa","opt3":"Masked depression","opt4":"Generalized anxiety disorder","disc":"Bulimia nervosa is characterized by binge eating and inappropriate compensatory behaviors to stop weight gain. Bodyweight usually remains in the normal range. It is usually associated with other psychiatric disorders such as monopolar depression and anxiety.\n\nIn anorexia nervosa, there is a deliberate restriction of calories. It leads to abnormally low body weight. They have an intense fear of gaining weight and becoming obese.","ref":"UpToDate","tags":"Psychiatry, Eating Disorders","_id":99},{"id":98,"stem":"A 55-year-old man presented to the emergency room with central abdominal pain radiating to his back. examination showed localized central abdominal tenderness. Chest X-ray and lumbar X-ray didn't reveal any abnormality. What is the most likely diagnosis?","opt1":"Acute cholecystitis","opt2":"Acute appendicitis","opt3":"Diverticulitis","opt4":"Acute pancreatitis","disc":"In patients with gall stone-related pancreatitis, the abdominal pain is rapid in onset and localized. In contrast, patients with acute pancreatitis due to alcohol or metabolic causes, present with gradual onset of abdominal pain which is poorly localized. In ~50% of the patients, the pain will radiate to the back. Pain is relieved by sitting up or bending forward.\n\nPhysical examination findings include tachycardia, fever, and hypotension. In severe disease, there will be generalized tenderness over the abdomen. There can be features of peritonitis including ileus and distention.\n\nIn diverticulitis, usually, the pain is in the lower-left quadrant of the abdomen (involvement of the sigmoid colon). Pain may be on the right side or in the suprapubic region due to the involvement of the caecum.","ref":"UpToDate","tags":"Surgery, Acute Pancreatitis","_id":98},{"id":97,"stem":"A 50-year-old male is presented with clinical features of anaemia. Complete blood count showed high Mean Corpuscular Volume (MCV). Lab reports showed low iron levels and high aspartate aminotransferase (AST). The blood picture did not reveal any megaloblasts. Which of the following is the most likely diagnosis?","opt1":"B12 deficiency","opt2":"Folate deficiency","opt3":"Alcoholism","opt4":"Iron deficiency","disc":"Macrocytic anaemia is characterized by high MCV. Reticulocytes are typically low. Common causes include:\r\n- B12 and\/or folate deficiency\r\n- Sideroblastic anaemia\r\n- Alcoholism\r\n- Antimetabolite medications\r\n- Liver disease or hypothyroidism\r\n- Medications (phenytoin)\r\n- Myelodysplastic syndromes\r\n\r\nThe presence of megaloblasts (hypersegmented neutrophils) suggests B12\/folate deficiency or antimetabolite medication such as azathioprine, 6-MP, or hydroxyurea.\r\n\r\nIron deficiency classically causes microcytic anaemia. Therefore the answer is alcoholism.","ref":"MTB Step 2","tags":"Medicine, Haematology, Anemia, Macrocytic Anemia","_id":97},{"id":96,"stem":"A 50-year-old female presents with a history of weight loss, preference for cold, and palpitations for the last 3 months. She has noticed a firm anterior neck lump for 5 years. What is your diagnosis?","opt1":"Simple goitre","opt2":"Graves disease","opt3":"Toxic nodular goitre","opt4":"Carotid body tumour","disc":"Multinodular goiter is the most common type in adults. However, some nodules may become autonomous causing hyperthyroidism. It is the most common cause of hyperthyroidism after Grave's disease.","ref":"UpToDate, Medscape","tags":"Medicine, Endocrinology, Hyperthyroidism, Goitre","_id":96},{"id":95,"stem":"A 24-year-old woman develops wheezing and shortness of breath when she is exposed to cold air or when she is exercising. She has noticed that these symptoms are becoming worse over the past few weeks. Which of the following is the agent of choice for the treatment of symptomatic relief?","opt1":"Inhaled short acting beta-2 agonists","opt2":"Oral theophylline","opt3":"Inhaled anticholinergics","opt4":"Oral antihistamines","disc":"Exercise-induced bronchoconstriction is a type of acute bronchospasm that occurs during or shortly after exercise. In fact here, exercise acts as a trigger in people with underlying asthma.\n\nIn these patients, the initial drug of choice for quick symptomatic relief is inhaled short-acting beta 2 agonists","ref":"UpToDate","tags":"Medicine, Asthma","_id":95},{"id":94,"stem":"A 17-year-old patient presents to your clinic. She obtained her 1st dose of varicella vaccine 1 year ago. Which of the following are correct regarding her 2nd dose?","opt1":"Give her second dose now","opt2":"Start a new regime","opt3":"2nd dose is not indicated","opt4":"Give both doses now","disc":"","ref":"","tags":"Medicine, Vaccination","_id":94},{"id":93,"stem":"Which of the following is false about Henoch-Schonlein purpura?","opt1":"Rash on face and trunk","opt2":"Arthritis","opt3":"Normal platelets","opt4":"Focal glomerulonephritis","disc":"Immunoglobulin A vasculitis is the most common vasculitis in childhood which affects children from ages 3 to 5.\n\nIt is a self-limiting disease with\n- Palpable purpura (mainly on dependent areas such as lower extremities) with normal platelets\/no coagulopathy\n- Arthritis\/arthralgia (common, transient\/migratory, non-deforming, oligoarthritis)\n- Abdominal pain (can be also due to gastrointestinal hemorrhage, bowel ischemia and necrosis, intussusception, and bowel perforation)\n- Renal disease (biopsy findings are identical to IgA nephropathy)","ref":"UpToDate","tags":"Pediatrics, Vasculitis","_id":93},{"id":92,"stem":"In a patient with suspected solitary brain abscess, which of the following is an important consideration in both adults and children?","opt1":"Frequent ear discharges","opt2":"History of recent head injury","opt3":"Recurrent frontal sinusitis","opt4":"Bronchiectasis","disc":"Direct local spread of infection can be from infections in head and neck sites. Paranasal sinus infection accounted for 30%-50% of the cases. Otitis media (5%) and mastoiditis (secondarily cause inferior temporal lobe and cerebellar brain abscesses), infection from frontal or ethmoid sinuses spread to the frontal lobes, and dental infection usually causes frontal lobar abscesses. Facial trauma, even from neurosurgical procedures, can result in necrotic tissue, and brain abscesses have been reported afterwards. Metal fragments or other foreign bodies left in the brain parenchyma can also serve as a nidus for infection.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK441841\/","tags":"Surgery, Brain Abscess, Sinusitis","_id":92},{"id":91,"stem":"The first step in the management of acute symptomatic hypercalcemia should be","opt1":"Administration of furosemide","opt2":"Bisphosphonates","opt3":"Calcitonin","opt4":"Correction of deficit of extra cellular fluid volume","disc":"Patients with severe or symptomatic hypercalcemia are usually dehydrated. Therefore they require the replacement of fluid status as the initial therapy (isotonic saline). Further treatment includes calcitonin, bisphosphonates, and glucocorticoids depending on the scenario. Dialysis is reserved for patients with very severe hypercalcemia.\n\nAdministration of a loop diuretic is not recommended as it will worsen the dehydration. ","ref":"UpToDate","tags":"Medicine, Hypercalcemia","_id":91},{"id":90,"stem":"A 20 year old patient presented with a history of low grade fever and arthralgia for 5 days. He had difficulty in swallowing with fever 3 weeks back. On examination he had a pansystolic murmur at the apex. The most likely diagnosis is","opt1":"Bacterial endocarditis","opt2":"Viral myocarditis","opt3":"Acute rheumatic fever","opt4":"Pericarditis","disc":"","ref":"","tags":"Medicine, Rheumatic Fever","_id":90},{"id":89,"stem":"A 25-year-old man with a three-day history of swelling and pain in his right knee joint develops right wrist joint involvement the next day. He's just returned from a trip to India. A physical examination reveals a temperature of 39 C, as well as swollen, tender joints. A 50cc sample of knee joint aspiration revealed septic arthritis with gram-negative cocci. Which of the following is the most probable organism responsible?","opt1":"Brucella spp.","opt2":"Staphylococcus aureus","opt3":"Neisseria gonorrhoeae","opt4":"Mycobacterium tuberculosis","disc":"The disseminated gonococcal infection has two clinical syndromes.\r\n- Tenosynovitis-dermatitis syndrome (a triad of oligoarthralgia, tenosynovitis, and dermatitis)\r\n- Purulent arthritis syndrome without skin lesions\r\n\r\nWhen the tenosynovitis dermatitis syndrome is untreated, it progresses to the latter which is characterized by supportive arthritis leading to pain, tender, swollen joints involving knees, wrists, and ankles. \r\n\r\nCultures of blood and synovial fluids are essential. \r\n\r\nPatients with septic arthritis need 7-14 days of ceftriaxone with joint drainage.\r\n","ref":"UpToDate","tags":"Medicine, Disseminated Gonorrhea Infection, Infectious Diseases, Septic Arthritis","_id":89},{"id":88,"stem":"A unilateral nasal discharge with an offensive odour in a child is commonly seen in","opt1":"Atrophic rhinits","opt2":"Adenoids","opt3":"Foreign body (neglected)","opt4":"Deviated nasal septum","disc":"Intranasal foreign bodies are common in children but they are usually asymptomatic. They are commonly located on the floor of the nasal passage. Common symptoms include\r\n- Mucopurulent discharge\r\n- Ddour\r\n- Epistaxis\r\n- Nasal obstruction\r\n- Mouth breathing\r\n\r\nAtrophic rhinitis is usually accompanied by nasal itching, sneezing, rhinorrhoea, and nasal congestion.\r\n\r\nEnlarged adenoids are the most common cause of nasal obstruction in a child. In addition, they also have mouth breathing, mucopurulent nasal discharge, snoring and disturbed sleep.\r\n\r\nAcquired deviation of the nasal septum is usually due to minor blunt trauma, sports, accidents, and other traumatic events.","ref":"UpToDate","tags":"Paediatrics, ENT","_id":88},{"id":87,"stem":"What is the mechanism of action of metformin in patients with Poly Cystic Ovarian Syndrome (PCOS)?","opt1":"Antagonising testosterone","opt2":"Lowering insulin resistance","opt3":"Increasing insulin secretion","opt4":"Direct stimulation of LH\/FSH","disc":"","ref":"","tags":"Gynaecology, PCOS","_id":87},{"id":86,"stem":"A 45-year-old lady presented with a history of nipple discharge that contains blood. No history of trauma. Which of the following is most likely aetiology?","opt1":"Duct papilloma","opt2":"Duct ectasia","opt3":"Breast abscess","opt4":"Fibroadenoma","disc":"Causes of nipple discharge:\r\n1. Serous\/milk: physiological, drugs, hyperprolactinemia\r\n2. Bloodstained: duct papilloma, intraductal carcinoma, Paget's disease of the nipple\r\n3. Yellow\/green: duct ectasia\r\n4. Pus: breast abscess, periductal mastitis","ref":"MTB Step 2","tags":"Surgery, Breast Discharge","_id":86},{"id":85,"stem":"In a moderate to severe asthma patient, you will find all the following EXCEPT","opt1":"PO2 < 60mmHg","opt2":"PCO2 > 60mmHg","opt3":"Low HCO3","opt4":"Dehydration","disc":"","ref":"","tags":"Medicine, Respiratory Medicine, Asthma","_id":85},{"id":84,"stem":"Which of the following medications is safe in the stable 3rd stage of kidney disease?","opt1":"Metformin","opt2":"Warfarin","opt3":"Nitrofurantoin","opt4":"Amoxicillin","disc":"","ref":"","tags":"Medicine, Nephrology, Chronic Kidney Disease","_id":84},{"id":83,"stem":"A 3 year old child wakes from sleep with features of croup. The differential diagnosis should include all of the following except","opt1":"Pneumonia","opt2":"Post nasal drip","opt3":"Tonsilitis","opt4":"Inhaled foreign body","disc":"","ref":"","tags":"Paediatrics, URTI","_id":83},{"id":82,"stem":"In a patient who is on chemotherapy, and presenting with a history of fever, all of the following should be done EXCEPT","opt1":"Blood culture","opt2":"Urine culture","opt3":"Broad spectrum antibiotics","opt4":"Aspirin for symptomatic relief","disc":"In all patients who are on chemotherapy presenting with fever, there should be a high suspicion of neutropenic febrile syndromes. Therefore, it is important to start empirical antibiotics (preferably within 60 minutes) after blood culture to prevent neutropenic sepsis and death.","ref":"UpToDate","tags":"Medicine, Oncology, Chemotherapy","_id":82},{"id":81,"stem":"Which of the following is not a recognized cause of secondary hyperlipidemia?","opt1":"Hypertension","opt2":"Nephrotic syndrome","opt3":"Hypothyroidism","opt4":"Obesity","disc":"The most common causes of recognized causes of secondary dyslipidemia include alcoholism and uncontrolled diabetes. In addition\r\n- Cholestatic liver disease\r\n- Nephrotic syndrome\r\n- Chronic renal disease\r\n- Hypothyroidism\r\n- Obesity\r\n- Smoking\r\n- Medications: thiazide diuretics, beta blockers, estrogens, clozapine, olanzapine\r\n\r\nTherefore hypertension itself is not a recognized cause.","ref":"UpToDate","tags":"Medicine, Secondary Dyslipidaemia","_id":81},{"id":80,"stem":"After attending a dinner party, 10 participants developed nausea and vomiting, abdominal cramps, and diarrhea within 6 hours. Most of them recovered spontaneously but few required admission to correct the dehydration. The most likely etiology is,","opt1":"Salmonella food poisoning","opt2":"Botulism","opt3":"Staphylococcal food poisoning","opt4":"Giardiasis","disc":"The timing of the onset of symptoms from exposure is important.\r\n- < 6 hours: suggests preformed toxins from Staphylococcus aureus or Bacillus cereus. Often the symptoms are nausea and vomiting.\r\n- 8-6 hours: suggests Clostridium perfringens\r\n- >16 hours: other bacterial or viral causes (e.g. enterotoxins)","ref":"UpToDate","tags":"Medicine, Diarrhea, Gastroenteritis, Infective Diarrhea","_id":80},{"id":79,"stem":"Which of the following is true regarding plane xanthomas?","opt1":"They are hard thick plaques seen on lateral aspect of upper eyelids","opt2":"They exhibit aggregates of foam cells in the upper dermis","opt3":"They are not related to hyperlipidemia in majority of cases","opt4":"They are associated with deposition of lipids around the arterioles","disc":"Plane xanthomas are yellow plaques that can be observed around the eyelids (xanthelasma), neck, trunk shoulders, or axillae. Plane xanthomas can arise with or without hyperlipidemia. Plane xanthomas are occasionally associated with monoclonal gammopathies, multiple myeloma, or other haematological disorders.","ref":"UpToDate","tags":"Medicine, Xanthoma, Dyslipidaemia","_id":79},{"id":78,"stem":"A 50-year-old man complains of a long-standing black spot with approximately 5mm diameter on his thigh, which has recently become darker with a bloody discharge. Which of the following is the most appropriate management option?","opt1":"Incisional biopsy","opt2":"Cryotherapy","opt3":"Radiotherapy","opt4":"Wide local excision","disc":"Melanoma can occur in sun-exposed as well as covered areas of the skin. Asymmetric, uneven borders, uneven colors, and the recent increase in size strongly suggest the diagnosis.\r\n\r\nA full-thickness biopsy is essential in diagnosing melanoma. A sentinel lymph node biopsy is required for staging.\r\n\r\nTreatment is surgical removal with a satisfactory margin of normal skin.","ref":"MTB Step 2 CK","tags":"Melanoma, Dermatology, Oncology","_id":78},{"id":77,"stem":"Which of the following is incorrect regarding subfertility?","opt1":"Male factor accounts for 24%","opt2":"Normal sperm count is >20,000,000","opt3":"Approximately 27% of the cases are idiopathic","opt4":"High prolactin could be a cause","disc":"","ref":"","tags":"Gynecology, Urology","_id":77},{"id":76,"stem":"Which of the following medications has been shown to be safe and effective as migraine prophylaxis in children?","opt1":"Proponolol","opt2":"Fluoxetine","opt3":"Lithium","opt4":"Naproxen","disc":"When migraine attacks are frequent, prolonged and disabling, prophylaxis is indicated. In children the following medications are recommended.\r\n- Propanolol\r\n- Flunarizine\r\n- Amitriptyline\r\n- Topiramate\r\n- Valproate\r\n\r\nIn addition, good sleep hygiene, routine meals, hydration and exercise are always advised.\r\n\r\nFluoxetine is used only in children after 8 years. Lithium is used in acute mania in children and adolescents with bipolar disorder.","ref":"UpToDate","tags":"Paediatrics, Migraine","_id":76},{"id":75,"stem":"The most common site of local gonococcal infection in females is","opt1":"Posterior fornix","opt2":"Anterior fornix","opt3":"Cervix","opt4":"Urethra","disc":"Gonorrhea and Chlamydia are sexually transmitted infections causing cervicitis. In addition, both might cause Pelvic Inflammatory Disease.\r\n\r\nDisseminated gonococcal infection can present as polyarticular involvement, tenosynovitis, and rash.","ref":"MTB Step 2 CK","tags":"Gynaecology, Infectious Disease, Sexually Transmitted Infection","_id":75},{"id":74,"stem":"On the 6th postoperative day after a closure of a colostomy, a 52-year-old man had a swinging fever followed by diarrhoea. The most likely diagnosis is","opt1":"Gastroenteritis","opt2":"Pelvic abscess","opt3":"Irritable bowel syndrome","opt4":"Cholecystitis","disc":"","ref":"","tags":"Surgery, Pelvic Abscess","_id":74},{"id":73,"stem":"The following are characteristic features of brucellosis except","opt1":"Diarrhoea","opt2":"Lymphadenopathy","opt3":"Splenomegaly","opt4":"Hepatomegaly","disc":"Common symptoms of brucellosis include fever, fatigue, and constitutional symptoms and examination may reveal hepatomegaly, splenomegaly, arthritis and epididymorchitis.","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/33000109\/","tags":"Medicine, Infectious Disease, Brucellosis","_id":73},{"id":72,"stem":"Good prognostic features in schizophrenia include all of the following except","opt1":"Lack of structural brain abnormalities","opt2":"Rapid course","opt3":"Male gender","opt4":"Absence of family history","disc":"Good prognosis:\r\n- Late-onset\r\n- Rapid course\r\n- Positive symptoms\r\n- Absence of family history\r\n- Lack of structural brain abnormalities","ref":"UpToDate and MTB Step 2","tags":"Psychiatry, Schizophrenia","_id":72},{"id":71,"stem":"A 25-year-old pregnant lady presents with fever and sore throat during the flu season. Then she developed a non-productive cough and dyspnea with features of hypoxia. The most likely diagnosis is","opt1":"Staph. pneumonia","opt2":"Strep. pharyngitis","opt3":"Pneumococcal pneumonia","opt4":"Viral pneumonia","disc":"Viruses are common causes of community-acquired pneumonia (CAP), especially during flu season. Influenza remains the most important viral cause of CAP. Influenza A and B can cause outbreaks, particularly during the winter season.","ref":"UpToDate","tags":"Medicine, Pneumonia, Viral Pneumonia, Respiratory Medicine, Pregnancy","_id":71},{"id":70,"stem":"An 88-year-old patient is referred for an acute exacerbation of arthritis of her fingers. She had a similar episode 6 months back which resolved spontaneously. She also reveals that she has been having progressive symptoms of stiffness, pain and restriction of finger movements over several years. On examination, you notice swelling of her right 3rd distal interphalangeal joint (DIP). This swelling is referred to as","opt1":"Osler nodes","opt2":"Herbeden's nodes","opt3":"Bouchard's nodes","opt4":"Synovial swelling","disc":"Hand osteoarthritis frequently manifests as stiffness and pain in the PIP, DIP, and base of the thumb. Asymptomatic nodules involving these joints, particularly DIP - Herbeden's nodes and PIP - Bouchard's nodes, may exist. The wrist is usually spared, but MCP joint damage is found, especially in co-existing metabolic disorders such as hemochromatosis.","ref":"https:\/\/www.msdmanuals.com\/professional\/musculoskeletal-and-connective-tissue-disorders\/hand-disorders\/osteoarthritis-of-the-hand?query=osteoarthritis","tags":"Medicine, Osteoarthritis","_id":70},{"id":69,"stem":"A 36-year-old man developed polyuria, polydipsia, and weight loss for a month. His BMI is 28 kg\/m2, urine analysis showed glucosuria and ketones and FBS is 280 mg\/dL. The best initial therapy is","opt1":"Intermittent IM insulin injection till stable","opt2":"NPH or lenti insulin 30 U daily and diabetic diet","opt3":"Sulphonylurea and diabetic diet","opt4":"Metformin","disc":"","ref":"","tags":"Medicne, Endocrinology, Diabetes Mellitus","_id":69},{"id":68,"stem":"An 8-year-old child with leukaemia who is on chemotherapy came with fever and apathy. On examination, she showed features of mild-moderate dehydration and tachycardia of 110 BPM. Labs showed Na 140, K 3.6, WBC 0.2\/mm3 and a platelet count of 47,000. The next essential step in management is","opt1":"Lumbar puncture","opt2":"Refer to oncology","opt3":"IV ceftriaxone","opt4":"Platelet transfusion","disc":"Neutropenic sepsis is a medical emergency. It is a predictable complication of bone marrow disorders and cytotoxic chemotherapy. Patients are vulnerable to invasive infection which can lead to septic shock and death. In addition to securing the airway, breathing and circulation the next crucial step in management is the prompt administration of empirical antibiotics. Intravenous broad-spectrum antibiotics are preferred in addition to crystalloids.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4952638\/","tags":"Paediatrics, Oncology, Leukaemia, Medical Emergency","_id":68},{"id":67,"stem":"Recognized risk factors\/causes of spontaneous abortions include","opt1":"Genetic abnormalities","opt2":"Previous induced abortions","opt3":"Advance maternal age","opt4":"Maternal endocrinopathies","disc":"The main risk factors associated with spontaneous miscarriages are\n- Maternal age\n- Previous spontaneous miscarriages\n- Maternal smoking\n\nIn addition, the following factors are also important.\n- Chromosomal abnormalities (50% of all miscarriages)\n- Congenital anomalies (due to intrinsic or extrinsic factors such as maternal diabetes, isotretinoin, maternal fever, mercury)\n- Trauma\n- Uterine structural abnormalities\n- Toxoplasmosis, HSV, CMV\n- Gravidity\n- Prolonged time to conception\n- Alcohol\n- Cocaine\n- NSAIDS\n- Caffein\n- Folate deficiency\n- Maternal obesity\n- Celiac disease\n- Unexplained","ref":"UpToDate","tags":"Gynecology, Spontaneous Abortion, Miscarriage","_id":67},{"id":66,"stem":"Indications for valve replacement in infective endocarditis include all except","opt1":"Resistant bacterial endocarditis","opt2":"Fungal endocarditis","opt3":"Viral endocarditis","opt4":"Aortic valve regurgitation","disc":"Indications for surgical intervention\r\n- Acute valve rupture with heart failure\r\n- Prosthetic valves\r\n- Fungal endocarditis\r\n- Abscess\r\n- AV block\r\n- Recurrent emboli while on antibiotics","ref":"MTB Step 2 CK","tags":"Medicine, Infective Endocarditis","_id":66},{"id":65,"stem":"A 7-month-old child is brought to your office by his mother. He has had an upper respiratory tract infection for the last 3 days. On examination, there is erythema of the left tympanic membrane with opacification. There are no other signs or symptoms. What is the most likely diagnosis?","opt1":"Acute otitis media","opt2":"Otitis media without effusion","opt3":"Chronic otitis media","opt4":"Chronic suppurative otitis media","disc":"Otitis media typically presents as either acute otitis media (AOM), with symptoms including fever, otalgia, otorrhoea or irritability and short duration; or as otitis media with effusion (OME), which is often asymptomatic and characterised by accumulation of fluid in the middle ear. Diagnostic certainty of otitis media is challenging, given the young age of patients and variability of symptoms. Otitis media predominantly occurs as coincident to viral upper respiratory tract infections and\/or bacterial infections. Common viruses that cause upper respiratory tract infection are frequently associated with AOM and new-onset OME.","ref":"https:\/\/onlinelibrary.wiley.com\/doi\/full\/10.5694\/j.1326-5377.2009.tb02926.x","tags":"Paediatrics, Otitis Media","_id":65},{"id":64,"stem":"A 30 year-old-man presented with a history of sudden onset left-sided chest pain and shortness of breath. His blood pressure is 80\/50. Examination reveals hyper-resonance on the left side of the chest. The most likely diagnosis is","opt1":"Pneumonia with pleural effusion","opt2":"Myocardial infarction","opt3":"Spontaneous pneumothorax","opt4":"Pericarditis","disc":"Primary spontaneous pneumothorax in adults is when a pneumothorax occurs without a precipitating event or a lung disease. It presents as acute dyspnoea and pleuritic chest pain at rest with peak onset in the early 20s.\r\n\r\nRisk factors include smoking, family history, homocystinuria, and Marfan syndrome. \r\n\r\nPhysical signs in a significant pneumothorax include reduced air sounds with a hyper resonant percussion note. Labored breathing and hemodynamic instability may indicate a tension pneumothorax.\r\n\r\nIn a clinically significant parapneumonic effusion, the shortness of breath will be not abrupt and the percussion note will be dull.","ref":"UpToDate","tags":"Medicine, Emergency Medicine, Spontaneous Pneumothorax","_id":64},{"id":63,"stem":"Which of the follwing is true regarding Pre-Eclampsia?","opt1":"Commoner in multipara than primigravida","opt2":"Rarely seen in patients with pre-existing diabetes","opt3":"Headache and blurred vision are alarming symptoms","opt4":"Usually progresses very fast to eclampsia","disc":"Pre-eclampsia is a multi-system disorder which is characterized by new-onset hypertension, proteinuria or features of end-organ damage after 20 weeks of pregnancy.\r\n\r\nNulliparity is a moderate risk factor for developing pre-eclampsia (PE). Type I or II diabetes is considered as a high risk factor. (USPSTF criteria). Only 2-3 patients with PE severe features, develop eclampsia when untreated.","ref":"UpToDate","tags":"Obstetrics, Pre Eclampsia","_id":63},{"id":62,"stem":"A 29-year-old waiter consulted you regarding what he describes as an 'intense fear' before he begins his night shifts. He tells you that it is only a matter of time before he 'makes a real major mistake'. What is the most likely diagnosis?","opt1":"A specific phobia","opt2":"A social phobia","opt3":"A mixed phobia","opt4":"Panic disorder with agorophobia","disc":"","ref":"","tags":"Psychiatry","_id":62},{"id":61,"stem":"A 28-year-old male presented with rectal bleeding during defecation which is associated with pain. He describes it as a small amount of bright red blood. The pain is maximal at defecation which is burning and searing lasting for approximately 30 minutes even after defecation. What is the most likely diagnosis?","opt1":"Adenocarcinoma of rectum","opt2":"Internal haemorrhoides","opt3":"Anal fissure","opt4":"Thrombosed external haemorrhoides","disc":"An anal fissure is a tear in the anal canal mucosa distal to the dentate line. It can be primary (trauma) or secondary (Crohn's disease). \r\n\r\nClinical features include anal pain provoked by defecation which lasts for hours. It's often associated with fresh bleeding. On examination, it may be visualized directly. However digital rectal examination is not recommended.\r\n\r\nAcute fissures (<8 weeks) are superficial whereas chronic fissures appear as hypertrophied skin tags\/papillae.","ref":"UpToDate","tags":"Surgery, Rectal Bleeding, Anal Fissure","_id":61},{"id":60,"stem":"Asbestosis will lead to","opt1":"Bilateral pleural effusions","opt2":"Unilateral fibrosis","opt3":"Diffuse pleural thickening","opt4":"Large amount of sputum production","disc":"Asbestosis refers to pneumoconiosis due to inhalation of asbestos fibers. It results in slowly progressive, diffuse lung fibrosis.\r\n\r\nClinical features include breathlessness on exertion. Cough, wheezing and sputum production are unusual.\r\n\r\nBenign asbestos pleural effusions are small, unilateral effusions which resolve spontaneously over few months. They can recur. Pleural changes are plaques and diffuse pleural thickening which might calcify. Malignant mesothelioma is associated with asbestos exposure. \r\n","ref":"UpToDate","tags":"Respiratory Medicine, Asbestosis, Lung Fibrosis","_id":60},{"id":59,"stem":"Complications of systemic hypertension include all of the following EXCEPT","opt1":"Intracerebellar hemorrhage","opt2":"Renal artery stenosis","opt3":"Aortic dissection","opt4":"Nephrosclerosis leading to proteinuria and renal damage","disc":"Renal artery stenosis is a major cause (10%) of renovascular hypertension. It is also a predisposing factor for renal impairment and end-stage renal disease.\r\n\r\nAll other options are recognized complications of long-standing uncontrolled hypertension.","ref":"Medscape","tags":"Hypertension, Medicine, Renal Artery Stenosis","_id":59},{"id":58,"stem":"A 2-year-old baby was brought to the clinic because of an inability to walk straight. On examination, there was asymmetry of skin creases in the groin. the Trendelenburg's sign was positive on the left side. What is your diagnosis?","opt1":"Fracture of the pelvis","opt2":"Fracture of the femur on the left side","opt3":"Congenital hip dislocation","opt4":"Rickets","disc":"The hip examination is essential during every consultation until the child walks independently (approximately 9 months of age). Examination techniques include the Ortolani manoeuvre and the Barlow manoeuvre. Less specific but important findings are asymmetry (of femur length, skin folds, or gait) and decreased hip abduction.","ref":"UpToDate","tags":"Paediatrics, Developmental Dysplasia of Hip","_id":58},{"id":57,"stem":"The most common site of perforation during dilatation and curettage (D&C) is","opt1":"Cervix","opt2":"Fundus","opt3":"Posterior wall","opt4":"Lateral wall","disc":"The most common site of perforation is fundus.","ref":"UpToDate","tags":"Gynaecology","_id":57},{"id":56,"stem":"S3 occurs in all of the following conditions except","opt1":"Tricuspid regurgitation","opt2":"Young athletes","opt3":"Left ventricular failure","opt4":"Mitral stenosis","disc":"S3 and S4 are low-frequency diastolic sounds which originate in the ventricles during filling and increase in dimentions.\r\n\r\nPhysiological 3rd heart sound is due to rapid diastolic filling which is seen in young adults, children, athletes, pregnancy and fever. However after 40 years, it is considered abnormal.\r\n\r\nReduced ventricular compliance results in a mid diastolic sound which is called pathological 3rd heart sound. If it is associated with tachycardia, it is called gallop rhythm.\r\n\r\nLeft ventricular S3 is louder at apex and during expiration. It indicates LV failure and can occur in AR, MR, VSD and PDA.\r\n\r\nRight ventricular S3 is louder at left sternal edge with inspiration. RV failure with pulmonary hypertension and constrictive pericarditis are common causes.","ref":"UpToDate","tags":"Medicine, Cardiology, Valvular Heart Disease","_id":56},{"id":55,"stem":"Which of the following antidepressant can cause agitation\/anxiety?","opt1":"Venlafaxine","opt2":"Fluoxetine","opt3":"Imipramine","opt4":"Phenelzine","disc":"Venlafaxine is a SNRI which is contraindicated in uncontrolled hypertension and high risk of arrhythmia.\r\n\r\nImipramine is a TCA. Common side effects include drowsiness, dry mouth, blurred vision, constipation, urine retention and sweating.\r\n\r\nPhenelzine is a MAOI. Patients must be carefully monitored for high BP and should be initiated in a specialist setting.\r\n\r\nSSRIs such as fluoxetine can cause short term increase in anxiety\/agitation when started. Other side effects include dyspepsia and PPI should be considered if >60 years with risk of bleeding.","ref":"Oxford Handbook of General Practice","tags":"Psychiatry, Antidepressants","_id":55},{"id":54,"stem":"A 23-year-old female consulted her doctor because of a breast mass. It is mobile, firm, and approximately 1cm in diameter. It is located in the upper outer quadrant of the right breast. No axillary lymph nodes are felt during the examination. What is the treatment of choice for this condition?","opt1":"Modified radical mastectomy","opt2":"Lumpectomy and core biopsy","opt3":"Radical mastectomy","opt4":"Watchful waiting","disc":"A fibroadenoma is a mobile well-defined mass that is a benign solid tumor. It has glandular and fibrous tissue histologically. After a USS confirmation, a definitive diagnosis can be obtained with a core needle biopsy. \r\n\r\nIn young patients, observation with repeat USS in 3-6 months can be done in the absence of other significant clinical signs. Excision is required if the size increases significantly to exclude a malignancy.","ref":"MTB Step 2 CK","tags":"Surgery, Breast Mass, Fibroadenoma","_id":54},{"id":53,"stem":"Known risk factors for suicide include all of the following except","opt1":"Repeated attempts","opt2":"Male gender","opt3":"Drug and alcohol dependence","opt4":"If the doctor asked the patient about suicide","disc":"Many risk factors are associated with a high risk of suicide.\r\n- History of attempts\/threats: the strongest risk factor\r\n- Psychiatric disorders\r\n- Gender: males complete suicide 3 times more often than females (females attempt more often than males)\r\n- Health: suicide risk increases when having physical illnesses including chronic pain\r\n- Family history: increases with positive family history\r\n\r\n\"Clinicians may worry that asking about suicide will initiate suicidal thoughts or actions, but there are no data to support this concern. By contrast, many patients appreciate the opportunity to discuss suicidal thoughts, and may not verbalize these issues without being prompted. Sometimes the only clue to a suicidal patient is the initiation of an office visit.\" - UpToDate","ref":"UpToDate","tags":"Psychiatry, Suicide, Depression","_id":53},{"id":52,"stem":"A 20-year-old married lady presented with a history of left lower abdominal pain and amenorrhea for 6 weeks. The most appropriate investigation to rule out a serious diagnosis is","opt1":"Complete blood count","opt2":"Pelvic USS","opt3":"Abdominal Xray","opt4":"Vaginal swab for culture and sensitivity","disc":"In addition to a urine HCG test, pelvic USS is crucial to exclude a tubal\/nontubal ectopic pregnancy.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC5424401\/","tags":"Gynaecology, Ectopic Pregnancy","_id":52},{"id":51,"stem":"A 55-year-old man who is diagnosed with COPD, complains of 1 week of fever and productive cough. Chest X-ray shows left upper lobe pneumonia. Sputum culture is positive for H. influenza. What is the antibiotic of choice?","opt1":"Penicillin","opt2":"Doxycyclin","opt3":"Cefuroxime","opt4":"Gentamycin","disc":"Infective exacerbations of COPD are mostly due to S. pneumoniae, H. influenzae and M. catarrhalis. Therefore initial antibiotic of choice for an outpatient can be doxycycline or amoxicillin-clavulanic acid. Patients who are over 65 years or with frequent exacerbations mostly require the latter or a newer generation of fluoroquinolone.\r\n\r\nInward patients mostly receive 3rd generation cephalosporins, fluoroquinolones or macrolides. For more severe infections, treatment should include a third-generation cephalosporin or augmented penicillin, plus a fluoroquinolone or an aminoglycoside for synergy.","ref":"https:\/\/www.aafp.org\/afp\/2001\/0815\/p603.html#:~:text=Mild%20to%20moderate%20exacerbations%20of,sulfamethoxazole%20and%20amoxicillin%2Dclavulanate%20potassium.","tags":"Respiratory Medicine, COPD","_id":51},{"id":50,"stem":"A child can walk without support in","opt1":"6 months","opt2":"9 months","opt3":"15 months","opt4":"18 months","disc":"At 9 months babies start to walk forward and side-ways while cruising on furniture.\r\n\r\nBy 15 months most babies can walk independently. They can start, stop and carry up to two objects.","ref":"","tags":"Paediatrics, Developmental Milestones","_id":50},{"id":49,"stem":"A newborn was found to have a heart rate of 300 BPM with normal blood pressure and respiratory rate. A rhythm strip showed 300-310 BPM with a saw tooth pattern. With a diagnosis of Atrial Flutter, which of the following is the best initial management?","opt1":"Synchronized DC cardioversion","opt2":"Verapamil","opt3":"Intravenous Diltiazem","opt4":"Digoxin","disc":"Atrial flutter can occur in neonates with structurally normal hearts as well as with an underlying pathology (valvular heart diseases, cyanotic heart diseases, post-surgery). \r\n\r\nAs the baby is hemodynamically stable, the initial treatment is digoxin. If it fails, electric cardioversion is attempted. However, calcium channel blockers are contraindicated in neonates due to the potential risk of fatal cardiovascular collapse. An alternative for electric cardioversion is trans-oesophagal pacing.\r\n\r\nComplications include heart failure and nonimmune hydrops fetalis if left untreated.","ref":"UpToDate","tags":"Pediatrics, Neonatology, Atrial Flutter","_id":49},{"id":48,"stem":"Laparoscopy could be used in all of the following conditions except","opt1":"Subfertility","opt2":"Intestinal obstruction","opt3":"Primary amenorrhea","opt4":"Endometriosis","disc":"","ref":"","tags":"Surgery, Gynecology, Laparoscopy","_id":48},{"id":47,"stem":"Gastric lavage is contraindicated in","opt1":"Aspirin","opt2":"Cleaning solution","opt3":"Vitamin E","opt4":"Metformin","disc":"Gastric lavage may be usuful in the first hour of ingestion. However it is contraindicated in\n- Altered mental status (aspiration)\n- Caustic ingestion (burning of esophagus\/oropharynx)","ref":"MTB Step 2 CK","tags":"Emergency Medicine, Toxicology, Poisoning","_id":47},{"id":46,"stem":"Postpartum haemorrhage is more commonly associated with","opt1":"Multiple pregnancies","opt2":"Anemia","opt3":"Preterm delivery","opt4":"Antithrombin III deficiency","disc":"The main reason for postpartum haemorrhage is uterine atony which contributes to up to 80% of cases of postpartum haemorrhage (PPH). The large placental area and over distended uterus increase the risk of PPH. Other common reasons for PPH include genital tract injuries, placenta accreta or coagulopathies.","ref":"https:\/\/pubmed.ncbi.nlm.nih.gov\/32039467\/","tags":"Obstetrics, Post Partum Haemorrhage","_id":46},{"id":45,"stem":"Which of the following is used in rapid relief of anxiety?","opt1":"Benzodiazepine","opt2":"SSRI","opt3":"Barbiturates","opt4":"Buspirone","disc":"Benzodiazepines are used for the rapid relief of anxiety (such as alprazolam, clonazepam, or lorazepam).\r\n\r\nUsually, they are started along with SSRI for anxiety and panic disorders and slowly tapered off to prevent abuse.","ref":"MTB Step 2 CK","tags":"Psychiatry, Anxiety Disorder","_id":45},{"id":44,"stem":"A patient was diagnosed to have a duodenal 2 weeks ago. He was given a course of ranitidine. The breath test for H. pylori is positive. What is your choice of management?","opt1":"Omeprazole, clarithromycin and amoxycillin","opt2":"Bismuth, tetracyclin, and metronidazole","opt3":"Metronidazole, amoxicilin, d-omeprazole and tetracycline","opt4":"Continue ranitidine and add pantoprazole","disc":"The most common cause of peptic ulcer disease is H. pylori.\r\n\r\nInitial treatment includes PPIs + two antibiotics - clarithromycin and amoxicillin. If the response is not adequate metronidazole, levofloxacin or tetracycline are considered.\r\n\r\nIn suspected cases of resistance, adding bismuth to a change of antibiotics may be beneficial (quadruple therapy).\r\n\r\nEradication should be confirmed with stool antigen or breath test.","ref":"MTB Step 2 CK","tags":"Medicine, Gastroenterology, Helicobacter pylori, Duodenal Ulcers","_id":44},{"id":43,"stem":"A 35-year-old primigravida is coming for her first check-up at 16 weeks of gestation. She has no previous medical history. She expresses her excitement about her pregnancy. Her blood pressure after a rest was 160\/100 mmHg. After one week her blood pressure was 154\/96 mmHg. What is the most likely diagnosis?","opt1":"Pre-eclampsia","opt2":"Chronic hypertension","opt3":"Labile hypertension","opt4":"Transient hypertension","disc":"Chronic hypertension is defined as SBP ≥140 mm Hg and\/or DBP ≥90 mm Hg before pregnancy or before 20 wk of gestation.","ref":"https:\/\/www.ahajournals.org\/doi\/10.1161\/CIRCULATIONAHA.113.003904","tags":"Obstetrics, Chronic Hypertension","_id":43},{"id":42,"stem":"The term \"Colles fracture\" refers to","opt1":"A fracture of scaphoid","opt2":"A fracture identified in relation to the elbow","opt3":"A fracture involving the distal end of the radius","opt4":"A fracture of the radial head","disc":"Colles fracture is a distal radial fracture as the result of falling on an outstretched hand. The distal radius displaces dorsally resulting in a dinner fork deformity.","ref":"UpToDate","tags":"Orthopaedics, Fractures","_id":42},{"id":41,"stem":"A 35-year-old patient presents with a history of pain in the sacroiliac joint for a month. He complains of morning stiffness and buttock pain.\n\nWhich of the following is least likely to be identified during the rest of the evaluation of this patient?","opt1":"Negative rheumatoid factor","opt2":"Subcutaneous nodules","opt3":"Uveitis","opt4":"Osteopenia","disc":"Lower back pain and stiffness which radiates to buttocks in a young person (usually <40 years) is a clue to diagnosing Ankylosing Spondylitis (AS). There may be associated loss of normal curvature of the lumbar spine, reduced chest expansion, and Achilles tendinitis. In addition, he may have transient peripheral arthritis (knee, shoulders, and hips), uveitis, osteopenia, and \"Bamboo\" spine later.\n\nAS belongs to seronegative spondyloarthropathies which share common characteristics of\n- Rheumatoid factor negative\n- Involvement of spine and large joints\n- Uveitis\n- Enthesitis\n- HLA B27 association\n\nHowever subcutaneous nodules are found in 20% of patients with Rheumatoid Arthritis (RA). They are mostly over bony prominences. Rheumatoid nodules are the most common extra-articular manifestations of RA.","ref":"MTB Step 2 CK","tags":"Rheumatology, Ankylosing Spondylitis, Arthritis","_id":41},{"id":40,"stem":"The clinical features of severe preeclampsia include all of the following except","opt1":"Ankle edema","opt2":"Polyuria","opt3":"Exaggerated reflexes","opt4":"Right upper quadrant pain","disc":"Features of severe preeclampsia include:\n- Persistent severe headache\n- Visual abnormalities\n- Upper abdominal pain\n- Altered mental status\n- Dyspnea, retrosternal chest pain\n- Generalized hyperreflexia\n- Oliguria (<500ml\/24h in severe disease)\n- Placental abruption","ref":"UpToDate","tags":"Obstetrics, Hypertension in Pregnancy, Preeclampsia","_id":40},{"id":39,"stem":"Which of the following features best distinguishes Crohn's disease from ulcerative colitis?","opt1":"Presence of ileal disease","opt2":"History of cigarette smoking","opt3":"Non-caseating granulomas","opt4":"Rectal disease","disc":"Both ulcerative colitis and Crohn's disease can affect the colon. In such cases following features can differentiate CD from UC.\n- Small bowel involvement\n- Sparing the rectum\n- Absence of gross bleeding\n- Perianal disease\n- Presence of granuloma and fistulae","ref":"UpToDate","tags":"Medicine, Gastroenterology, Crohns Disease, Ulcerative Colitis, Inflammatory Bowel Disease","_id":39},{"id":38,"stem":"Among the causes of portal hypertension, which of the following will cause the least hepatocellular damage","opt1":"Schistosomiasis","opt2":"Alcoholic cirrhosis","opt3":"Post necrotic scarring","opt4":"Chronic active hepatitis","disc":"","ref":"","tags":"Gastroenterology, Medicine, Cirrhosis","_id":38},{"id":37,"stem":"Which of the following is a treatment option for Pyoderma Gangrenosum?","opt1":"Systemic steroids","opt2":"Methotrexate","opt3":"Broad-spectrum antibiotics","opt4":"Antihistamins","disc":"Pyoderma Gangrenosim (PG) is a rare but serious condition. Classic PG is characterized by pink\/purple deep ulcers with undermined edges. Patients can present with pain and fever. Other variants include peristomal PG, pustular PG, bullous PG, and vegetative PG. A biopsy is required to exclude the diagnosis of other diseases.\r\n\r\n50% of the patients have an underlying systemic condition, Inflammatory Bowel Disease (no correlation with disease activity), arthritis\/seronegative spondyloarthritis, or haematological malignancies (mostly myeloid, leukaemia being the most common). Additional treatment options are azathioprine and infliximab.\r\n\r\nNo single specific treatment is available except for a step-wise approach. Topical treatment with high dose potent corticosteroids underneath occlusive dressing can be used alone or with systemic steroids. Most patients need systemic steroids (prednisolone). When corticosteroids fail, cyclosporin is used. ","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC1513476\/","tags":"Dermatology","_id":37},{"id":36,"stem":"A female patient wears eyeglasses since 10 years of age. She was recently diagnosed with type 2 diabetes mellitus. She should have eye examinations\/screens every","opt1":"6 months","opt2":"12 months","opt3":"2 years","opt4":"5 years","disc":"","ref":"","tags":"Medicine, Endocrinology, Diabetes Mellitus","_id":36},{"id":35,"stem":"Incidence is calculated by the number of","opt1":"Old cases during the study period","opt2":"New cases at a point in time","opt3":"New cases during the study period","opt4":"Old cases at a point in time","disc":"Incidence is the rate at which new diseases occur. It is measured in new numbers of cases per unit of time.\r\n\r\nMedical therapies that lower mortality does not change the incidence of the disease.","ref":"MTB Step 2 CK","tags":"Epidemiology, Statistics","_id":35},{"id":34,"stem":"A 55-year-old male presented with a history of dyspnea, paroxysmal nocturnal dyspnea, nocturia, and anorexia for the past 3 weeks. On examination, he has mild pedal pitting edema with bi-basal crackles.\n\nWhich of the following is the most common cause of his condition?","opt1":"Coronary artery disease","opt2":"Thyroid disease","opt3":"Valvular heart disease","opt4":"Ethanol use","disc":"Congestive cardiac failure with systolic dysfunction is characterized by\n- Exertional dyspnea\n- Orthopnea\n- Peripheral edema\n- Rales\n- Jugular venous distention\n- PND\n- S3 gallop rhythm\n\nCommon causes of heart failure include\n- Coronary artery disease (RR 8.1)\n- Smoking\n- Hypertension\n- Obesity\n- Diabetes\n- Valvular heart disease\n\nLess common causes include\n- Alcohol\n- Postviral (idiopathic) myocarditis\n- Radiation\n- Adriamycin (doxorubicin) use\n- Chagas disease and other infections\n- Hemochromatosis (also causes restrictive cardiomyopathy) Thyroid disease\n- Peripartum cardiomyopathy\n- Thiamine deficiency","ref":"UpToDate, MTB Step 2 CK","tags":"Medicine, Congestive Cardiac Failure, Ischemic Heart Disease, Coronary Artery Disease","_id":34},{"id":33,"stem":"The best detector of the progress of labor is","opt1":"Severity of pain","opt2":"Dilation","opt3":"Descent","opt4":"Dilation and descent","disc":"The progress of the first stage is classically assessed using Friedman's labor curve which takes cervical dilatation into consideration. Decent indicates the progress of the second stage.","ref":"UpToDate","tags":"Obstetrics, Normal Labor","_id":33},{"id":32,"stem":"The most accurate test for diagnosing diabetic nephropathy is","opt1":"USS Abdomen","opt2":"Urine albumin to creatinine ratio","opt3":"Urine dipstick","opt4":"Blood urea and nitrogen ratio","disc":"Diabetic nephropathy is diagnosed with >300mg\/24h albuminuria or >300 albumin\/Cr ratio with type 1 or 2 diabetes with retinopathy and no renal diseases.","ref":"UpToDate","tags":"Medicine, Diabetes","_id":32},{"id":31,"stem":"An 18-year-old female comes into the clinic complaining of diffuse pain in the right lower quadrant for 3 days. It began around her umbilicus which was associated with nausea. The pain aggravates with movement. She has a low-grade temperature of 99.6F. Her last menstrual period ended 3 days ago.\n\nWhat is the most likely diagnosis?","opt1":"Ectopic pregnancy","opt2":"Ovarian cyst","opt3":"Acute appendicitis","opt4":"Intrauterine pregnancy","disc":"Classic symptoms of acute appendicitis include right lower quadrant pain, nausea, vomiting, and anorexia. Usually, there is migrating pain from the periumbilical region. Atypical presentations include flatulence, indigestion, and generalized malaise.\n\nThe differential diagnoses include Crohn's disease, ruptured cyst, acute ileitis, tubo-ovarian abscess, and most importantly ectopic pregnancy.","ref":"UpToDate","tags":"Surgery, Acute Abdomen, Acute Appendicitis","_id":31},{"id":30,"stem":"A 25-year-old patient presented with a history of cough and haemoptysis. He also has some joint pains. He denies any contact history of tubercluosis. Lab results showed high blood urea and creatinine. Urinalysis showed microscopic haematuria with dysmorphic red cells. This is condition is most likely due to","opt1":"Allergy","opt2":"Inflammatory","opt3":"Auto-immune","opt4":"Infective","disc":"Anti-Glomerular Basement Membrane antibody disease (Goodpasture's syndrome and Goodpasture's disease) is an autoimmune small vessel vasculitis involving the capillaries of the kidney and lung. Clinical features include rapid progressing crescentic glomerulonephritis and pulmonary haemorrhages.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC5498345\/","tags":"Medicine, Glomerulonephritis, Autoimmune","_id":30},{"id":29,"stem":"Which of the following is the most radiosensitive testicular tumour?","opt1":"Teratoma","opt2":"Yolk sac","opt3":"Choriocarcinoma","opt4":"Seminoma","disc":"Seminomas are sensitive to radiation as well as chemotherapy. Non-seminomas are sensitive to chemotherapy.","ref":"MTB Step 2","tags":"Surgery, Urology, Testicular Cancer","_id":29},{"id":28,"stem":"In a patient with urethral bleeding following a road traffic accident, which of the following is an essential step in the management?","opt1":"Inserting a foley catheter","opt2":"Inserting a suprapublic catheter","opt3":"Stabilizing pelvis","opt4":"Urgent cystoscopy","disc":"Any high velocity injury to the pelvis can cause an injury to the urethra. Posterior urethral damage occurs in a setting of significant pelvic fracture. Important clinical signs include blood at meatus, inability to void, or high riding prostate on digital rectal examination.\n\nSignificant pelvic fractures can make the patient hemodynamically unstable. Therefore measures should be taken to stabilize the patient before attempting to manage the urethral injury. However, regardless of the definitive management of the urethral injury, it is important to establish the urine drainage via a suprapublic tube (SPT).","ref":"UpToDate","tags":"Urology, Emergency Medicine, Pelvic Fracture","_id":28},{"id":27,"stem":"A 28-year-old female came to your clinic with a 2-month history of flitting arthralgia. Past medical history is unremarkable.\r\n\r\nOn examination she is afebrile. The right knee joint has mild swelling and tenderness. Other joints are clinically normal.\r\n\r\nComplete blood count: Hb 124 g\/L, WBC 9.2, ESR is 80 mm\/h\r\nRheumatoid factor: negative\r\nVDRL: positive\r\nUrine: RBC 15-20\/HPF\r\nProtein: 2+\r\n\r\nMost appropriate investigation at this stage is","opt1":"Blood culture","opt2":"ASO titre","opt3":"C reactive protein","opt4":"Anti double stranded DNA","disc":"SLE is an autoimmune disease resulting in diffuse inflammation through out the body. It is associated with a number of autoantibodies including ANA and anti-dsDNA.\n\nThe diagnostic testing include\n- ANA (95-99%)\n- Anti dsDNA (60%) and anti-Sm (30%) - highly specific to SLE (only found)\n- Decreased complement levels (correlates with disease activity)","ref":"MTB Step 2 CK","tags":"Medicine, Rheumatology, Arthritis, SLE","_id":27},{"id":26,"stem":"Disseminated intravascular coagulation can occur in all of the following except","opt1":"Abruptio placenta","opt2":"Fetal death","opt3":"Diabetes mellitus","opt4":"Pre-eclampsia","disc":"Causes of DIC include\n- Severe sepsis or infection: particularly gram-negative infections, malaria, Rickettsia infection\n- Trauma: severe tissue injury, burns, fat embolism, heatstroke, surgery\n- Severe inflammation: pancreatitis\n- Malignancy: solid tumors, hematological malignancies\n- Obstetrics causes: placental abruption, placenta previa, dead fetus, HELLP syndrome\n\nAlthough diabetes may predispose a person to these conditions it directly does not cause DIC.","ref":"https:\/\/www.researchgate.net\/publication\/328166671_Disseminated_Intravascular_Coagulation_An_Update_on_Pathogenesis_Diagnosis_and_Therapeutic_Strategies","tags":"DIC, Gynecology, Hematology","_id":26},{"id":25,"stem":"A 50 year old female has a firm anterior neck swelling. She complains of palpitations and weight loss. Your diagnosis is","opt1":"Simple goitre","opt2":"Toxic nodular goitre","opt3":"Parathyroid adenoma","opt4":"Hashimoto's thyroiditis","disc":"Palpitations and weight loss are features of hyperthyroidism. Causes for hyperthyroidism include,\r\n- Graves disease\r\n- Subacute thyroiditis\r\n- Exogenous thyroid hormone\r\n- Pituitary adenoma\r\n\r\nIn toxic nodular goitre, there's an enlargement of the thyroid gland with focal hyperactivity which results in clinical features of hyperthyroidism.","ref":"MTB Step 2 CK","tags":"Surgery, Goitre, Hyperthyroidism","_id":25},{"id":24,"stem":"The most commonly affected organ in blunt abdominal trauma is","opt1":"Liver","opt2":"Spleen","opt3":"Kidney","opt4":"Intestines","disc":"Spleen is the most commonly affected solid organ in blunt abdominal trauma (49%) followed by liver.","ref":"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0846537114000035#bib4","tags":"Surgery, Emergency Medicine, Blunt Abdominal Trauma","_id":24},{"id":23,"stem":"An 8-year-old girl presented with fever, numerous bruises over the entire body, and pain in both legs. Physical examination revealed pallor, ecchymoses and petechiae on the face, trunk and extremities. The complete blood count reveals a haemoglobin level of 6.3d\/dL, a WBC count of 2800\/mm3 and a platelet count of 29,000\/mm3. Which of the following would be the most appropriate diagnostic test?","opt1":"Hb electrophoresis","opt2":"Erythrocyte sedimentation rate","opt3":"Liver and spleen scan","opt4":"Bone marrow aspiration","disc":"Common causes of pancytopenia in paediatric patients include acute leukaemia and bone marrow failure. The most common type of leukaemia in this age group is ALL (25% of all malignancies; 75% of leukaemia). Therefore bonemarrow aspiration plays a key role in identifying the aetiology.\r\n\r\nHb electrophoresis is used to identify haemoglobinopathies. ESR and liver\/spleen USS is non-specific in identifying the aetiology.","ref":"UpToDate","tags":"Paediatrics, Oncology, Pancytopenia","_id":23},{"id":22,"stem":"A returning traveler has a history of fever for 4 days. The peripheral blood film is positive for malaria. Which of the following statement is correct regarding malaria?","opt1":"Banana shaped erythrocytes are seen in P. vivax","opt2":"Severe malaria is mostly due to P. falciparum","opt3":"Malaria can be treated immediately by primaquine 10mg for 3 days","opt4":"Response to treatment can be observed in 72 hours.","disc":"Plasmodium falciparum is the most common parasite and is responsible for most deaths worldwide. Outside sub-Saharan Africa, the dominant parasite is P. vivax. \n\nMalaria should be considered in all returning travelers with febrile illness.\n\nThe diagnosis is made by microscopy of thick and thin blood smears. Rapid diagnostic tests (RDT) to detect parasite antigen is also used as a screening test.\n\nSevere falciparum malaria (parasitemia >5%) is characterized by impaired conciousness\/seizures, acute kidney injury, anemia, shock, hypoglycemia, pulmonary edema, DIC, and acidosis.\n\nTreatment of mild to moderate malaria:\n- Falciparum: mefloquine or atovaquone\/proguanil\n- Non-falciparum: chloroquine or primaquine (test for G6PD before using)\n\nTreatment of severe malaria is artemisinins (artemether, artesunate)","ref":"Oxford Handbook of Clinical Medicine, MTB Step 2 CK","tags":"Medicine, Malaria, Infectious Disease","_id":22},{"id":21,"stem":"A 55-year-old male patient with a history of smoking for 23 years presented with a cough for 10 years which did not bother him much. It is productive of mucoid sputum which becomes purulent at times. He was wheezing during the consultation. On examination, he was found to be obese and have bilateral rhonchi. The most probable diagnosis is","opt1":"Emphysema","opt2":"Cystic fibrosis","opt3":"Bronchiectasis","opt4":"Chronic bronchitis","disc":"A chronic productive cough (for 3 months in at least 2 consecutive years) is suggestive of chronic bronchitis in the background of smoking. It may precede or follow airflow limitation. The presence of airflow obstruction is essential for the diagnosis of COPD. Clinical features are suggestive of an infective exacerbation.","ref":"UpToDate","tags":"Medicine, COPD","_id":21},{"id":20,"stem":"A 20-year-old man sustained a deep laceration on the anterior aspect of the wrist. Median nerve injury would result in","opt1":"A claw hand","opt2":"A wrist drop","opt3":"A sensory deficit only","opt4":"An inability to oppose the thumb to other fingers","disc":"Median nerve damage at the wrist (distal injury) will result in severe restriction of movement of the thumb including the inability to oppose thumb to other fingers ('Ape hand').\r\n\r\nRadial nerve injury will result in a wrist drop whereas ulnar nerve damage will result in a claw hand.","ref":"UpToDate","tags":"Surgery, Nerve Injury, Neuropathy","_id":20},{"id":19,"stem":"A 7-month-old infant with presents with a 4-month history of feeding difficulty. On examination, he has a normal S1 with a loud S2 and a pansystolic grade III\/IV parasternal murmur in the left 3rd intercostal space. The precordium is hyperactive. \n\nWhat is the diagnosis?","opt1":"Large VSD","opt2":"Large ASD","opt3":"PDA","opt4":"AR with MR","disc":"VSD is the most common congenital heart disease. Patients with VSD present mainly with dyspnea. Examination findings include high pitched pansystolic murmur over the left lower sternal border with a loud S2.\n\nPatients with ASDs are usually asymptomatic. Fixed splitting of S2 is an important finding.\n\nPDA is characterized by a machinery murmur over the left infrascapular region. Pulse pressure is wide and there is a bounding pulse. Children may present with failure to thrive, poor feeding, and respiratory distress. Uncorrected defects result in congestive heart failure and pulmonary hypertension. Development of pulmonary hypertension results in reversal of the shunt and Eisenmenger's syndrome later in life.\n\nAortic regurgitation results in a diastolic decrescendo murmur. Mitral regurgitation causes a pansystolic murmur.","ref":"MTB Step 2 CK","tags":"Pediatrics, Cardiology, VSD","_id":19},{"id":18,"stem":"Which of the following regimes is the recommended initial treatment for most adults with active tuberculosis?","opt1":"Isoniazid + Rifampicin","opt2":"Isoniazid + Rifampicin + Ethambutol","opt3":"Isoniazid + Rifampicin + Ethambutol + Pyrazinamide","opt4":"Isoniazid + Rifampicin + Ethambutol + Pyrazinamide + Ciprofloxacin","disc":"There must be either a positive x-ray finding or a positive smear with one or more clear risk factors to diagnose pulmonary tuberculosis. \n\nTreatment is commenced with a 4 drug regime (RIPE) for a standard 6 months duration.\n- Rifampicin\n- Isoniazid\n- Pyrazinamide (not in pregnancy)\n- Ethambutol (not needed if sensitive to all TB medications)\n\nAfter using RIPE for 2 months, continue rifampicin and isoniazid for another 4 months.\n\nThe following conditions require >6 months of therapy.\n- Osteomyelitis\n- Miliary TB\n- Meningitis\n- Pregnancy (when pyrazinamide is not used)\n- Cavitary lesions","ref":"MTB Step 2 CK","tags":"Medicine, Pulmonary Tuberculosis","_id":18},{"id":17,"stem":"A 5-month-old baby presented to ER with sudden onset of episodes of inconsolable crying. Each episode lasts 2-3 minutes, 15-20 minutes apart and the child draws up his legs towards the abdomen during an episode. They have become more frequent since the onset and there were few episodes of bilious vomiting. No history of fever.\r\n\r\nThe most likely diagnosis is","opt1":"Infantile colic","opt2":"Mesenteric ischemia","opt3":"Volvulus","opt4":"Intussusception","disc":"Intussusception is classically described as a triad of abdominal pain, palpable sausage-like mass, and passage of currant jelly. But these features are seen in only <15% of the patients. The only presenting symptom may be abdominal pain.\r\n\r\nInfantile colic is common in children <3 months of age.\r\n\r\nA midgut volvulus can present in any age but most commonly in infants and young children. The initial presentation is usually bilious vomiting. There may be upper abdominal distention and features of peritonitis. In advance cases, there may be abdominal wall erythema on examination.","ref":"UpToDate","tags":"Paediatrics, Intussusception","_id":17},{"id":16,"stem":"A patient is brought to the emergency room following multiple chest trauma. On examination, his blood pressure was 80\/50 and jugular venous pressure is elevated. Bilateral air entry was symmetrical and heart sounds are muffled.\n\nWhich of the following is the most appropriate diagnosis?","opt1":"Hypovolemic shock","opt2":"Bilateral pneumothoraces","opt3":"Cardiac tamponade","opt4":"Massive haemothorax","disc":"Acute cardiac tamponade is a life-threatening emergency. It is associated with raised jugular venous pressure and distended scalp and forehead veins. The heart sounds are muffled.\r\n\r\nHypotension is due to reduced cardiac output and the resulting cardiogenic shock will lead to cold extremities, peripheral cyanosis, and oliguria.","ref":"UpToDate","tags":"Emergency Medicine, Cardiac Tamponade","_id":16},{"id":15,"stem":"A 61-year-old patient with ischaemic heart disease and peripheral vascular disease is started on an ACE inhibitor by his GP for hypertension. Three weeks later he is admitted with confusion and vomiting. Investigation findings include Na 131 mmol\/L, K 7.3 mmol\/L, urea 37.8 mmol\/L, and creatinine 858 umol\/L. \n\nThe most likely cause of his hypertension is","opt1":"Phaeochromocytoma","opt2":"Polycystic kidney disease","opt3":"Diabetic nephropathy","opt4":"Renal artery stenosis","disc":"Renal artery stenosis and the resulting ischaemic nephropathy can give rise to hypertension which is resistant to ACE inhibitors. There can be acute deterioration of renal functions and azotemia if they are started on ACE inhibitors. Therefore, ACE inhibitors are contraindicated in renal artery stenosis even when they might have survival benefits from other conditions.","ref":"UpToDate","tags":"Medicine, Nephrology, Renal Artery Stenosis, Secondary Hypertension","_id":15},{"id":14,"stem":"Which of the following is considered a NORMAL finding associated with teething?","opt1":"Rhinorrhea","opt2":"Diarrhea","opt3":"Fever >39C","opt4":"Irritability","disc":"Parents report many symptoms during teething. They include fever, diarrhea, and other systemic symptoms. However, there is not enough evidence to support a possible correlation. \n\nIrritability, chewing on objects, and drooling are the most commonly seen features. There might be an elevation in temperature but it is usually <38C.","ref":"UpToDate","tags":"Pediatrics, Teething Symptoms","_id":14},{"id":13,"stem":"A 45-year-old man is brought to the emergency department following a road traffic accident. He was having a headache and dizziness on admission. During your night shift, he develops polyuria, and his serum creatinine level was 151 meq\/L.\n\nWhich of the following test is not indicated?","opt1":"Overnight dehydratiion test","opt2":"Measurement of response to desmopressin (dOAVP)","opt3":"Measurement of plasma and urine osmolality","opt4":"Measurement of morning cortisol level","disc":"Acute head trauma can lead to a dysfunction in hypothalamic neurons secreting ADH or posterior pituitary. This results in diabetes insipidus during the first few days following a head injury. They present with hypotonic polyuria.\n\nThe assessment begins with urine and plasma osmolality. Hypotonic urine confirms the diagnosis of diabetes insipidus.\n\nHowever, measuring early morning cortisol level is not indicated here.","ref":"https:\/\/doi.org\/10.3390\/jcm4071448","tags":"Emergency Medicine, Diabetes Insipidus, Head Injury","_id":13},{"id":12,"stem":"Which of the following is an important tool when listening to a patient?","opt1":"Imagination","opt2":"Using similar words and expressions as the patient","opt3":"A sense of humour","opt4":"All of the above","disc":"","ref":"","tags":"Community Medicine, Communication","_id":12},{"id":11,"stem":"A 55 year old patient presented with painless bright red blood passage with stools. Examination revealed external haemorrhoids. What is the next step in management?","opt1":"Urgent surgical referral for surgery","opt2":"Perform anoscopy","opt3":"Reassure and ask him to visit after 6 months","opt4":"Order a barium enema","disc":"A proper history and a physical examination is essential to diagnose hemorrhoids. PE includes a digital rectal examination and anoscopy. \n\nTreatment depends on the type and severity of the haemorrhoids.","ref":"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4541377\/","tags":"Surgery, Hemorrhoids","_id":11},{"id":10,"stem":"Which of the following is used as an initial management option in cold-induced urticaria without systemic features?","opt1":"Cimetidine","opt2":"Diphenhydramine","opt3":"Methylprednisolone","opt4":"Prednisolone","disc":"Cold urticaria results in wheals and\/or angioedema following exposure to cold conditions.\n\nThe diagnosis is confirmed by cold stimulation test.\n\nNonsedating H1 antihistamines are the drug of choice (loratadine, cetirizine, desloratadine).\n\nCimetidine is a histamine H2 receptor antagonist which inhibits gastric acid production. However, combination therapy with H2 antihistamines in some patients who respond poorly to H1 antihistamines has shown improvement.\n\nResponse to systemic glucocorticoids is variable.","ref":"UpToDate","tags":"Medicine, Dermatology, Urticaria","_id":10},{"id":9,"stem":"Which of the following is FALSE regarding pyelonephritis in pregnancy?","opt1":"Gentamycin is the drug of choice","opt2":"Abruptio placentae should be ruled out","opt3":"E. coli is a commonly recognized pathogen","opt4":"Treating asymptomatic bacteriuria is important in prevention","disc":"E. coli is the most common organism responsible for asymptomatic bacteriuria and UTIs in pregnant women. Approximately 30-40% with asymptomatic bacteriuria will develop symptomatic UTIs without treatment.\n\nAcute pyelonephritis presents with flank pain, nausea, vomiting, fever with renal angle tenderness. \n\nIntraamniotic infection and placental abruption are important differential diagnoses to exclude.\n\nFluoroquinolones and aminoglycosides are generally avoided during pregnancy. Empiric antibiotics include \n- Ceftriaxone, ampicillin + gentamycin in mild to moderate pyelonephritis\n- Meropenem in severe cases","ref":"UpToDate","tags":"Obstetrics, Pyelonephritis, Asymptomatic Bacteriuria","_id":9},{"id":8,"stem":"Regarding the criteria for diagnosing Diabetes Mellitus, the following are true EXCEPT","opt1":"FPG >=7.0 mmol\/L plus 2 hour post 75g glucose >=11.1mmol is diagnostic","opt2":"FPG <=5.5 mmol\/L is normal fasting glucose","opt3":"FPG >=7.0 mmol\/L in an asymptomatic patient warrants another confirmatory test","opt4":"2 hour 75g glucose >=7.6 mmol\/L and <11.1 mmol\/L is impaired glucose tolerance","disc":"ADA criteria for diagnosing diabetes mellitus is:\r\n\r\n- A fasting plasma glucose (FPG) level of 126 mg\/dL (7.0 mmol\/L) or higher, or\r\n\r\n- A 2-hour plasma glucose level of 200 mg\/dL (11.1 mmol\/L) or higher during a 75-g oral glucose tolerance test (OGTT), or\r\n\r\n- A random plasma glucose of 200 mg\/dL (11.1 mmol\/L) or higher in a patient with classic symptoms of hyperglycemia or hyperglycemic crisis, or\r\n\r\n- A hemoglobin A1c (HbA1c) level of 6.5% (48 mmol\/mol) or higher","ref":"Medscape, ADA","tags":"Medicine, Endocrinology","_id":8},{"id":7,"stem":"A 45-year-old patient presents with dysphagia for both liquids and solids. There is associated frequent regurgitation and chest pain. \n\nWhich of the following has the highest diagnostic value?","opt1":"Barium swallow","opt2":"Oesophageal manometry","opt3":"Upper GI endoscopy","opt4":"Response to a course of PPIs","disc":"In achalasia, there is a progressive degeneration of ganglion cells in the myenteric plexus. It results in the inability of the lower esophageal sphincter to relax. \n\nIt is characterized by dysphagia for solids and liquids. In contrast, obstructive lesions cause dysphagia initially for solids (when the lumen is narrower than 13mm) and then for liquids. There is frequent regurgitation and heartburn with associated chest pain which is resistant to a trial of PPIs.\n\nOesophageal manometry is required to establish the diagnosis. A barium swallow will show a dilated upper esophagus with a bird beak appearance. Upper GI endoscopic findings include retained food particles in the upper esophagus and resistance in the lower esophagus.\n\nPatients with achalasia are at higher risk for developing oesophageal carcinoma.","ref":"UpToDate","tags":"Surgery, Dysphagia","_id":7},{"id":6,"stem":"A 15-year-old girl who had menarche at the age of 13 years, complains of menstrual pain. She is not sexually active. Her examination & pelvic US were normal. How are you going to manage her?","opt1":"Laparotomy","opt2":"Danazol","opt3":"Cervical dilatation","opt4":"NSAIDs","disc":"Primary dysmenorrhea is crampy abdominal pain during menstruation without a pelvic pathology.\n\nSecondary causes for dysmenorrhea should be excluded using history and examination.\n- Endometriosis\n- Adenomyosis\n- Ovarian cysts\n- Intrauterine\/pelvic adhesions\n- Silent PID\n- Congenital abnormalities (imperforated hymen, cervical stenosis)\n- Other (psychogenic, IBD)\n\nA trial of NSAIDs can be considered in the absence of these features. When contraception is also needed, hormonal contraceptive methods are used (e.g. oral contraceptives).","ref":"UpToDate","tags":"Gynecology, Dysmenorrhea","_id":6},{"id":5,"stem":"Which of the following is NOT a diagnostic feature of depression?","opt1":"Depressed mood","opt2":"Diminished interest in selected activities","opt3":"Over-eating","opt4":"Decreased concentration at work","disc":"DSM-5 criteria for depression include the following. At least 5 symptoms should be there for a period of 2 weeks and at least one of the symptoms should include depressed mood or loss of interest\/pleasure.\r\n\r\n- Depressed mood most of the day, nearly every day.\r\n- Markedly diminished interest or pleasure in all, or almost all, activities most of the day, nearly every day.\r\n- Significant weight loss when not dieting or weight gain, or decrease or increase in appetite nearly every day.\r\n- A slowing down of thought and a reduction of physical movement (observable by others, not merely subjective feelings of restlessness or being slowed down).\r\n- Fatigue or loss of energy nearly every day.\r\n- Feelings of worthlessness or excessive or inappropriate guilt nearly every day.\r\n- Diminished ability to think or concentrate, or indecisiveness, nearly every day.\r\n- Recurrent thoughts of death, recurrent suicidal ideation without a specific plan, or a suicide attempt or a specific plan for committing suicide.","ref":"DSM-5","tags":"Psychiatry, Depression","_id":5},{"id":4,"stem":"Which of the following is most commonly seen in patients with acanthosis nigricans?","opt1":"Hodgkin lymphoma","opt2":"Familial acanthosis nigricans","opt3":"Paraneoplastic syndrome with gastric adenocarcinoma","opt4":"Insulin resistance","disc":"Acanthosis nigricans is a benign disease characterized by velvety hyperpigmented plaques on the skin. Insulin resistance plays a key role in the majority of the cases.\r\n\r\nOther causes include:\r\n- Genetic syndromes\r\n- Familial (rare, autosomal dominant condition)\r\n- Malignancy (gastric adenocarcinoma, hepatocellular carcinoma, adenocarcinoma of the lung)\r\n- Drug reactions (glucocorticoids, injected insulin, contraceptives)","ref":"UpToDate","tags":"Medicine, Dermatology, Endocrinology","_id":4},{"id":3,"stem":"Signs of congestive heart failure in children include all of the following EXCEPT","opt1":"Gallop rhythm","opt2":"Periorbital edema","opt3":"Basal crepitations","opt4":"Hepatomegaly","disc":"Symptoms of heart failure vary with age.\r\n- Infants: tachypnea, diaphoresis, easy fatiguability, irritability, poor feeding, and weight gain\r\n- Young children: GI symptoms (pain, vomiting, nausea), failure to thrive, easy fatiguability, chronic cough and wheezing\r\n- Older children: exercise intolerance, anorexia, abdominal pain, wheezing, dyspnea, edema, palpitations, chest pain, or syncope\r\n\r\nPhysical examination may reveal\r\n- Tachycardia\r\n- Poor perfusion (cold peripheries, low systolic blood pressure)\r\n- S3 gallop rhythm\r\n- Tachypnea, crackles, and wheezing\r\n- Hepatomegaly, splenomegaly\r\n- Raised JVP and peripheral edema","ref":"UpToDate","tags":"Pediatrics, Cardiology","_id":3},{"id":2,"stem":"Anterior uveitis is a common finding in the following conditions EXCEPT","opt1":"Rheumatoid arthritis","opt2":"Sarcoidosis","opt3":"Behcet's disease","opt4":"Reiter's disease","disc":"Uveitis (intraocular inflammation) can result from many conditions. Inflammation of the anterior uveal tract (presence of leukocytes in the anterior chamber) is called anterior uveitis (iritis). Although it can occur as an isolated process, other systemic medical illnesses including infections and inflammation are more common etiologies.\r\n\r\nCauses:\r\n1. Infections - Herpes virus, Cytomegalovirus, Toxoplasmosis, syphilis, tuberculosis, cat-scratch disease, West Nile virus, Ebola virus, Zika virus\r\n2. Systemic inflammatory disease - Spondyloarthritis (ankylosing spondylitis, reactive arthritis), Sarcoidosis, Juvenile idiopathic arthritis, Psoriatic arthritis, Inflammatory bowel disease, Multiple sclerosis, Behcet syndrome, Kawasaki disease, Sjogren's syndrome, SLE, Systemic vasculitis\r\n3. Drugs and hypersensitivity reactions - Rifabutin, Cidofovir, Fluoroquinolones, Bisphosphonates, Cancer immunotherapy.\r\n\r\nAlthough scleritis and episcleritis can occur in approximately 5% of patients with rheumatoid arthritis, uveitis is not a common finding.","ref":"UpToDate","tags":"Medicine, Ophthalmology","_id":2},{"id":1,"stem":"Known cause(s) of primary amenorrhea is\/are","opt1":"Agenesis of Mullerian system","opt2":"Kallmann syndrome","opt3":"Gonadal agenesis","opt4":"All of the above","disc":"Primary amenorrhea is defined as the absence of menses by 15 years of age. \r\n\r\nThe majority is due to chromosomal abnormalities leading to gonadal dysgenesis. Other causes include,\r\n- Gonadal dysgenesis\r\n- Mullerian agenesis\r\n- Physiological delay\r\n- Polycystic ovarian syndrome\r\n- Isolated GnRH deficiency (when associated with anosmia, it is called Kallmann syndrome)\r\n- Transvaginal septum\r\n- Weight loss\/anorexia\r\n- Hypopituitarism","ref":"UpToDate","tags":"Gynecology","_id":1}]